{
	"_default": {
		"1": {
			"rating": "2.0",
			"desc": "Grew too fast",
			"pros": "Everyone is kind and tries to be as helpfulRemote office budget is generous",
			"cons": "High churn in management and lot of layering as the company growsTechnology stack is immature compared to other companiesValuation flat liningNo mega backdoor roth",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*********  Engineering Manager - May 4, 2022"
		},
		"2": {
			"rating": "3.0",
			"desc": "Awful work life balance, good comp. ",
			"pros": "Good comp. High valuation but it's inflatedBenefits are great ",
			"cons": "Paper money Awful work life balance Managers are terrible & everything is URGENT",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*********  IT Engineer III - May 6, 2022"
		},
		"3": {
			"rating": "5.0",
			"desc": "Top talent ",
			"pros": "Learning opportunitiesCoworkersRemote culture Eng focusPerksPayGood for resume",
			"cons": "Not public yet but hopefully will occur in the next few years. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  Software Engineer - May 6, 2022"
		},
		"4": {
			"rating": "3.0",
			"desc": "Bad wlb, little focus, lots of toil",
			"pros": "Fast career growth and great teammates + direct managers. Decent compensation at first but doesn't scale with performance",
			"cons": "Opaque decision making from leadership leads to everything being top priority. Never ending fires and scope creep makes it easy to burn out",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i***  Software Engineer - May 4, 2022"
		},
		"5": {
			"rating": "5.0",
			"desc": "Still great",
			"pros": "Long time employee, still love it here, it's just bigger",
			"cons": "Less transparency than before by a fair bit which is disappointing",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*****  Software Engineer - May 4, 2022"
		},
		"6": {
			"rating": "4.0",
			"desc": "Good for people that like the hustle life",
			"pros": "-freedom and flexibility; my work is not bound by my job title -people are nice; haven't experienced any political drama -leadership is inspiring; we have smart and grounded org leaders",
			"cons": "-terrible terrible work life balance; weekends are mostly spent to recover from the week-you need to be ready with things breaking all the time -so many reorgs!-low retention ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Program Manager II - May 4, 2022"
		},
		"7": {
			"rating": "3.0",
			"desc": "Rapidly going downhill",
			"pros": "Great base salary and bonusGood coworkers, friendly cultureRemote friendly",
			"cons": "Terrible WLBSwitch to yearly RSU grants limits upside Leadership can't prioritize initiatives and keeps tripping over themselves ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q******  Engineering Manager - May 3, 2022"
		},
		"8": {
			"rating": "2.0",
			"desc": "Good as a stepping stone",
			"pros": "Good up front payFriendly to remote work Still wants to act as a start up",
			"cons": "Wonky comp structureTerrible WLBInexperienced managers can make or break your Stripe experience ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Sales - May 3, 2022"
		},
		"9": {
			"rating": "4.0",
			"desc": "Good place to work ",
			"pros": "Only a few weeks in but great manager/team, great comp package, product continues to evolve so there's a lot of stability in the current economy ",
			"cons": "Things are over documented almost to a fault to where you spend 15 minutes trying to get the answer to something because it's all spread out. Not a big deal and good things are documented but it's almost over complicated. I think they're working to improve this. Otherwise I don't have many cons but I'm still relatively new ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w*****  Researcher - May 3, 2022"
		},
		"10": {
			"rating": "3.0",
			"desc": "Poorly managed but WLB okay",
			"pros": "Good compGood benefits and PTOPeople are generally very smart",
			"cons": "Honestly after 1.5 years here I can say I don't get stressed out WRT WLB often. I'm actually more stressed about not having anything to do. There are too many conflicting priorities and cross org blockages that make it really not fun to be an engineer.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Software Engineer - May 2, 2022"
		},
		"11": {
			"rating": "4.0",
			"desc": "Super smart people working in an ambitious, user-focused culture",
			"pros": "High talent bar means you're generally working with excellent peopleExciting mission and real opportunity to impact economic infraInspiring, involved, accessible company leaders",
			"cons": "So many new managers and ever-changing org structureSome teams seem particularly lacking in psych safety / trustDecision-making is slower than expected for a company of this size",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  G*****  People Manager - May 2, 2022"
		},
		"12": {
			"rating": "3.0",
			"desc": "Great company",
			"pros": "meaningful missiongood people to work withchallenging product set",
			"cons": "no WLBlow comp relative to other similar sized companies",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Sales & Business Development Manager - May 2, 2022"
		},
		"13": {
			"rating": "5.0",
			"desc": "Great place to work ",
			"pros": "The company has great ambitions and interesting problems to work on. I've been here years and it still has a lot of upside. People are collaborative and friendly. WLB is solid. ",
			"cons": "Going through some growing pains due to massive hiring. Leadership feels less transparent, and after fours I still don't have liquidity. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f******  Software Engineer - Apr 30, 2022"
		},
		"14": {
			"rating": "3.0",
			"desc": "Do great work but sacrifice mental health",
			"pros": "- Stripe pushes you to do your best work - brand name company - increases your attention to detail - intentional company - kind people ",
			"cons": "- will overwork you with little reward. pushes you to be your best at the cost of mental health - perfectionist to a fault- managers will push you into roles that aren't the right fit for you- unclear expectations - a lot of unhappy people ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*******  Program Manager - Apr 28, 2022"
		},
		"15": {
			"rating": "2.0",
			"desc": "Lack of WLB",
			"pros": "High pay People are niceFree foodGood benefits  anddd ",
			"cons": "No WLB Unclear goalsChange project every monthTalk too much",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Software Engineer - Apr 28, 2022"
		},
		"16": {
			"rating": "4.0",
			"desc": "Great career progression",
			"pros": "+ Career Growth+ Opportunity for impact+ High calibre people",
			"cons": "Fast paced, a lot of ambiguity which is not for everyone",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  D*****  Recruiter - Apr 28, 2022"
		},
		"17": {
			"rating": "5.0",
			"desc": "Best place I've worked",
			"pros": "Challenging but exciting projectsExciting growth Great coworkers Great work life balance ",
			"cons": "Management means well but they do not always prioritize well ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  E*****  Program Manager - Apr 27, 2022"
		},
		"18": {
			"rating": "5.0",
			"desc": "Incredibly smart, driven, caring people that want to learn, move fast and make the world a better place",
			"pros": "Lots of internal mobility opportunities. Career growth path is not set, you can tailor it to your interest and what you are passionate about.Comp and benefits are strongStrong foundation but still so much to build/influence/ownPeople really care about doing what is best for users",
			"cons": "Still growing and building a lot - that is exciting for a lot of people though",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Recruiter - Apr 27, 2022"
		},
		"19": {
			"rating": "4.0",
			"desc": "Great place to grow as an engineer",
			"pros": "- comp is great- coworkers are great- the work is engaging, if you pick the right projects",
			"cons": "- WLB can be bad if you don't put your foot down about how much you will and will not work. I have and haven't seen any downside to it so far. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  G*****  Engineer - Apr 27, 2022"
		},
		"20": {
			"rating": "3.0",
			"desc": "It's fine. Some rough spots but believable things will improve. ",
			"pros": "- get to learn a fascinating industry- business open to change and semi-effective at it- soft skills bootcamp- good comp and food",
			"cons": "- not enough coding time/experience- managers can be extremely underwhelming- too many interviews- promos are too political",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Senior Software Engineer - Apr 27, 2022"
		},
		"21": {
			"rating": "1.0",
			"desc": "Baby Amazon",
			"pros": "High pay,Fast paced,Smart co-workers,Permanent remote option,Remote since Mar 2020",
			"cons": "IPO uncertainty,Poor WLB,Illegal hiring and firing practices,Toxic positivity - anything negative is either ignored or covered up, not addressedPTO balance not paid out upon departure (except in states that require it like CA)Internal tooling is janky",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  ***********  Software Engineer - Apr 26, 2022"
		},
		"22": {
			"rating": "4.0",
			"desc": "Pleasantly surprised!",
			"pros": "- Great benefits- Great pay- Generous time off- Culture seems solid- Lots of nice and smart people- Actually decent WLB in my org (40-45 hrs/wk)- Management is way better than I was expecting based on Blind posts- Awesome work in a interesting industry",
			"cons": "Hyper growth definitely causes some growing pains. Explosion of content internally as more people join, some confusion as reorgs become more common with lots of people joining, workload increasing across the board, increased pace of product improvements/pivoting, etc. My org has seen some of these things but my team and management have all done really well to minimize the impact.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Solutions Architect - Apr 26, 2022"
		},
		"23": {
			"rating": "2.0",
			"desc": "Very bad WLB",
			"pros": "- Compensations are good. - a lot of vacation days",
			"cons": "- really, really bad WLB.- nearly no 401k match",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  E*****  Software Engineer - Apr 25, 2022"
		},
		"24": {
			"rating": "5.0",
			"desc": "Solid option",
			"pros": "Founders are wicked smart, thoughtful and pragmatic. Stability of an established company without the bureaucracy of a FAANGBusiness model isn't built on advertising Opportunity for impact is everywhereCo-workers are smart, kind, driven.",
			"cons": "If you want the highest TC / Best WLB combo / don't care about the company mission or ambitious goals.. Go elsewhere.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Engineer - Apr 25, 2022"
		},
		"25": {
			"rating": "1.0",
			"desc": "Culture is gone",
			"pros": "Years ago it was a fun and exciting place to work…not it's a miserable place that is due for a mass exodus of people.",
			"cons": "If only I cloud give negative stars for culture…I've never seen a worse culture. Over the past 3 years it's gone from good culture to okay to horrendous. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Solutions Architect - Apr 25, 2022"
		},
		"26": {
			"rating": "4.0",
			"desc": "Lots of growth opportunities ",
			"pros": "Base pay, stocks and bonuses are competitive compared to the market",
			"cons": "Lots of overtimes hours can be involved during busy times",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Finance - Apr 23, 2022"
		},
		"27": {
			"rating": "5.0",
			"desc": "Great company to learn",
			"pros": "You will get chance to work with great people around ",
			"cons": "Valuation seems to be cappedWork life balance depends on team ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*********  Engineer - Apr 23, 2022"
		},
		"28": {
			"rating": "4.0",
			"desc": "Great development opportunities ",
			"pros": "A lot of interesting and high impact technical problems to solve",
			"cons": "No longer a small company, feels more corporate like and with less transparency",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*****  Software Engineering - Apr 22, 2022"
		},
		"29": {
			"rating": "2.0",
			"desc": "It all depends on the team you work for",
			"pros": "Potential as a leader in the payments and fintech space ",
			"cons": "Your experience in the company is completely dependent on the team you end up working for, and the culture across teams does not appear consistent",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Program Manager - Apr 22, 2022"
		},
		"30": {
			"rating": "4.0",
			"desc": "Be prepared to work hard ",
			"pros": "Lots of challenging problems to solve and growth opportunities. You'll never be bored.",
			"cons": "Tons of change - more so than I've experienced than any other company.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*****  Recruiter - Apr 22, 2022"
		},
		"31": {
			"rating": "5.0",
			"desc": "Abundance of opportunities, great environment for rapid early career growth",
			"pros": "* A number of high impact projects lined up within our team, and support from leadership* Lots of opportunities to explore a variety of experiences, both in terms of tech stack + shape of work. e.g. scoping out projects, fullstack + backend + ML, leading org-wide discussions in product reviews",
			"cons": "* No longer a small company – you won't necessarily get the startup energy that Stripe may have once been known for",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Software Engineer - Apr 22, 2022"
		},
		"32": {
			"rating": "4.0",
			"desc": "Solid",
			"pros": "Smart coworkers and fast-paced work environment makes for a good experience",
			"cons": "There are a lot of different priorities all at once",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Software Engineer - Apr 21, 2022"
		},
		"33": {
			"rating": "5.0",
			"desc": "The next big thing",
			"pros": "- They don't want to be Google or Facebook - constantly looking to do things in a different way. - A product and product strategy second to none.- Noticeably higher talent bar and interesting work.- Truly global in nature (even two headquarters).- $$$$",
			"cons": "- Can be intense work at times and you need to know how to set boundaries and speak up. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Program Manager - Apr 21, 2022"
		},
		"34": {
			"rating": "3.0",
			"desc": "the magic is gone",
			"pros": "Stable middleman that will get a small cut of online activity forever.",
			"cons": "Everything's compartmentalized now. You can't learn product or system design by watching experts. Your questions and opinions are unwelcome. Do what you're told for your team's OKRs.Perf is a dice roll. Equity is stingy, doesn't appreciate, and the downside protection of annual grants was proved BS.It's a generic mid-sized company with middle managers chasing numbers and endless meetings trying to get things from other teams. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  1*********  Engineer - Apr 21, 2022"
		},
		"35": {
			"rating": "2.0",
			"desc": "Not what it seems",
			"pros": "Awesome peersLots of unsolved problemsHiring a lotPre IPO",
			"cons": "Toxic culture, toxic managers, no prioritization, no focus, no wlb",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Software Engineer - Apr 20, 2022"
		},
		"36": {
			"rating": "5.0",
			"desc": "My last 4 years at Stripe have been nothing short of exhilarating. I started my career at a consulting firm, then worked",
			"pros": "The people are fun and very smart (my team specifically, but also generally the people i encounter)Quick and consistent access to senior leadershipHard problems with hard solutionsOrg is expanding fast, the good ones get a lot of career opportunities ",
			"cons": "last two years stripe has felt less like a startup and more like a big company ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o*****  Product Manager - Apr 18, 2022"
		},
		"37": {
			"rating": "2.0",
			"desc": "Toxic culture",
			"pros": "Growing company, good list of problems, new opportunities, new business areas",
			"cons": "Lots of mediocre engineers who think they are special. Egos all over, toxic culture, you need to be part of the circle if you want to survive. Also the hiring process is very biased and subjective. Pay is attest in the middle band.",
			"resignation reason": "Done with it, could not suck up anymore. Don't need to sell my soul ",
			"authorInfo": "Verified User Former Employee  r*********  Software Engineer - Apr 18, 2022"
		},
		"38": {
			"rating": "1.0",
			"desc": "Not great ",
			"pros": "Money is good and that is about it. Not worth it  ",
			"cons": "If you aren't part of old guard you aren't part of the company. Illegal hiring practices. Inexperienced managers. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q*****  Recruiter - Apr 17, 2022"
		},
		"39": {
			"rating": "5.0",
			"desc": "Good career growth",
			"pros": "Autonomy, ability to drive projects; kind, funny, capable coworkers across the company.  Opportunities to take more responsibility.  ",
			"cons": "Many re orgs, many moving parts.  Working hard at times.  ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o*****  Engineer - Apr 17, 2022"
		},
		"40": {
			"rating": "5.0",
			"desc": "Great mission, strong ownership culture",
			"pros": "People are very helpful, the mission overall is admirable, the company enables people to own their work",
			"cons": "Some problems with indecisiveness and having too many priorities. Feedback is not always given directly",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g****  Software Engineer - Apr 17, 2022"
		},
		"41": {
			"rating": "5.0",
			"desc": "Great culture ",
			"pros": "Very smart people, ambitious, and nice. Really enjoy working here!",
			"cons": "High pressure as it's a fast moving environment. Work hard. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Software Engineer - Apr 15, 2022"
		},
		"42": {
			"rating": "5.0",
			"desc": "Leadership is incredible, perfect place for early career",
			"pros": "Anything I want to do, I can do. There is so much responsibility and ownership passed down to ICs that are relatively fresh. If you're looking to grow, stripe is the place.Management is great, and leadership is no bullshit - straight to value and no corpo speak.",
			"cons": "WLB. Everyone here is amazing and keeping up with them can be quite the challenge.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Software Engineer - Apr 14, 2022"
		},
		"43": {
			"rating": "5.0",
			"desc": "Need to be multi-faceted",
			"pros": "Challenging, high impact work High compensation Generous bonus for high performers",
			"cons": "Work is bearable, but not if you just want to do development everyday. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h********  Software Engineer - Apr 13, 2022"
		},
		"44": {
			"rating": "5.0",
			"desc": "Great People, Room for Growth & Above Average Pay ",
			"pros": "- People are smart, kind and hard working. - Above average pay - People are excited about Stripe's future",
			"cons": "- WLB has its challenges but it really depends on your team. You need to set boundaries",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Recruiter - Apr 13, 2022"
		},
		"45": {
			"rating": "1.0",
			"desc": "Get paid well to do underwhelming and uninteresting things",
			"pros": "Base pay is competitive and at the top of the marketGreat products for its customersA market leader in fintech industry",
			"cons": "People in general are nice to your face but may be backstabbers (extreme passive aggressive SF culture)Management ruthlessly political, doesn't know what it's doing, doesn't value true leadership and will fire you if you don't completely follow their waysWork itself is brain numbingly boring and sheer drudgery - a step down from what most people were doing before they came to StripeThere is Fear of taking risks and taking ownership can be penalizedProduct and Engineering are horrible at scoping or estimating level of effort henceDelivery much slower than in more traditional or established companiesPerfectionist, fast waterfall culture and underwhelming work causes burnout for a lot of peopleCompany more than doubled in headcount for no good reason in 2021 - newer folks are unhappy with WLB and AVG with most looking to move on after they vest in 1 yr",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  **********  Global Program Manager - Apr 13, 2022"
		},
		"46": {
			"rating": "4.0",
			"desc": "Happy to be Here",
			"pros": "I've been enjoying Stripe since I started last year.  There are some growing pains, but that is to be expected with a company of this size.  The culture has been great, I haven't had any issues re: WLB. Process/tools are slow to scale with the company, leadership has been receptive.  Eager to see if feedback impacts workflows.  Comp is a bit lower than what I was receiving from alternative offers, but not by far.  Depending on where you are in your career, this could be a great jumping point to get in on the company and grow. ",
			"cons": "Tools, Process, Overall Comp, Onboarding, Sales EnablementInternal tools/process are slow to scale",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y*******  Sales - Apr 12, 2022"
		},
		"47": {
			"rating": "3.0",
			"desc": "Bad WLB, great place to grow comm skills",
			"pros": "-Grow your communication skills - expect tons of XFN communication with different roles -Tons of areas for ownership and impact-Great pay",
			"cons": "-WLB is trash, better for some, worse for others, but generally not great-Ton of bureaucracy. Expect to spend more time communicating, writing docs, than actually building-Lot of tech debt-More work placed on plate with unshifting deadlines",
			"resignation reason": "Seeking better culture, WLB, and less bureacracy. Also, realized I'm not a fan of fintech.",
			"authorInfo": "Verified User Former Employee  b******  Engineer - Apr 11, 2022"
		},
		"48": {
			"rating": "1.0",
			"desc": "High pay / horrible culture / meh work",
			"pros": "* high pay* resume value* lot of smart people",
			"cons": "* culture sucks* managers have quite a bit of power, you end up with a bad one you're screwed* work is not that great. Systems are inefficient, frustrating * most of the company is new and they're having a hard time keeping focus",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  E*****  Software Engineer - Apr 11, 2022"
		},
		"49": {
			"rating": "3.0",
			"desc": "WLB sucks, can be a great place to grow career ",
			"pros": "Very bureaucratic, advantageous if you make the right relationshipsGood compensation albeit mostly on paper",
			"cons": "WLB is ass, very stressful performance cyclePeople are not the nicest",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d******  Staff Engineer - Apr 10, 2022"
		},
		"50": {
			"rating": "3.0",
			"desc": "Paid well, but disarray",
			"pros": "Good payI like most of my teammates Decent benefits Remote is available ",
			"cons": "Management seems to lack focus Not exactly equitable pay Hustle culture for days Not enough time off ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Software Engineer II - Apr 10, 2022"
		},
		"51": {
			"rating": "3.0",
			"desc": "Worst WLB, period.",
			"pros": "Good exposure.WFH flexibility Not sure what else to say",
			"cons": "Worst management No wlbToxicRe-orgs are usual for every quarter ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*****  Data Engineer III - Apr 9, 2022"
		},
		"52": {
			"rating": "4.0",
			"desc": "Decent TC but not so good for career growth and work-life balance",
			"pros": "Comp and benefits are decent if you joined early enough to get a 4 year grant",
			"cons": "Work-life balance ain't great. Career progression isn't transparent at all",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Data Scientist - Apr 9, 2022"
		},
		"53": {
			"rating": "1.0",
			"desc": "Pays well but that's it",
			"pros": "Top of market compSome great colleaguesCan grow your career if you are willing to work nonstop and kiss the right ass",
			"cons": "Terrible wlbTerrible managementYou will burnout and fantasize about quitting weeklyThis used to be a great place but poor management and unchecked growth has ruined it. Do not recommend.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d******  Program Manager - Apr 7, 2022"
		},
		"54": {
			"rating": "4.0",
			"desc": "Still huge growth potential",
			"pros": "- company still have long runway for growth- great product",
			"cons": "- Every process is overcomplicated- need more resources, many people are burnt out",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  M*****  Sales - Apr 7, 2022"
		},
		"55": {
			"rating": "3.0",
			"desc": "Culture is going downhill ",
			"pros": "Company is growing and most engineers are very good at what they do",
			"cons": "Bad management, bad work life balance, burnout, no career path ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y****  Software Engineer - Apr 6, 2022"
		},
		"56": {
			"rating": "5.0",
			"desc": "Great Place to work",
			"pros": "Development opportunities Great cultureFast growth Big opportunity aheadFun and smart coworkers ",
			"cons": "WLB not always Some office populations have outgrown capacity, so physical office space needs to grow more ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Account Executive - Apr 6, 2022"
		},
		"57": {
			"rating": "4.0",
			"desc": "Great WLB but that's it",
			"pros": "- Top notch benefits (healthcare, food, wellness, etc)- Managers will respect your time off and calendar blocks - Workplace culture is great. Generally everyone is friendly and nice. Very few assholes, though that's probably changed given we've ramped up hiring so much.",
			"cons": "- Internal mobility sucks. Stripe makes it difficult for internal movement and will lowball you with the offer (if you do get it). Don't come in expecting to grow your career here and make moves.- Management can be toxic in some orgs- Performance bar is high and you may be subject to the Amazon curve to fill a quota. Difficult to perform well, can be quite political. - Moves slowly at times, core US leadership does not recognize the market potential for APAC",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*********  Operations Specialist - Apr 6, 2022"
		},
		"58": {
			"rating": "5.0",
			"desc": "Great future",
			"pros": "Company has the potential to live up to its private valuation",
			"cons": "Developer experience could be improved. Some teams have low morale",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*****  Software Engineer - Apr 6, 2022"
		},
		"59": {
			"rating": "3.0",
			"desc": "Mediocre startup with growing pains",
			"pros": "Comp has gone up dramatically due to last stage valuation jumpsProduct is pretty good",
			"cons": "Immature tech stackManagers have total power over you, need to be friends to get promo",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*******  Software Engineer - Apr 6, 2022"
		},
		"60": {
			"rating": "3.0",
			"desc": "Great product, average engineering, bad WLB",
			"pros": "Product is great, customers generally have a positive experience. Founders are inspiring. Good comp, though folks on annual grant have limited upside. Great historical trajectory",
			"cons": "Below average engineering quality, high burnout rate. Poor prioritization (everything urgent, changing every 1-2 months)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S********  Engineer - Apr 6, 2022"
		},
		"61": {
			"rating": "4.0",
			"desc": "Good comp but there isn't much of a company culture given the rapid hiring",
			"pros": "- good comp / TC- good benefits- well known brand in FinTech",
			"cons": "- no work life balance- your growth, choice of projects etc. All relies on your manager. If ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  M*****  Product Manager - Apr 5, 2022"
		},
		"62": {
			"rating": "4.0",
			"desc": "Better than most",
			"pros": "Above average total compensationSomewhat flexible scheduleDecent work life balance",
			"cons": "Performance can be subjectiveIlliquid equity from double-trigger RSUsDocument heavy",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Software Engineer - Apr 5, 2022"
		},
		"63": {
			"rating": "4.0",
			"desc": "Excellent Place but no walk in the park",
			"pros": "Stripes are all generally very kind, smart and supportive in my experience.Challenging and impactful problems abound.",
			"cons": "Work/Life balance can be drastically improved. Everyone seems to take great pride in working at a non-sustainable pace committing code while on vacation and on the weekends. Definitely not a very friendly circumstance for Stripes with young families.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*****  Software Engineer - Apr 5, 2022"
		},
		"64": {
			"rating": "5.0",
			"desc": "No complaints",
			"pros": "Great benefits and great pay, even if you're remote in low cost of living.",
			"cons": "Promos seem slow and impact culture gamifies the promotion process. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*****  Software Engineer - Apr 5, 2022"
		},
		"65": {
			"rating": "2.0",
			"desc": "Would not recommend for most people",
			"pros": "Good compensation and benefitsLots of strong engineers to learn from",
			"cons": "Unsupportive managementcutthroat culture with stressful performance review processexpect to work very hard",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Engineering Manager - Apr 4, 2022"
		},
		"66": {
			"rating": "5.0",
			"desc": "Good career growth ",
			"pros": "Lots of opportunity for career growth if you seek it out",
			"cons": "Definitely need to self-advocate, regularly shifting priorities that you need to adapt to ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o*****  Software Engineer - Apr 4, 2022"
		},
		"67": {
			"rating": "3.0",
			"desc": "Strong potential, but hard",
			"pros": "- Strong comp- Strong ownership- Flexible schedules (but still a lot of hours)",
			"cons": "- Culture & management is deteriorating- WLB is bad",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Software Engineer - Apr 3, 2022"
		},
		"68": {
			"rating": "1.0",
			"desc": "Not worth the sacrifice",
			"pros": "- great comp, though illiquid RSUs- fully remote- smart peers",
			"cons": "Management is awful. Meaningless numbers are chased to paint a pretty picture every level upwards, with no basis in the actual work getting done or how impactful the final results will actually beThere is no Stripe culture. The culture you get is whatever your manager is comfortable dishing out. You can use the slack channels as an escape but that only lasts for a few minutesWLB is non-existent. You will likely be working on weekends to hit deadlines for poorly thought out roadmaps that will inevitably be pushed backed and you will take a perf hit for it. There is no room for negotiation on deadlines. The company follows fast-waterfall, not agileNo sense of community. Every team has office hours and spends 90% of their time on KTLO work rather than being given time to rearchitect horrible code written over a decade ago by junior engs. If you need to talk to another team, I hope you planned well in advance because you will be interacting with them as if they were a consulting company.PMs are like 2nd managers. I've yet to see what our PM even does to affect our work apart from tell us if the final product we produce is good enough or not. Many teams don't even have a PM. Processes may or may not exist for whatever it is you're trying to do. Good luck finding out whichLow morale. Everyone feels overworked. We are in a nearly 14 year old company that feels like we just started 2 years ago. Simple things you would expect for a 7000 employee Fintech company are not in-place.  Coding actually slows down your job, the logic for simple things is buring beneath dozens of unnecessary layers because of all the cooks who have touched it over the years trying to add value in their own way.You will dread Mondays, even Sundays, knowing you have to get back to writing a 5 page doc summarizing how you will add these 10 LOC. You will submit your PR and be surprised that a completely other team already has a solution for your problem from the last 3 weeks.Not worth it, WLB is so valuable, don't throw it away. Will leave as soon as my 1 yr vest is in.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*****  Software Engineer - Apr 3, 2022"
		},
		"69": {
			"rating": "4.0",
			"desc": "Exciting place to work depending on team",
			"pros": "Brilliant coworkers and exciting new product launches. Everyone works hard. ",
			"cons": "Horrible work life balance and chaotic tech stack amidst everything migrating",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  🧃*****  Software Engineer - Apr 3, 2022"
		},
		"70": {
			"rating": "3.0",
			"desc": "Great Comp everything else is somewhat mediocre ",
			"pros": "- good comp across the board - somewhat decent WLB, but will vary by team ",
			"cons": "- political culture when it comes to decision making. Way too much tribal language and knowledge required - AVG- hard to meet expectations and hard to get in front of the right opportunities ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*********  Senior Software Back End Engineer - Apr 1, 2022"
		},
		"71": {
			"rating": "2.0",
			"desc": "Not what it used to be ",
			"pros": "I still think Stripe pays top of the market even with the new ARG structure",
			"cons": "As of March2022 Stripe has over 7000 employees with more than half of the company having less than a year tenureMassive massive growing pain. Culture issue. Management issue. So many cooks in the kitchen ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p**********  Engineer - Apr 1, 2022"
		},
		"72": {
			"rating": "4.0",
			"desc": "Not a Relax Place",
			"pros": "Smart People, Decent Comp, fast paced  and better growth opportunity",
			"cons": "Valuation is over hyped, no wlb, high turn over rate",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Software Engineer - Mar 31, 2022"
		},
		"73": {
			"rating": "3.0",
			"desc": "Depends on what you want ",
			"pros": "Business driven, and there is lot is opportunities in almost all teams",
			"cons": "Poor work life balance, poor engineering quality, tooling and infra is a mess ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  Software Engineer - Mar 30, 2022"
		},
		"74": {
			"rating": "1.0",
			"desc": "Horrible wlb and politics",
			"pros": "Money is good. Benefits are good. Wfh subsidy is good.",
			"cons": "Averaging a reorg every 1.5 months because of game of thrones politics at the leadership level. I've had 9+ manager changes in 1.5 years and counting.Game of thrones politics trickles down to IC layer where someone has to take the fall for mismanaged projects not hitting artificial deadlines so figure out how to story tell your way out of being the weakest link. I've rarely seen a fired person being the actual weakest link.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S*****  Software Engineer - Mar 29, 2022"
		},
		"75": {
			"rating": "3.0",
			"desc": "Bad WLB and not much growth ",
			"pros": "Stripe is best for someone who is either fresh out of school or looking for their second gig out of investment banking or consulting. High caliber talent, decent benefits ",
			"cons": "If you are experienced in your domain area join at your own discretion because the company has no interest in developing in your career growth. There is high and unclear expectations. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Sales - Mar 29, 2022"
		},
		"76": {
			"rating": "1.0",
			"desc": "Do not join Stripe - it will suck everything out of your",
			"pros": "The other ICs are the most stellar ICs I've every worked with. Smart, humble, great at their jobs. That is the only good thing I can say about the company. And Stripe just sucks out all the good. No-one I know is happy in their job or happy to be at Stripe. It's exhausting to consistently be talking people down from quitting or just giving up. ",
			"cons": "Career Growth: Leadership has made it clear they only want to hire externally for manager positions. The head of our business said that he wants to recruit people who led big teams and have them lead small teams at Stripe. Makes no sense. Lack of recognition: No-one gets recognition. The leadership team commissioned an artist to provide a PIN if you sell all of Stripe's products. Not money, not a SPIFF. A pin - this is the same thing my son gets in kindergarten for a good day at school. I'm not kidding. Leadership: Some of the most incompetent, insecure, uninspiring leaders I've ever worked for. They lack a grander vision and create a blame culture. Everything is the Account Executive's fault.What I learned: The biggest thing I've learned is how not to manage. My manager goes from meeting to meeting like a roller coaster. Doesn't provide any meaningful insight or establish any credible relationships with customers. I can't think of one positive thing I've learned from any of the leaders.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*****  Account Executive - Mar 29, 2022"
		},
		"77": {
			"rating": "2.0",
			"desc": "Aspires to be the next Amazon, already there culturally",
			"pros": "Well positioned for business success.  Technical leader in a market still dominated by fossilised incumbents.  Beloved by our customers, whose satisfaction remains a core objective.",
			"cons": "Grew far too fast in 2020/2021.  Incoming management from Amazon has annihilated the old culture and replaced it with the worst of AWS.  Greenfield internal platforms are beset by technical and operational incompetence.  Attrition among top SWEs is unsustainably high as they flee to greener pastures.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f****  Software Engineer - Mar 29, 2022"
		},
		"78": {
			"rating": "3.0",
			"desc": "Boring",
			"pros": "WLB is not terrible, there are some smart folks here",
			"cons": "Never write any code, culture not what is used to be, comp is deceptive and not great (but there are good offers to be had relative to overall market)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e******  Software Engineer - Mar 28, 2022"
		},
		"79": {
			"rating": "5.0",
			"desc": "Lot do work to do",
			"pros": "If you like to get paid to do work, there is lots of work to be done and you will be paid well if you do it.",
			"cons": "Not a good place to slack off. You need to do work.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*****  Software Engineer - Mar 28, 2022"
		},
		"80": {
			"rating": "4.0",
			"desc": "Great Potential but leadership needs work, dealing with constant changes and process.",
			"pros": "Company itself has great potential, you can really feel the growth. Pay seems to be top percentile compare to peer companies. Expanding quickly with career opportunities. ",
			"cons": "Lack of culture and constant changes. They can improve on the processes. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Recruiter - Mar 27, 2022"
		},
		"81": {
			"rating": "3.0",
			"desc": "human batteries at a moderate cost",
			"pros": "- decent comp- llamas- beastwing- remote friendly",
			"cons": "- upper management treats people like human batteries, save for a few outstanding leaders (of whom some are leaving)- culture of overworking- poor refreshers granted in perf- some people's salary decreased during perf?- hard to get internally promoted- high number of new candidates granted staff- internal tech is a mess being untangled and then re-tangled with a move to SoA",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*****  Software Engineer - Mar 26, 2022"
		},
		"82": {
			"rating": "3.0",
			"desc": "Meh",
			"pros": "Good growth opportunity if you're willing to put the effort. ",
			"cons": "Reorgs Reorgs ReorgsKeep switching prioritiesManagement is not good ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l********  Software Engineer - Mar 25, 2022"
		},
		"83": {
			"rating": "4.0",
			"desc": "Hard work but fun to work at",
			"pros": "Collaborate vs compete culture, management is very intentional about developing their team. ",
			"cons": "GTM can be quite weak in some markets. And it can be quite difficult to get in touch with a team to help you with a fix",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h********  Solutions Architect - Mar 24, 2022"
		},
		"84": {
			"rating": "5.0",
			"desc": "Good experience - but I'm very new ",
			"pros": "Team is great, comp is great but I'm scared about the steep learning curve ",
			"cons": "I think the competition is fierce and you definitely can't be the weakest link ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Marketing Manager, Product Marketing - Mar 24, 2022"
		},
		"85": {
			"rating": "5.0",
			"desc": "Massive market. Ambitious leaders. Smart colleagues.",
			"pros": "Hard but rewarding workUser first cultureStrong autonomyGood comp",
			"cons": "WLB can be toughCompany needs to balance rigor for different stages of products",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Produce Manager - Mar 24, 2022"
		},
		"86": {
			"rating": "4.0",
			"desc": "Great company to work with if you are comfortable writing docs all day long.",
			"pros": "Great products, amazing individual contributor talent, comp and benefits are great",
			"cons": "Management keeps changing and each new manager comes with a new vision which means you constantly have to work on upper management instead of focusing on project work.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Operations Specialist - Mar 23, 2022"
		},
		"87": {
			"rating": "4.0",
			"desc": "Great compensation, exciting products, high standards, and very bad work life balance",
			"pros": "Compensation is very high and high performance is well rewarded",
			"cons": "Work life balance is poor, constant reorganizations and shifting priorities. Many ex-Amazon managers.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*******  Software Engineer - Mar 22, 2022"
		},
		"88": {
			"rating": "1.0",
			"desc": "Prepare to be under compensated, under leveled and overworked",
			"pros": "Free food is really good if you work in the office ",
			"cons": "Stripe prides themselves in underleveling employees. New grads and non senior engineers behave like senior or able. Senior engineers are doing org and company scope work and being denied promotions. Being underpaid and under appreciated is a quality stripes brag about. Some of the most brilliant, hardworking and effective people I worked with got bad reviews with one sentence feedback and were denied their equity refresh, bonus and salary adjustments. Some of the best leaders I worked with were disappeared (fired) and didn't even get to write their own good bye emails.I would only recommend working here to my worst enemy, especially now that compensation is no longer advantageous to anyone who joins before the ipo.I worked here as a L2 and got multiple offers elsewhere at senior and staff level based on what I described my responsibilities were. I've since moved on to a new company that appreciates me.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Software Engineer II - Mar 21, 2022"
		},
		"89": {
			"rating": "5.0",
			"desc": "Folks generally work hard and there's a lot to be excited about ",
			"pros": "+ Leadership (C Team)+ Product and mission + Trajectory ",
			"cons": "- Not easy / work life balance - Tons of new people ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Account Executive - Mar 21, 2022"
		},
		"90": {
			"rating": "3.0",
			"desc": "Focus is is next 2-3 months",
			"pros": "Still searching for one other than the unvested RSU's which would vest God knows when.",
			"cons": "Poor work life balance. Expected to work 24/7, even on weekends. Overall Low level of trust culture.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Applications Architect - Mar 21, 2022"
		},
		"91": {
			"rating": "5.0",
			"desc": "Chaotic but rewarding",
			"pros": "- Engineering culture- Responsive and smart leadership- Lots of smart and hardworking people that care about their craft- Perks: free books/magazines, education/health stipends, food, etc.",
			"cons": "- High expectations; not a place to coast (this is not a negative depending on your preferences)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Software Engineer - Mar 20, 2022"
		},
		"92": {
			"rating": "5.0",
			"desc": "Very happy here",
			"pros": "Ambitious and brilliantly smart co-workersFounders are inspiringGrowthTechnically challenging problemsComp is top notch - performance grants can double your initial grant Open to remote for everyone",
			"cons": "Fast pace can interfere with WLBSome growing pains of a fast growth startup",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Engineering Manager - Mar 19, 2022"
		},
		"93": {
			"rating": "2.0",
			"desc": "PIP culture ",
			"pros": "Great comp Smart co-workersGood benefits....",
			"cons": "WLBMiddle managementBroken tech Poor 401KOvervaluedPIP culture: OCI and Amazon managers ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Product Manager - Mar 19, 2022"
		},
		"94": {
			"rating": "1.0",
			"desc": "Toxic culture - stay away",
			"pros": "Comp is great, and company is well positioned in the market. Stripe is positioned to do well over the next 5 years if they can clean things up internally.",
			"cons": "- Bad WLB, most stripes work 60+ hours/week- Top down management structure with constantly shifting priorities- Tons of red tape that makes it hard to get things done- Extremely political, empire building is encouraged & rewarded (due to constantly changing headcount expectations), and those who stomp on others climb to the top. - Leadership doesn't care. CEO wants to build a culture like Amazon, and has an operating principle around firing bad talent quickly.- 15% forced PME, but low bonuses for high performers. AVG means you'll see no upside from stock appreciation. - High employee churn and constant reorgs are a huge distraction that makes it even harder to go good work. Its a shame. The product is great and has a lot of potential, but the cultural issues are going to kill stripe from the inside.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*****  Engineer - Mar 19, 2022"
		},
		"95": {
			"rating": "3.0",
			"desc": "Over ambitious, over worked, poor technology",
			"pros": "The ambition is great and there are some fun teams.",
			"cons": "wlb is terrible, management is worse, join at your own risk.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Software Engineer - Mar 19, 2022"
		},
		"96": {
			"rating": "4.0",
			"desc": "Enjoying my time but see why people don't last",
			"pros": "Comp is great. Leadership (especially on eng) is the real deal. Also a lot of opportunity to learn,grow skills, and really boost your resume.You get to work on some cool products that are making waves in the market.Some really amazing people in the company. ",
			"cons": "Raises this year sucked, no one knows when ipo will happen, work-life balance is virtually non-existent.Leadership tours everyone taking their vacation and then sets up a hunger-games style performance review cycle with stack-rank and a lot of people get a less than good rating. Company culture suffers due to how perf is managed and how leadership says Stripe is a marathon of sprints which is an odd way of saying your life is ours nowAs much as Stripe gets pumped up, there are a lot of sharks in the fintech ocean and all want a piece of use. Not all that much moat in this business. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Manager, Risk / Compliance - Mar 18, 2022"
		},
		"97": {
			"rating": "4.0",
			"desc": "Poor work life balance. Outwardly friendly culture, but often unfair compensation ",
			"pros": "Fast paced company, lots of interesting work. Some very smart people. ",
			"cons": "Outwardly nice people, but not a sense of camaraderie. Almost universally, everyone feels like their manager does not go to the bat for them (specifically in uplevel and compensation discussions).  Bad work life balance. Company will work you as much as they can. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w******  Business Operations - Mar 16, 2022"
		},
		"98": {
			"rating": "3.0",
			"desc": "Poor team health, underwhelming comp",
			"pros": "Good management structureGood career growth opportunitiesSome of the offices are nice",
			"cons": "The company is on a downward trajectory in terms of culture and had a very lackluster compensation adjustment this time around. The annual grants really make no sense. In an ideal world the company would do terribly while you are there and then go up after you leave with them. Comp is not even close to market anymore despite what HR keeps claiming. Massive burnout, they have adopted a push until they break mentality for engineers.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Manager, Data Engineering - Mar 16, 2022"
		},
		"99": {
			"rating": "4.0",
			"desc": "It's ok here",
			"pros": "Good work life balanceInteresting, clever peopleGood benefits and offices",
			"cons": "Overall a bit of a bizarre company culture. Underwhelming On its way to becoming exactly like Google.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x***  Talent Acquisition - Mar 16, 2022"
		},
		"100": {
			"rating": "4.0",
			"desc": "Slow decay",
			"pros": "Empathic team members, knock on wood great manager, good career growth",
			"cons": "Slowly losing its charm :( Once in a life time company decaying into a big corp",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Software Engineer - Mar 15, 2022"
		},
		"101": {
			"rating": "2.0",
			"desc": "Lots of business growth, terrible management and WLB",
			"pros": "Lots of opportunities for business growth, new products and markets. ",
			"cons": "Terrible mis-aligned management, no consideration of work life balance or fairness ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Product Manager II - Mar 14, 2022"
		},
		"102": {
			"rating": "5.0",
			"desc": "Demanding but rewarding",
			"pros": "The company is doing really hard work that is unlocking lots of success for their customers.",
			"cons": "Lots of big company stuff - bunches of reorgs, politics, too many meetings, and the like.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*****  Product Designer - Mar 14, 2022"
		},
		"103": {
			"rating": "4.0",
			"desc": "Great benefits and compensation",
			"pros": "- Compensation package is great- Great colleagues and team ",
			"cons": "- Lack of leadership guidance- Lack of career growth conversations ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Operation Analyst - Mar 14, 2022"
		},
		"104": {
			"rating": "4.0",
			"desc": "Not great work life balance",
			"pros": "Great co-workers, overall goal of company is great, good benefits ",
			"cons": "Not great work life balance and complicated performance review process ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Engineer - Mar 13, 2022"
		},
		"105": {
			"rating": "4.0",
			"desc": "culture was once great, now diluted",
			"pros": "far more problems than engineering bandwidth, which yields good career growth",
			"cons": "much of middle management is new and not well integrated with Stripe culture.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w*****  Software Engineer - Mar 12, 2022"
		},
		"106": {
			"rating": "4.0",
			"desc": "Good enough so far",
			"pros": "- comp and benefits- brand- perks, lots of free books- payments domain has some unique problems to thinkabout",
			"cons": "- gavel/consensus culture is draining- poor growth, no titles besides software engineer and staff, making staff internally is crazy hard, seems gatekeepy- tech stack isn't pleasant to work in, new systems are in Java",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*********  Software Engineer - Mar 7, 2022"
		},
		"107": {
			"rating": "4.0",
			"desc": "Ehhhhhh.. Money",
			"pros": "Big money, big talent, big problems, big opportunity, big friendly culture ",
			"cons": "Small WLB, small room to chill, small timelines to deliver ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  👑*******  Engineer - Mar 6, 2022"
		},
		"108": {
			"rating": "4.0",
			"desc": "Great growth opportunity and very open and friendly culture ",
			"pros": "- Lots of smart people- Leadership does a good at informing and empowering employees- Leadership is willing to call out fires and prioritize fixing them- Lots of first principles thinking for every aspect of how the company is run",
			"cons": "- Work life balance can pretty bad (depending on team)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Software Engineer - Mar 5, 2022"
		},
		"109": {
			"rating": "4.0",
			"desc": "Great culture and people but growing pains",
			"pros": "People are great, learning cultureHiring has been much faster than back thenSuper hyper growth and lots to do",
			"cons": "Growing pains when scaling esp in ROW regionsInternal mobility / career progression is limited and vague ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*****  Sales - Mar 4, 2022"
		},
		"110": {
			"rating": "2.0",
			"desc": "Very bad WLB, lack of structure and resources ",
			"pros": "People are genuinely nice and willing to helpThe product ",
			"cons": "Everyone is expected by default to perform by doing the jobs of 3 peopleThere are no clear owners of anything; absolutely a messMove fast without realizing the ramifications of what is happeningObsessed with metrics (that mostly don't reflect what is actually happening)Everyone is burnt out",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e***  Program Manager - Mar 4, 2022"
		},
		"111": {
			"rating": "4.0",
			"desc": "Great place to learn and work hard",
			"pros": "People care about doing their best, interesting and challenging problems, pays well",
			"cons": "Fast paced, wlb could be better, highly regulated environment means a lot of reviews and legal constraints on your projects",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Staff Software Engineer - Mar 2, 2022"
		},
		"112": {
			"rating": "5.0",
			"desc": "Glad I joined Stripe",
			"pros": "Great place to develop your careerGreat compensation and benefitsVery friendly culture",
			"cons": "High expectations and a focus on targets but rewarded well",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Recruiter - Mar 1, 2022"
		},
		"113": {
			"rating": "1.0",
			"desc": "Dont join",
			"pros": "Is not the same stripe before. The comp structure sucks",
			"cons": "Poor WLB. No IPO is happening. And their management does not have any future vision in where the product is going",
			"resignation reason": "Compensation was suboptimal. Liquid cash matters. Management does nor want to solve the problem",
			"authorInfo": "Verified User Former Employee  c********  Software Engineer - Mar 1, 2022"
		},
		"114": {
			"rating": "3.0",
			"desc": "Bad work life balance",
			"pros": "Good pay, many friendly coworker and benefits are ok. i can remote work.",
			"cons": "Lack of culture, pressure from all levels. People seems burnt out, very heavy oncall ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Software Engineer - Feb 28, 2022"
		},
		"115": {
			"rating": "4.0",
			"desc": "Super smart people, but they'll expect everything from you",
			"pros": "- Helpful and brilliant teammates- Smart leadership- Lots of work that needs to be done",
			"cons": "- Stressfully high expectations. Being in such high demand, Stripe can (and does) keep the lit perf bar super high. My managers and teammates are usually working late and spend a lot of time just catching up on docs- I've seen multiple managers and teammates be let go (thanks to that high bar)- Dev velocity leaves lots to be desired, especially when it comes to coding in our monolith",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Software Engineer III - Feb 28, 2022"
		},
		"116": {
			"rating": "5.0",
			"desc": "Great Company ",
			"pros": "Flexible wfh policiesGreat compAmazing peopleAwesome foodMore agency and Impact than bigger companies",
			"cons": "Work life balance, def not a place to coastOffice food too healthy lol",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y*****  Software Engineer - Feb 26, 2022"
		},
		"117": {
			"rating": "4.0",
			"desc": "good pay",
			"pros": "good oppotunity. A lot of things to do. good pay.",
			"cons": "bad management in some teams. poor wlb in some teams",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Software Engineer III - Feb 24, 2022"
		},
		"118": {
			"rating": "4.0",
			"desc": "A good tech company but not the best ",
			"pros": "Good benefits, nice offices, payment is an interesting field, and you can work remote ",
			"cons": "The sales org is very very messy, it's a good name on the resume but you're not gonna learn a lot, there are no real practical trainings ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*******  Sales - Feb 24, 2022"
		},
		"119": {
			"rating": "5.0",
			"desc": "Awesome!",
			"pros": "Work hard play hard! Rocket ship with best compensation on the market, even considering AVG. ",
			"cons": "None. Just trying to meet the min of ten words.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c******  Software Engineer - Feb 23, 2022"
		},
		"120": {
			"rating": "5.0",
			"desc": "Good place, good wlb, chill people, good TC ",
			"pros": "overall good peoplegood wlbgreat foodgood pay (except for the 1 year RSUs but there's a yearly grant that's 2 years and pretty good)engineer first culture, good developer tooling ",
			"cons": "growing very fastlots of complexity (but it's fine if your team is aware and trying to fix it)code in Ruby ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*****  Software Engineer - Feb 23, 2022"
		},
		"121": {
			"rating": "4.0",
			"desc": "Good culture and pay",
			"pros": "Comp is goodPeople are really niceCulture is great",
			"cons": "Tech stack is questionableTooling is slowToo many DSLs",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Software Engineer - Feb 23, 2022"
		},
		"122": {
			"rating": "4.0",
			"desc": "Great experience so far",
			"pros": "Growing fast if you like that sort of thing. Solid founders. Product seems like it's well-positioned in the market and growing quickly. ",
			"cons": "Growing fast if you struggle with that sort of thing. Everybody has imposter syndrome. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Program Manager - Feb 23, 2022"
		},
		"123": {
			"rating": "5.0",
			"desc": "Very happy here",
			"pros": "Great co-workers, great mission. I really love the people here and can't imagine working anywhere else.",
			"cons": "We sometimes try to do too much in too little time.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Engineer - Feb 23, 2022"
		},
		"124": {
			"rating": "1.0",
			"desc": "The emperor has no clothes!",
			"pros": "Super smart, awesome people and decent promise of a payout ",
			"cons": "Lack of leadership and direction. Hypergrowth has lead to a lot of confusion and lack of clarity with roles and leadership. It feels like the only goal is to go public, not people. Product can only take you so far. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b********  Program Manager - Feb 23, 2022"
		},
		"125": {
			"rating": "2.0",
			"desc": "Not so great work life balance ",
			"pros": "Lots of work, scopeStripe is still growing - growth opportunities ",
			"cons": "Expectations, Culture and work never endsCompensation isn't that great as they make it sound ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o*******  Product Analyst - Feb 22, 2022"
		},
		"126": {
			"rating": "4.0",
			"desc": "Growing pains but great people",
			"pros": "-smart and kind colleagues-interesting users, ability to learn a ton",
			"cons": "-growing pains, extremely fast paced work environment-changing priorities, can be hard to keep up",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J*****  Sales - Feb 21, 2022"
		},
		"127": {
			"rating": "5.0",
			"desc": "Great company with growing pains",
			"pros": "Compensation and people are top tier. Everybody is friendly and willing to help.",
			"cons": "Everything is a bit chaotic, a lot of new hires that struggle due to lack of people to help them onboard and are asked to onboard next wave.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*******  Software Engineer - Feb 21, 2022"
		},
		"128": {
			"rating": "5.0",
			"desc": "Good pay, smart coworkers",
			"pros": "Pay is in top 5% of the industry.Super smart coworkers.Work life balance is good (40 hour weeks).Company has good potential. ",
			"cons": "People complain about each other a lot.Things move so fast that most people are not caught up.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Staff Engineer - Feb 20, 2022"
		},
		"129": {
			"rating": "4.0",
			"desc": "Not for coasters",
			"pros": "I've been at Stripe >2 years. Growing pains are real but I've been lucky to be relatively unaffected by constant reorgs. Manager looks out for me, teammates are smart and diligent.Work is not the most fun or glamorous but hearing users' feedback about how Stripe has enabled their business is the most gratifying part of the job. Patrick and John are brilliant. We have weekly fireside's where we can ask them questions and they share their top of mind. ",
			"cons": "WLB is tough. Not a place for coasters. Need to learn to prioritize aggressively. Growing company pains. KTLO work not rewarded (though not sure it is at any large company). Onboarding can be hard. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Software Engineer - Feb 17, 2022"
		},
		"130": {
			"rating": "5.0",
			"desc": "Great company, high variance between teams",
			"pros": "Comp is good Many trustworthy leaders A lot of great people ",
			"cons": "Company has scaled very quicklyTech and processes and struggling to keep paceSome teams have a lot of WLB issues (though my experience is good)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*****  Staff Software Engineer - Feb 16, 2022"
		},
		"131": {
			"rating": "2.0",
			"desc": "Not worth the money",
			"pros": "There are lots of very nice, talented people and interesting products they're building. ",
			"cons": "Stripe was the most frustrating place I have ever worked. There are too many growing pains to be effective and have impact. They're trying to scale but doing it in really ineffective ways which is hurting the culture and ability for employees to be successful. They aren't clear on how they measure performance which is problematic with performance based pay. Leadership is well intentioned but don't count on them to change much. Work life balance is non-existant. There's a lot of turnover - even at leadership levels. ",
			"resignation reason": "I was sold a very different opportunity than what I actually got. I communicated to management about my frustrations and how unsustainable my work was but did not receive any support or changes made. ",
			"authorInfo": "Verified User Former Employee  D*****  Human Resources - Feb 15, 2022"
		},
		"132": {
			"rating": "1.0",
			"desc": "An absolute mess with toxic leadership",
			"pros": "The Stripe brand on your resumeRemote in the US",
			"cons": "Arrogant, toxic leadershipSub-par PTO & benefitsUtter indifference to employee liquidity needs while taking care of upper leadership",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n*********  Manager, Account Management - Feb 15, 2022"
		},
		"133": {
			"rating": "1.0",
			"desc": "Money's good",
			"pros": "Comp: That's what the money is for!Pays good enough for a certain type of person to put up with a terrible work environment. And perhaps it's not so terrible in certain orgs.",
			"cons": "People are conditioned to put on a friendly front in public (including interviews), but it's all fake. No collaboration. Empire building managers.A huge pile of poor technical decisions. If you're very, very lucky, you have to build upon this pile. Otherwise, you only get to maintain and support it.Frequent and terrible oncall are very common.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Software Engineer - Feb 14, 2022"
		},
		"134": {
			"rating": "3.0",
			"desc": "Know your Buzz Words!",
			"pros": "People and Culture are solid. Pay is OK, but not best in class for what they advertise.",
			"cons": "Carrot and stick with performance reviews....You're lucky to make SME. Valuation is now not advantageous to new hires. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Technical Advisor - Feb 14, 2022"
		},
		"135": {
			"rating": "4.0",
			"desc": "Great Company ",
			"pros": "- Challenging work keeps motivated - Employee perks- Relevant Compensation ",
			"cons": "- Too many re-orgs in short span of time- Productivity due to infrastructure management ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*****  Data Engineer II - Feb 12, 2022"
		},
		"136": {
			"rating": "4.0",
			"desc": "Great leadership, growing pains",
			"pros": "Kind, smart coworkers; great product; exciting opportunity to grow. Large TAM.",
			"cons": "Still trying to figure out how to operate at scale.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n*****  Channel Marketing - Feb 12, 2022"
		},
		"137": {
			"rating": "4.0",
			"desc": "Hardworking, smart people",
			"pros": "There are smart hardworking people who care a lot about their job",
			"cons": "We are not good at prioritizing yet. There is a lot work. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*****  Product Manager - Feb 11, 2022"
		},
		"138": {
			"rating": "2.0",
			"desc": "Sales org in chaos",
			"pros": "-complex products that make you think-users doing interesting projects-really talented and smart coworkers",
			"cons": "-user first, stripe second, team third, employees last-they do everything they can to pay as little as possible. Sales comp is a joke-we are asked to do 8 different jobs but are only paid for 1 of them-they ask you to not work outside your role. Just focus on your job! Problem: you can't do well in your role unless you do other peoples jobs because so many things critical to succeeding are broken-They promise the world when you get hired. Top performers get equity bonuses. This is why you don't need a 4 year RSU. Reality check: everyone gets average rating, including top performers. In your first year, managers are told not to give you a rating above SME so you end up not getting any comp raises for at least your first 2 years at the company-Sales is not valued or respected at this place. Our senior sales leaders are just waiting to cash out on their equity and don't care about people. We are all replaceable robots to them, despite the impressive assortment of talent that has been hired-there is no career progression here if you are smart and have a broad skill set. If you are a problem solver, they don't want you to solve problems. Just do your job Gonna start looking for a startup to go to where I'll actually be respected and appreciated for the work I do",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Account Executive - Feb 11, 2022"
		},
		"139": {
			"rating": "4.0",
			"desc": "Felt good at first, but seems like best years are behind it?",
			"pros": "Pays very well (e.g. on levels.fyi)Good reputationPeople are friendly (in my experience)Interview process was quick and lovely",
			"cons": "Managers, PMs and design often feel stretched thin or not paying attentionReviews and forced quotas are awful",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Senior Engineer - Feb 10, 2022"
		},
		"140": {
			"rating": "5.0",
			"desc": "Excellent company",
			"pros": "Great TC upside (even with AVG as opposed to the more traditional 4-year vest)Excellent growth opportunity as the company is going through its teenage years, meaning there is so much potential; but the company is stable/large enough that your project won't be suddenly out of funds.People geniunely careExcellent work-life balance, at least on my team",
			"cons": "Growing pains is unavoidable, and it's hereExperience is highly team-dependentLeadership is learning to lead a larger stable company rather than running a start-upRemnants of former work-on-the-weekend start-up mentalityOpportunity cost due to illiquid RSUs",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q*****  Software Engineer - Feb 10, 2022"
		},
		"141": {
			"rating": "5.0",
			"desc": "Looks good on the surface",
			"pros": "Disclaimer: am relatively new hire.Many processes are well thought out. Coherent onboarding for new hires.",
			"cons": "It appears that forced stack ranking is implemented and causes disappointment. AVG is terrible for rank and file.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*********  Software Engineer - Feb 10, 2022"
		},
		"142": {
			"rating": "3.0",
			"desc": "Boring work and bad WLB",
			"pros": "TC is okPeople is smartGrow rapidly if on the right project",
			"cons": "Lots of reorg and turn overForce PMENot transparent comp rewards",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Software Engineer - Feb 9, 2022"
		},
		"143": {
			"rating": "3.0",
			"desc": "Great pay, talented people, lacking direction ",
			"pros": "The group of people I work with is great. I enjoy coming to work and I don't get the Sunday scariest too much.  But that could change in an instant. The pay is also solid, but half the compensation is stock that's capped. And they haven't IPOd.",
			"cons": "The culture outside of my own team seems pretty toxic. I'm relatively knew, but it seems like managers have to fill quotas when it comes to performance reviews which I am currently going through.Also, most of my part of the organization is in disarray and has very little direction.It certainly seems like the definition of dysfunctional large organization. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Software Engineer I - Feb 8, 2022"
		},
		"144": {
			"rating": "3.0",
			"desc": "Political games, high turnover ",
			"pros": "Good compensation and benefits. The name of the company is good for resume. ",
			"cons": "Lots of political games. You can uplevel only if you make friends with the right people. Constant reorgs, hypocrisy (not practicing values that one preaches). Many burned out people who are not enthusiastic about their work and just count the days before IPO. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*****  Program Manager II - Feb 8, 2022"
		},
		"145": {
			"rating": "4.0",
			"desc": "Growing pains",
			"pros": "Great company but serious growing pains with moving so quickly. ",
			"cons": "Work life balance is low due to speed of expansion. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Staff Engineer - Feb 8, 2022"
		},
		"146": {
			"rating": "4.0",
			"desc": "Really Smart People",
			"pros": "Here, you will get to work with some of the most talented and smartest people in tech.Great compensation and benefits.",
			"cons": "It can be too stressful sometimes.Everyone seems to be always working even on weekends.Work like balance could be better.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*****  Software Engineer - Feb 6, 2022"
		},
		"147": {
			"rating": "5.0",
			"desc": "Going through the teenage years",
			"pros": "Huge potential, smart people, great founders, world class APIs and best in class documentation",
			"cons": "HR Processes are very heavy and can be simplified. A heavy Google influence on cultural and not for the good. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*********  Architecture Engineer - Feb 5, 2022"
		},
		"148": {
			"rating": "4.0",
			"desc": "Great company with growing pains",
			"pros": "Great mission, many wonderful colleagues, very good comp, culture of working hard in a good way",
			"cons": "Many aspects of the company seem clearly to be suffering as it grows. Team management is uneven.",
			"resignation reason": "Got re-orged quickly. Work and team was not as described by recruiter.",
			"authorInfo": "Verified User Former Employee  d*********  Software Engineer III - Feb 3, 2022"
		},
		"149": {
			"rating": "5.0",
			"desc": "Great Place to grow your career",
			"pros": "Great perks, mentorship, and teamwork. If you are looking for a great place full of learnings this is it",
			"cons": "Regular growth pains that any company who's growing this fast will experience",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  G*****  Sales - Jan 31, 2022"
		},
		"150": {
			"rating": "5.0",
			"desc": "Cares about culture, great perks and comp, strong leadership",
			"pros": "I'm a new hire so TBD if this review stays true.. However, in my first few weeks I've been impressed by the whole package.Comp is top notch, the vision is exciting and there is a lot of people who put in effort to onboard your and welcome you. I sense there is a loss of culture as we grow and hire from across the industry. It's natural. However I feel like the company makes an effort to uphold principles that have made what Stripe is today.",
			"cons": "Rapid growth is a pro/con. I envision there will be more difficulty to promote a strong culture as we rapidly hire.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  M*****  Engineer - Jan 31, 2022"
		},
		"151": {
			"rating": "5.0",
			"desc": "Great comp. Culture is team dependent ",
			"pros": "- work with smart people- high comp- generous RSU refresh but performance based- move fast",
			"cons": "- culture is team dependent- there is expectation to perform well",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*******  Software Engineer - Jan 30, 2022"
		},
		"152": {
			"rating": "5.0",
			"desc": "Smart people and audacious goal",
			"pros": "New to stripe - good experience thus far. Smart coworkers - company is growing fast",
			"cons": "Definitely a curve for reviews - WLB seems off - pressure to come up to speed quickly. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Marketing Analyst - Jan 27, 2022"
		},
		"153": {
			"rating": "2.0",
			"desc": "Not great.",
			"pros": "They pay a lot which is nice. Most of my IC colleagues are great.",
			"cons": "Culture is pretty awful, lots of new management that assumes they know what's up, but don't bother asking questions. Lots of passing the buck.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Staff Software Engineer - Jan 27, 2022"
		},
		"154": {
			"rating": "4.0",
			"desc": "Lots of opportunity to make an impact",
			"pros": "People are smart. The work is challenging. If you're ambitious you can really make a great career here. Comp is great.  ",
			"cons": "Lack of organizational structure. Work life balance is not the best. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  $*****  Engineering Manager - Jan 27, 2022"
		},
		"155": {
			"rating": "3.0",
			"desc": "Good compensation, culture isn't great",
			"pros": "Above average market compensation, annual grant is generous. Company size is small enough that roles carry a lot of impact. ",
			"cons": "Onboarding for non engineers is very patchy. Very long hours. Huge pressure to get up to speed very quickly. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d********  Business Operations - Jan 26, 2022"
		},
		"156": {
			"rating": "2.0",
			"desc": "Partially Meets my Expectations",
			"pros": "The compensation is pretty good, switch to single year stock grants aside",
			"cons": "I'd say it only partially meets what I expect out of an employer, maybe about 15%Phony culture",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Software Engineer - Jan 26, 2022"
		},
		"157": {
			"rating": "5.0",
			"desc": "Unbelievable colleagues",
			"pros": "Highest caliber people I've ever worked with. I can trust everyone.",
			"cons": "Stripe will make you work. There is no cruising or coasting.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*********  Software Engineer - Jan 26, 2022"
		},
		"158": {
			"rating": "5.0",
			"desc": "A good place to learn",
			"pros": "- chance to learn from great coworkers- interesting eng problems",
			"cons": "- growing pains. Getting better but coming out of a rough year as an engineer. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o*****  Senior Software Engineer - Jan 24, 2022"
		},
		"159": {
			"rating": "5.0",
			"desc": "Good culture but work a lot",
			"pros": "Just joined from other big tech. Had experience in another two tech companies. Overall the culture here is good. Work a lot.Read a lot. ",
			"cons": "I got to go work a lot more than my previous place. Peer pressure is there, essentially I don't know what levels my peers are at. Need more guidance on how to succeed here. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*********  Software Engineer - Jan 23, 2022"
		},
		"160": {
			"rating": "5.0",
			"desc": "Nice people ",
			"pros": "Great growth ratesSolid cultureExcellent teamGreat upside potential a",
			"cons": "Lots to do all at onceStruggle with prioritization Immature corporate functions",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Marketing Associate - Jan 22, 2022"
		},
		"161": {
			"rating": "5.0",
			"desc": "Great place to work",
			"pros": "Great people and mission. Thoughtful culture. Hi hi achieving teams.",
			"cons": "None to add.Great growth, leaders and opportunities ahead. Highly recommend.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  F*****  Software Engineer - Jan 21, 2022"
		},
		"162": {
			"rating": "4.0",
			"desc": "Great comp. Pretty stressful",
			"pros": "The comp and benefits are amazing. And the culture is the best I've ever seen.",
			"cons": "It's really easy to get more work piled on than you could ever reasonably do. And there's a TON of process required to do any interesting work.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Software Engineer - Jan 21, 2022"
		},
		"163": {
			"rating": "4.0",
			"desc": "Great opportunity",
			"pros": "Brand is at a place for crafting and molding, great opportunity holistically as a company ahead.",
			"cons": "Timeline for IPO is a big mystery, can tell that weighs on culture. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Creative Design Lead - Jan 20, 2022"
		},
		"164": {
			"rating": "2.0",
			"desc": "Overhyped outside but people are well meaning inside",
			"pros": "I believe the leadership and its well meaning intentions. Management can lose the message in the middle somewhere but overall culture is good. Benefits are good but not top of the line. Comp structure even with annual grants beats most Meta and Goog offers so talent is abundant.",
			"cons": "I dont get the hype outside for this company? Its too much of a figure it out yourself culture to succeed for new comers. It doesnt help that more than half of the company is shockingly new across all levels. Code, design and architecture is being reworked in stages and its not the best time to be here I guess now. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Engineer - Jan 19, 2022"
		},
		"165": {
			"rating": "4.0",
			"desc": "Stable company with high growth",
			"pros": "Compensation is top of market WLB pretty goodcultureTech forward",
			"cons": "Internal tooling not the bestInsane head count growth pains ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m********  Software Engineer - Jan 15, 2022"
		},
		"166": {
			"rating": "3.0",
			"desc": "Decent pay, quick burnout",
			"pros": "Pretty easy to have a large impact. ICs essentially do every role you'd expect at other companies.",
			"cons": "Not great wlb, work is mostly glorified integrations engineering, managers always trying to find the next negative to bring up on your perf cycle, and central functions such as hr and comp are set in stone, cold, and condescending.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Software Engineer - Jan 15, 2022"
		},
		"167": {
			"rating": "4.0",
			"desc": "Smart people and move fast",
			"pros": "Lots of smart people. Products are pushed through quite quick. Collaborations across the company are good.",
			"cons": "Infra is not the best. Sometimes implementation is constrained. Management chain change is not rare.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  E****  Software Engineer - Jan 14, 2022"
		},
		"168": {
			"rating": "5.0",
			"desc": "High growth company",
			"pros": "Company is growing quickly and there is a lot of impact to be had",
			"cons": "Management is young and work life balance could be much better",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Software Engineer - Jan 13, 2022"
		},
		"169": {
			"rating": "5.0",
			"desc": "Warm Culture & Interesting Work",
			"pros": "+ Nice remote culture+ Fast pace environment keeps things interesting+ Hybrid work environment means more flexibility",
			"cons": "+ Equity package could be more competative+ Startup culture means that there's a lot of overhauling and reorganizing code bases. Company turnover also means there are some things not specifically owned by teams",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p********  Technical Operations - Jan 13, 2022"
		},
		"170": {
			"rating": "5.0",
			"desc": "Decent so far",
			"pros": "Good at everything that I can tell but I've only been here a couple months.",
			"cons": "No downsides so far. Manager seems to be pleasant to work with.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Software Engineer - Jan 11, 2022"
		},
		"171": {
			"rating": "4.0",
			"desc": "Great opportunity but don't expect a slow WLB",
			"pros": "Great peopleEnjoy the cultureInteresting projects to work on",
			"cons": "Spin up is a bit messyNew re-orgs keep throwing off my deliverablesExpectation to align with east coast even though I'm EU",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y*****  Technical Product Manager - Jan 11, 2022"
		},
		"172": {
			"rating": "3.0",
			"desc": "Great if you got in early. If your coming late, don't bother. ",
			"pros": "WLB in infrastructure is reasonable. Culture is pretty friendly overall.",
			"cons": "Stay away from yearly equity grants. You're losing significant amounts of money. Pay is average. Company talks A LOT about transparency and fairness but delivers underspecified, confusing information about comp and review cycles and how equity is determined. Super shady shit. Company moves slow and work is not super interesting ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n******  Engineer - Jan 10, 2022"
		},
		"173": {
			"rating": "3.0",
			"desc": "Growing Pains ",
			"pros": "Good compensation, excellent leadership team, lots of good engineers and generally talented people. ",
			"cons": "Terrible middle management. Very high turn over (most folks seem to a new managers every 6 months) and get the impression they're just hiring anyone they can get now. At one point t here was a high bar. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  Software Engineer III - Jan 10, 2022"
		},
		"174": {
			"rating": "5.0",
			"desc": "Excellent comp & work life balance",
			"pros": "Excellent managerial support, intelligent leadership, great career opportunities within the company",
			"cons": "It's becoming big tech, as much as it tries not to",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Software Engineer - Jan 10, 2022"
		},
		"175": {
			"rating": "5.0",
			"desc": "Solid",
			"pros": "Really enjoying Stripe so far. Fast paced, smart people, great pay. ",
			"cons": "N/A i can't think of anything yet. Need ten words ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c********  Engineer - Jan 4, 2022"
		},
		"176": {
			"rating": "1.0",
			"desc": "Headless Chickens running around!",
			"pros": "None! I literally cannot think of anything! 1) They used to give nice Timbuk2 Tuck or Spire backpacks but only give the cheaper ones these days!2) People disappear every few weeks! Not sure if that's a Pro!",
			"cons": "Too many to outline! 1) Mandatory 15% PME every 6-mos2) 4-5 Reorgs a year and many people exit then!3) Managers are encouraged to ‘exit' new employees within weeks of starting! Woo Hoo!4) Nasty dog-eat-dog culture and matter of time before external perception catches up with internal 5) Internal Blind is a bloodbath! Worse than Amazon acc to folks who've worked at both firms",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  D*******  Senior Software Engineer, Tech Lead - Jan 3, 2022"
		},
		"177": {
			"rating": "4.0",
			"desc": "Exciting times",
			"pros": "Very exciting times to be at Stripe 🚀🚀Smart co-workers",
			"cons": "CodebaseWLBCorporate-y, Kool-Aid-y cultureLack of diversity and Stripe's excuses for it",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Software Engineer - Jan 2, 2022"
		},
		"178": {
			"rating": "1.0",
			"desc": "Unethical company, no humanity",
			"pros": "Good compensationGood productHard to find any other pros",
			"cons": "Top down cultureDictatorship from upper managementVery bad work life balance",
			"resignation reason": "Completely drained, no work life balance, unethical practices, no empathy",
			"authorInfo": "Verified User Former Employee  $***  Software Engineer - Dec 31, 2021"
		},
		"179": {
			"rating": "3.0",
			"desc": "Great fast growing company",
			"pros": "- exciting work - company is in growth mode- higher than average salary - extremely smart employees ",
			"cons": "- management is inexperienced - culture is a focus only on your work - no team effort - equity details/plan is constantly changing - hard to follow ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Legal Analyst - Dec 28, 2021"
		},
		"180": {
			"rating": "4.0",
			"desc": "Good pay, ok work",
			"pros": "High TC, good remote work culture, high impact, smart teammates ",
			"cons": "The work is not the most exciting on a non-product team",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*******  Software Engineer - Dec 26, 2021"
		},
		"181": {
			"rating": "5.0",
			"desc": "Working for what you get ",
			"pros": "Surrounding by really smart people who all work hard. Culture of competence but if you're looking for fun with tons of team bonding, this isn't it. Pay is great. Lots of room to provide impact. Provides opportunities for internal mobility after one year. ",
			"cons": "Vacation policy kinda meh. They give you 21 days PTO and there's a one week holiday shut down. If you take it, it counts as your PTO days. Swag sucks too for those that care about that stuff. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l******  Sales - Dec 26, 2021"
		},
		"182": {
			"rating": "5.0",
			"desc": "Love it so far",
			"pros": "- great comp and benefits- teammates are helpful and kind- friendly culture - lots of opportunities ahead",
			"cons": "- Annual rsu grant is not idealMaybe I haven't been here long enough. I can't think of anything else. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*****  Software Engineer - Dec 24, 2021"
		},
		"183": {
			"rating": "4.0",
			"desc": "Love the energy! ",
			"pros": "Fast pacedCan get to work on amazing and impactful thingsExcellent people",
			"cons": "Tenured Stripes acting like they own the placeBloated middle managementAttempting to act like a big company without realizing the current phase",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  Engineering Manager - Dec 22, 2021"
		},
		"184": {
			"rating": "4.0",
			"desc": "Good pay, not bad WLB",
			"pros": "- Aside from AVG, the pay is pretty good- If you're interested in Java, there's a lot of room to have a large impact since the Java tooling is really minimal.- if you work in EST the WLB is pretty good. You get to be productive in the morning, and then meetings in the afternoon and sign off for dinner. I don't feel like that's true for people working PT.",
			"cons": "- Everything is super custom, and the existing tools/frameworks feel like they're missing a ton of functionality- Some peers are immensely underwater in WLB- Definite culture undercurrent of if you don't perform, you'll be fired. Additionally, a lot of downwards pressure from skip managers onto engineers to take shortcuts and overpromise- Benefits themselves are pretty meager compared to competitors",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Software Engineer - Dec 21, 2021"
		},
		"185": {
			"rating": "4.0",
			"desc": "Great culture and benefits, but significant stress and growing pains.",
			"pros": "Some truly great people work at Stripe and I learned so much from so many. Super exciting company and fantastic comp/benefits. I got in at the right time and received a bunch of RSUs which will likely pay off.",
			"cons": "Growing pains everywhere. Overworked staff everywhere and no real interest in hiring in order to maintain leanness. Founders became increasingly tonedeaf and preachy, and many began to resent them. A speech from Patrick from a beautiful apartment about a company wide divergence from the Stripe culture in the height of the pandemic is a fine example.",
			"resignation reason": "Team size slowly decreased during a time of exponential growth. Management wouldn't provide additional headcount or even backfill vacated positions and I simply couldn't take the pressure during the pandemic. Joined Etsy for less comp but 90% less stress and never looked back.",
			"authorInfo": "Verified User Former Employee  j*****  Manager, Risk / Compliance - Dec 20, 2021"
		},
		"186": {
			"rating": "3.0",
			"desc": "Lots of change happening all the time",
			"pros": "Great opportunities to grow skills quickly in such a fast-paced environment.",
			"cons": "Lots of change makes it hard to focus at times. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*******  Administrative Assistant - Dec 18, 2021"
		},
		"187": {
			"rating": "4.0",
			"desc": "On path to become one of biggest payments infra compny",
			"pros": "Great cultureOpportunities to grow careerTransparency from leadership team",
			"cons": "Work life balanceTech debt in some ares - trying to fix foundational things this year",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f********  Software Engineer - Dec 17, 2021"
		},
		"188": {
			"rating": "3.0",
			"desc": "Growing pains",
			"pros": "- Could be one of the great, generational companies- Ambitious vision - Talented coworkers",
			"cons": "- Chaotic- Hire and fire- Toxic management in some places",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S*****  Software Engineer - Dec 17, 2021"
		},
		"189": {
			"rating": "4.0",
			"desc": "overall good place to work, WLB kind of sucks sometimes but comp makes up for it",
			"pros": "really good compensation and benefitsmy manager and their skip are good, I enjoy working in my orgcareer development focused",
			"cons": "work life balance is a mixed bag - some weeks you're swamped with work, some weeks there's very little to do. YMMV per level thoughi hear negatives about other managers, though I personally have no problemsculture is shifting a lot due to huge influx of new people",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  Software Engineer - Dec 16, 2021"
		},
		"190": {
			"rating": "4.0",
			"desc": "Great place for growth",
			"pros": "Lots of smart people, excellent comp, visionary product roadmap, remote work friendly",
			"cons": "Pains of having large groups of new pm people with pure self ambition",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k********  Finance - Dec 15, 2021"
		},
		"191": {
			"rating": "3.0",
			"desc": "growing pains",
			"pros": "compensation is stellarC suite leaders seem like the real deal",
			"cons": "new management can be spottynew staff engineers trying to land grab aggressively",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*********  Software Engineer - Dec 14, 2021"
		},
		"192": {
			"rating": "3.0",
			"desc": "The switch to AVG sucks",
			"pros": "Coworkers are friendly and knowledgeable. Dedicated infra teams. Founders are respected",
			"cons": "1y stock awards suck - no upside. Internal tools are not great",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f******  Software Engineer - Dec 14, 2021"
		},
		"193": {
			"rating": "4.0",
			"desc": "Great place to accelerate career ",
			"pros": "Company is definitely going places, and the comp is outstanding. ",
			"cons": "WLB can suck for some teams. Management and org structures are constantly churning. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Senior Software Engineering - Dec 13, 2021"
		},
		"194": {
			"rating": "4.0",
			"desc": "Get to work with amazing peers and users",
			"pros": "Rocket ship , many opportunities if you know where to look, you can make a lot of impact. ",
			"cons": "Managers galore. Some are ok. Some are not good at all. Stripe comp starts all negotiating at the lowest amount. Make sure you know your worth. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Engineer - Dec 10, 2021"
		},
		"195": {
			"rating": "5.0",
			"desc": "Great Transparency, Humble People, Talented folks and Great Humor too.. Huge Cultural shift for me ",
			"pros": "Started very recently at Stripe.So far it looks to be a great cultural shift for me and is tremendously positive in-terms of growth, transparency and opportunities.",
			"cons": "AVG limits downsides, however the offer I got is highest in the market right now anyway for my level and location (as far as I know) , so that helps and also the IPO potential",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*********  Software Engineer - Dec 8, 2021"
		},
		"196": {
			"rating": "4.0",
			"desc": "Poor mgmt, great peers",
			"pros": "Great talent, ambitious and driven peopleGood flexibility on WLB",
			"cons": "Management lacks vision and strategy WLB can be difficult to maintain at times",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Project Manager - Dec 7, 2021"
		},
		"197": {
			"rating": "4.0",
			"desc": "Good WLB but very manager-dependent ",
			"pros": "I'm on a team with great WLB. Comp is competitive too. ",
			"cons": "The company is very short staffed in a lot of key areas. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  K*****  Software Developer - Dec 6, 2021"
		},
		"198": {
			"rating": "4.0",
			"desc": "Ok",
			"pros": "Good benefits; great people to work with who are collaborative ",
			"cons": "Poor management and leadership especially CRO who is clueless about payments ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Sales & Business Development Manager - Dec 5, 2021"
		},
		"199": {
			"rating": "5.0",
			"desc": "Ton of potential and opportunities ",
			"pros": "-real impact on diverse businesses-great culture -very strong founders who care ",
			"cons": "-you work quite a bit -with so many amazing opportunities it is hard to prioritize ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f********  Engineer - Dec 4, 2021"
		},
		"200": {
			"rating": "5.0",
			"desc": "High energy, great people ",
			"pros": "Great challengesHugh growthGreat people and collaborate environments Flexible workFun culture",
			"cons": "Sometimes Small teams have less W/L balance but that's normal in a growth environment. Processes could be cleaner",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*********  People Manager - Dec 1, 2021"
		},
		"201": {
			"rating": "5.0",
			"desc": "Hectic but exciting!",
			"pros": "Comp + benefitsStrong managersSmart, hardworking colleaguesOpportunities to work on interesting projects beyond your immediate role",
			"cons": "Very fast paced and a high bar which can impact work/life balance",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Business Operations - Nov 29, 2021"
		},
		"202": {
			"rating": "5.0",
			"desc": "I like it here",
			"pros": "* Lots of good engineers here. Smart, driven, agreeable. Haven't really met anyone here I couldn't get along with.* Great for my career. Opportunity to work on projects known by the entire industry. Pays well, and the Stripe pedigree is very valuable.",
			"cons": "* Though I like the co-founders a lot, I haven't found a lot of reason to respect anybody in the reporting chain in between me and them...* Company is doubling down on silly ideas like Java, SOA, sokrs, Jira...",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Software Engineer - Nov 23, 2021"
		},
		"203": {
			"rating": "3.0",
			"desc": "understand pros/cons clearly",
			"pros": "junior eng may be shielded from leadership mess at the company",
			"cons": "poor leadership, no strategy, bad developer productivity, tech debt galore",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*******  Software Engineer - Nov 21, 2021"
		},
		"204": {
			"rating": "3.0",
			"desc": "Meh",
			"pros": "Rapid growthInteresting problems and challengesCompelling productMorally neutral to positive",
			"cons": "Poor work-life balanceLooking busy is rewarded more than adding valueHigh turnoverCliquishHeavy-handed internal spin and PR",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n**  Software Engineer - Nov 19, 2021"
		},
		"205": {
			"rating": "3.0",
			"desc": "Ambitious people, growing pains across the board",
			"pros": "- Ambitious people- Great product, lots of potential in future- Good benefits",
			"cons": "- Irrelevant processes- Poor quality in managers- Unsafe to share alternative opinions",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l******  Operations Specialist - Nov 18, 2021"
		},
		"206": {
			"rating": "4.0",
			"desc": "Good overall",
			"pros": "Total compensation is unbeatable for EU. Work is demanding but you can achieve a lot",
			"cons": "Work life balance is bad in comparison to other European companies",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*****  Software Engineer - Nov 18, 2021"
		},
		"207": {
			"rating": "5.0",
			"desc": "Great comp+benefits",
			"pros": "Great comp and benefits, everyone is extremely talented and smart",
			"cons": "Very poor work life balance, constantly shifting priorities with little investment to solve existing important problems ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Engineer - Nov 17, 2021"
		},
		"208": {
			"rating": "3.0",
			"desc": "Overall okay",
			"pros": "Exciting workFast movingGood cultureOpportunities to learnGreat benefits",
			"cons": "Terrible work life balanceLimited progression Bad managers Poor processes ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n*****  Operations Specialist - Nov 17, 2021"
		},
		"209": {
			"rating": "5.0",
			"desc": "Great company! Middle management and scaling issues, but being resolved.",
			"pros": "Great company in general. Salary, benefits, WLB is great.",
			"cons": "Middle managementScaling IssuesLots of tech debtChanging priorities",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*****  Engineer - Nov 16, 2021"
		},
		"210": {
			"rating": "4.0",
			"desc": "Great founders, going through hypergrowth",
			"pros": "Great founders, lots of talent, complicated products if you like a challenge",
			"cons": "Career pathing is non-existent.  Company is growing quickly and there are growing pains",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Marketing Manager - Nov 15, 2021"
		},
		"211": {
			"rating": "5.0",
			"desc": "Great company culture",
			"pros": "Great company cultureLots of opportunities for career developmentGood place to learn about fintechLots of high caliber teammates to work with",
			"cons": "Difficult to maintain WLBFrequent reorgs as a result of high growth",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Software Engineer - Nov 13, 2021"
		},
		"212": {
			"rating": "2.0",
			"desc": "Fascinating company with no career progression",
			"pros": "The company is in a very interesting stage of its growth, making it a fascinating ride to be part of.Strong vision around focusing on doing the hard stuff so users don't have to.The company employs lots of highly qualified and interesting people who are inspiring to work with.",
			"cons": "Leadership completely focuses on company growth, and doesn't care the least about personal/employee growth. They'll just replace you with the next human cog in their machine instead of trying to offer an interesting career, very few interesting career dev stories to go around.The culture is going south very quickly, with less cohesion and shared values than before and an almost cult-like following of the founders.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Program Manager - Nov 9, 2021"
		},
		"213": {
			"rating": "5.0",
			"desc": "Exciting phase ",
			"pros": "- great work life balance- good benefits that reflects care for its employees - a lot of room for growth and opportunities - employees are friendly and generous to help - flat structure ",
			"cons": "- a lot of new teams and education required - can be confusing and overwhelming for someone not familiar to the startup/tech scene  ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*********  Brand Marketing - Nov 9, 2021"
		},
		"214": {
			"rating": "4.0",
			"desc": "Tons of growth and changes ",
			"pros": "We are growing and launching new products like crazy and expanding into new markets. ",
			"cons": "We've hired so many people recently everyone is new and figuring it out ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A****  Sales - Nov 8, 2021"
		},
		"215": {
			"rating": "3.0",
			"desc": "Poor WLB, but important work and good coworkers ",
			"pros": "-There's important work left to be done -Talent density is still high",
			"cons": "-Lots of legacy messes to clean up-constant reorgs-poor WLB",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Software Engineer - Nov 7, 2021"
		},
		"216": {
			"rating": "5.0",
			"desc": "Great place to grow personally, big shifts as company grows",
			"pros": "Stripe has been a great place to solve technical challenges and grow in non-technical ways.  Its growing fast enough that there are generally more than enough legos to go around.",
			"cons": "Hiring is so fast there is (a) more top-heavy management and (b) much more of a feeling of working at a mega-corp than a we haven't won yet startup.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Software Engineering - Nov 4, 2021"
		},
		"217": {
			"rating": "3.0",
			"desc": "Very confusing",
			"pros": "Very successful business with room to growStrong culture of excellent APIs",
			"cons": "New RSU policy makes it less attractiveAbsurd amount of emphasis on upfront planningOld tech stack is completely tangled, new tech stack is not readyUpper mgmt issues proclamations without concrete elements, leaving to middle mgmt to each come up with their version of it. These versions often conflict  ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  K*****  Software Engineer - Oct 30, 2021"
		},
		"218": {
			"rating": "3.0",
			"desc": "Depends",
			"pros": "- Driven, smart people- Opportunity to grow- Good benefits",
			"cons": "- WLB - Not everyone is kind - Imposter syndrome is real- Hypergrowth has caused a lot of inefficiencies -",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a******  Marketing Manager - Oct 27, 2021"
		},
		"219": {
			"rating": "4.0",
			"desc": "Interesting problems",
			"pros": "- Friendly and chill people- Wide array of problems to solve",
			"cons": "- Too much time spent writing docs rather than coding, even for juniors- ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*****  Software Engineer - Oct 26, 2021"
		},
		"220": {
			"rating": "4.0",
			"desc": "Fun team, great WLB, top tier engineers and conpensation",
			"pros": "Love my team, working on cool problems in fintech and systems",
			"cons": "Company is getting very large, hard to make an impact and starting to feel like a bureaucratic cultureWLB can be heavily team dependent",
			"resignation reason": "Was an Intern this summer, considering returning but not sure yet. ",
			"authorInfo": "Verified User Former Employee  M********  Software Engineer - Oct 25, 2021"
		},
		"221": {
			"rating": "4.0",
			"desc": "Slow career growth for junior folks",
			"pros": "Comp package is not bad and people are generally nice. ",
			"cons": "Struggling pains of a growing company, loads of inefficient processes ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  M*****  Program Manager - Oct 25, 2021"
		},
		"222": {
			"rating": "4.0",
			"desc": "Good compensation, culture is changing",
			"pros": "Good compensation and benefits. Most of my peers are smart and capable, I could learn a lot from them.",
			"cons": "Depending on the team, some middle management can be political and shift the culture overtime. My team's skip manager cares about individual success over teamwork, which could lead to unhealthy competition. And the new AVG comp has less upside. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Software Engineer - Oct 25, 2021"
		},
		"223": {
			"rating": "5.0",
			"desc": "great career opportunity, nice people, top comp",
			"pros": "Business is growing at incredible ratePeople are generally nice to work withPay is top of market",
			"cons": "Org changes too frequently and usually surprises most people.seems very strict on head count and thus have tech debt ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Data Scientist - Oct 23, 2021"
		},
		"224": {
			"rating": "4.0",
			"desc": "Still moving extremely fast",
			"pros": "Every single person that I've interacted with is genuinely nice and helpful. People want everyone to succeed.The company's mission is broad and extremely ambitious and we seem to me making lots of progress toward it. ",
			"cons": "We are moving fast and growing fast and the predictable consequences are that we are having trouble maintaining culture. Upper and middle management are frothy and priorities shift a lot. We still nominally consider ourselves a startup with all the attendant consequences. Almost every person I've spoken to is either at or approaching burnout.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Software Engineer - Oct 23, 2021"
		},
		"225": {
			"rating": "4.0",
			"desc": "Good work life balance, lots of growing pains",
			"pros": "Generally nothing but kind colleagues. Rewarding work if you're on the right team. Great work life balance.",
			"cons": "Hiring very quickly, and the bar is set quite low IMO. Can be lots of KTLO at times. Some parts of the codebase more territorial than others.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Engineer - Oct 19, 2021"
		},
		"226": {
			"rating": "4.0",
			"desc": "Great WLB",
			"pros": "Good Managers Good WLBDecent benefits and salaryNicer pace of work",
			"cons": "Constant changerapid growth meaning not very tenured people working there",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I***  Recruiting Specialist - Oct 19, 2021"
		},
		"227": {
			"rating": "4.0",
			"desc": "Hmmm",
			"pros": "Cooperative culture Good managerCompensation is good among tech companies",
			"cons": "WLBGrowing painHeavy oncall for some teamsPerf driven",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Software Engineer - Oct 17, 2021"
		},
		"228": {
			"rating": "4.0",
			"desc": "Good so far",
			"pros": "- comp is good- IPO soon, hopefully- interesting work ",
			"cons": "- process driven- lots of self promotion- focus on ships at the detriment of long term tech",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  D*****  Engineer - Oct 17, 2021"
		},
		"229": {
			"rating": "3.0",
			"desc": "Pros and cons",
			"pros": "Competitive salaryRemote work engrained in cultureGenerally high quality engineers",
			"cons": "New hires get 1 year grants to limit upsideMost benefits meh or worseWLB / lots of people burning outLots of tech debt",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Software Engineer - Oct 16, 2021"
		},
		"230": {
			"rating": "5.0",
			"desc": "Great company",
			"pros": "The company has Fast growth, great culture, lots of ambitious people. Interesting and challenging mission as well. ",
			"cons": "Wlb is a challenge sometimes given the growth rate of the business. Also gives you opportunities for ownership, though. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p******  Account Analyst - Oct 14, 2021"
		},
		"231": {
			"rating": "3.0",
			"desc": "Poor WLB, mini Amazon",
			"pros": "Fast company growthGreat peopleTier 1 management is good",
			"cons": "Perf drivenEngineering excellence is shitPoor wlb Mid and high management are poor",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*****  Software Engineer - Oct 13, 2021"
		},
		"232": {
			"rating": "5.0",
			"desc": "Great company ",
			"pros": "Interesting work, friendly people, leadership recognizes engineering work. Some projects are highlighted by the CEO",
			"cons": "Growing pains, more interviewing, culture may change as a result of more people in a short amount of time",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  D*****  Software Engineer - Oct 12, 2021"
		},
		"233": {
			"rating": "2.0",
			"desc": "A really toxic culture ",
			"pros": "Some kind folks; a lot of people to learn from",
			"cons": "Really toxic culture of fear; even top performers are under a ton of pressure around performance reviews and ratings",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  1******  HR Associate - Oct 12, 2021"
		},
		"234": {
			"rating": "4.0",
			"desc": "Massive growth but struggling to keep",
			"pros": "We made a ton of money and it's a great resume builder. You will definitely learn a lot if you know how to position yourself well.",
			"cons": "Growth has been challenging especially since the performance has been more cutthroat. It has become less encouraged to do KTOL work since everything on OKRs has to have some form of measurement.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t***  Software Engineer - Oct 12, 2021"
		},
		"235": {
			"rating": "5.0",
			"desc": "So far, so good",
			"pros": "-strong tech-great culture -comp and benefits are very competitive ",
			"cons": "-wlb experience varies between teams-things can change very fast",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w*****  Technical Recruiter - Oct 7, 2021"
		},
		"236": {
			"rating": "4.0",
			"desc": "good long term growth",
			"pros": "good comp, especially for those on 4 year grantnice project impacts",
			"cons": "work life balance could be horrible, but depending on team",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Engineer - Oct 7, 2021"
		},
		"237": {
			"rating": "5.0",
			"desc": "Great people too impact driven",
			"pros": "Great people to work withGood upsideCompany culture is okay",
			"cons": "Too impact driven at times Incresing developer productivity issuesManagement hit or miss",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Engineer - Oct 7, 2021"
		},
		"238": {
			"rating": "5.0",
			"desc": "Impactful work and wonderful people to work with.",
			"pros": "Great culture, rapid growth and potential upside from future IPO.",
			"cons": "Growing pains from rapid expansion. Lots of docs to read through as a part of onboarding. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  👏*********  Operations Management - Oct 6, 2021"
		},
		"239": {
			"rating": "4.0",
			"desc": "Tons of growth with a side of process",
			"pros": "Incredibly motivated people - seriously every person I've met is smart, kind, passionate, and driven. Feels like most of the company is used to being top of their class. You won't find any Jim the group, do no work, take all the credit types. Super fast growth - no lack of opportunities to jump in and build things.Comp is sometimes better than even FAANG if you consider stock as dollars. Internal tooling is top notch and looks really nice too. ",
			"cons": "Very little hand holding beyond the first two weeks. After that it feels a bit sink or swim. WLB is what you make of it. Teams are trying to address this but there's never a shortage of things that could keep you working forever. New stock grants are yearly which looms upside potential, although I think Stripe addresses this with higher than average packages. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*****  Manager, Software Engineering - Oct 6, 2021"
		},
		"240": {
			"rating": "5.0",
			"desc": "Great benefits ",
			"pros": "Love working for a high growth and impactful fintech company ",
			"cons": "Hard to change process sometimes when it comes to the pm org ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  UI Designer I - Oct 6, 2021"
		},
		"241": {
			"rating": "4.0",
			"desc": "Interesting place for people who like hard problems",
			"pros": "Really great coworkers. Total compensation is high compared to other tech companies. No shortage of hard problems to solve and work to be done. ",
			"cons": "There's a lot to still be solved. While many things are going well there are just as many things that need fixing. It's a good place to work on problems at scale if you are bored at other big tech companies but this often can be hard and stressful.  ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*****  People Operations Specialist - Oct 6, 2021"
		},
		"242": {
			"rating": "4.0",
			"desc": "Growing pains are real",
			"pros": "I'm only two months in but so far here's what I love:- The people are kind, welcoming, and brilliant. They move fast but with intention.- Comp and benefits are great! - There is so much still to be done and so much impact to be had.- Stripe is a company that is genuinely enabling people to support themselves, chase their dreams, do what they love and globally. It's creating more equitable opportunity. That just feels good. And their business model is transparent and is such that when our customers do well, we do well.",
			"cons": "Here's what I'm noticing as trouble spots so far:- The new equity model caps potential for more recent hires. My advice: don't come here if you're just in it for stock.- Lack of mature planning, processes, and ops practices. Everyone is very focused on what's right in front of them and not so much the long term, strategic plan. It's hard to get things done because processes and roles/responsibilities across teams and individual people are undefined or unclear. My advice: unless you enjoy building these things and bringing the structure and clarity, now probably isn't the right time to join.- The writing culture seems to be some strange identity trait the company is desperately holding on to (for internal communications). The writing style is very specific with very few resources to teach you how to get it right and it slows you WAY down. The claim is that documenting helps others learn but materials are all over the place, outdated, and so long your eyes glaze over before you can even finish. It almost feels like people write long docs just for the sake of doing it.- We're hiring quickly and it's changing the culture. Those that have been here for awhile are holding on to the way it used to be and upset by the eroding culture. New people are struggling to understand and get integrated into the culture. To me the culture doesn't feel strong at all but I was told that will get better with time.- The resources and focus on I&D work feels wildly lacking and removed from the focus of the company. It's creating a bit of culture shock from my experience at previous companies and it pretty disappointing. That being said, it doesn't mean there isn't space for individuals to make a difference and the people are welcoming and inclusive so far.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Human Resources - Oct 6, 2021"
		},
		"243": {
			"rating": "3.0",
			"desc": "Great people and pay (except new equity policy), iffy leadership and too performance focused",
			"pros": "My teammates are great salary and bonus are good, lots of potential ",
			"cons": "Something is constantly broken internally which holds you back from completing workVery performance focused, especially with new stock policy ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*********  Software Engineer - Oct 6, 2021"
		},
		"244": {
			"rating": "3.0",
			"desc": "Staying for only comp",
			"pros": "- top of market comp, even with 1y grants- good if ambitious and you want to work a lot",
			"cons": "- terrible WLB, constant stress- a lot of leadership from AWS",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Software Engineer - Sep 29, 2021"
		},
		"245": {
			"rating": "5.0",
			"desc": "Great company with rocket ship growth",
			"pros": "Good comp, full remote available, lots of interesting projects to work on",
			"cons": "High expectations, some parts of the product are pretty dry",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*****  Software Engineer - Sep 29, 2021"
		},
		"246": {
			"rating": "2.0",
			"desc": "growing pains. ",
			"pros": "Amazing brand name and very strong future. Stripe will continue to grow market share. ",
			"cons": "Not for everyone. Internally everything is a mess and this culture will burn you out entirely.  bad wlb and growing pains right now. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*****  Sales - Sep 26, 2021"
		},
		"247": {
			"rating": "4.0",
			"desc": "Exciting potential, intense environment, competitive colleagues",
			"pros": "Opportunity and growth potential, at the forefront of so many trends. Tons of smart people",
			"cons": "Intense environment, super high expectations. Hard to avoid some sense of imposter syndrome. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  K*****  Manager, Marketing - Sep 25, 2021"
		},
		"248": {
			"rating": "4.0",
			"desc": "Good if you find a stable team",
			"pros": "High impact work, nice people, collaborative culture, actually making the world a better place",
			"cons": "Too many reorgs , growing too quickly and empire building in certain orgs. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  D*****  Engineering Manager - Sep 25, 2021"
		},
		"249": {
			"rating": "4.0",
			"desc": "good company culture, company is going through hyper growth phase ",
			"pros": "- smart, thoughtful people trying to do the best and move quickly - broadly favorable market trends for payments and e-commerce to ride ",
			"cons": "- growing pains, trying to integrate a large number of new people means that sometimes ability to move quickly to execute gets hampered by emerging signs of corporate bureaucracy  ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Operations Manager - Sep 22, 2021"
		},
		"250": {
			"rating": "5.0",
			"desc": "Great company, exciting growth",
			"pros": "A lot of exciting things happening on the product side. Collaborative culture. ",
			"cons": "Could be less academic (documentation and process heavy) and more agile.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*********  Recruiter - Sep 20, 2021"
		},
		"251": {
			"rating": "4.0",
			"desc": "Mostly good, hyper growth pains, too nice at times",
			"pros": "- Product set is industry leading and always expanding - Staff team is brilliant and down to earth (rare combo) - Pre-IPO, the sky is the limit for stock value and career growth ",
			"cons": "- Hyper growth is draining - Toxic nice culture can make communication really confusing and decision-making slow - TC lower than FAANG (with public stock price being the wild card, of course) - Culture TBD due to extreme pace of new hiring ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  E********  Technical Program Manager - Sep 18, 2021"
		},
		"252": {
			"rating": "2.0",
			"desc": "I had a terrible experience ",
			"pros": "The compensation is top of marketThere is a lot of nice productivity tooling",
			"cons": "The WLB is non existent You write way more docs than code. It's very cutthroat and there is a lot of back door dealing Micromanaging Priorities are all over the mapAmazon cultureWoke culture. Everyone is offended. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  !*******  Software Developer IV - Sep 18, 2021"
		},
		"253": {
			"rating": "1.0",
			"desc": "Worst company culture ever",
			"pros": "Unfortunately I haven't seen any pros. I have been here for only 3 months and it's been hell. ",
			"cons": "It's a throw someone under the bus culture. I was here for 3 months and was told to either throw someone under the bus or get thrown. I have never experienced such a bad culture in my 20 years of experience. Employees disappear and EM's disappear just in a day. Leadership has no empathy.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t******  Software Engineer - Sep 18, 2021"
		},
		"254": {
			"rating": "3.0",
			"desc": "Interesting work but wish for better WLB",
			"pros": "Super interesting work and customers who really love Stripe. It's also got really awesome smart people",
			"cons": "Work life balance is non existent. I know people who haven't been able to take a single day off in a year plus. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*****  Product Manager - Sep 14, 2021"
		},
		"255": {
			"rating": "5.0",
			"desc": "Overall great place to be",
			"pros": "- culture of learning and collaboration- high compensation- (depending on team) granted a lot of ownership and responsibility over product",
			"cons": "- WLB leaves something to be desired but should improve as hiring continues- so many managers being hired are unfamiliar with the product/work producing some friction which should also improve",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*********  Software Engineer - Sep 11, 2021"
		},
		"256": {
			"rating": "5.0",
			"desc": "Great place to work, but exhausting",
			"pros": "Product, mission, leadership team, culture, engineering tools, compensation, benefits, people",
			"cons": "Uncertain and ever-changing org and ownership structure, lack of processes, goal-setting, work-life balance",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*****  Software Engineer - Sep 11, 2021"
		},
		"257": {
			"rating": "3.0",
			"desc": "Culture used to be great but slowly and surely eroding",
			"pros": "Next big thing in FinTech, Connect is a game changer, generally early stripes were great people ",
			"cons": "New hires joining for wrong reasons (to be part of a great company rather than to build one), too much time thinking vs executing well, intense competition in industry",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  G*******  Finance & Operations Manager - Sep 10, 2021"
		},
		"258": {
			"rating": "4.0",
			"desc": "The opportunity ahead is immense",
			"pros": "- Exciting, because despite being 5K+ employees, we are just getting started. The opportunity ahead is immense.- Best culture I've witnessed to date - intellectual honesty, rigor, thinking from first principles- Fast paced, little red tape, amazing cross functional collaboration- Leadership is outstanding - practice what they preach, open to feedback, adapt well to changing shape of the org.",
			"cons": "- Non-tech roles don't have the best compensation- Like most startups, Stripe is an intense place to work, so have to be comfortable with the pressure - The organization still has to figure out core people processes, e.g. career development, training, retaining top talent, etc.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*****  Senior Business Leader - Sep 6, 2021"
		},
		"259": {
			"rating": "5.0",
			"desc": "Super smart and nice people",
			"pros": "Lots of welcoming people that are kind and ready to help you out. ",
			"cons": "Nothing so far. It seems like there's a lot to be done and a lot of speed required so I think requires setting boundaries to not be swallowed by wlb ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q*****  Software Engineer II - Sep 4, 2021"
		},
		"260": {
			"rating": "5.0",
			"desc": "Great people",
			"pros": "Everyone I've interacted with is kind, helpful, and very talented. A great place to learn and solve big problems at scale",
			"cons": "The usual downsides / risks of a fast growing company, although they are aware and working to mitigate l",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  Product Manager III - Sep 2, 2021"
		},
		"261": {
			"rating": "3.0",
			"desc": "Great place to gain experience but culture needs work",
			"pros": "- Smart and ambitious co-workers- Good comp and benefits",
			"cons": "- Work/life balance can be a challenge- Lacking culture",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Designer - Aug 31, 2021"
		},
		"262": {
			"rating": "5.0",
			"desc": "Just started but great so far ",
			"pros": "Good compensation and reasonable WLB. Interesting and challenging work. Very optimistic culture. ",
			"cons": "Serious growing pains, but that's inevitable with a company growing this quickly ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*****  Software Engineer - Aug 31, 2021"
		},
		"263": {
			"rating": "5.0",
			"desc": "High TC",
			"pros": "high tchigh growth stockrange of product linesremote friendly",
			"cons": "wlbon-calleverything constantly breakshigh friction between teamslittle documentation",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Software Engineer - Aug 30, 2021"
		},
		"264": {
			"rating": "4.0",
			"desc": "So far so good",
			"pros": "Growth is a lot inside the company. Lots of opportunity. ",
			"cons": "Culture sucks at the company.  People do not want to listen to a different perspective.  ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Software Engineer II - Aug 30, 2021"
		},
		"265": {
			"rating": "2.0",
			"desc": "Very intense, make sure you really want to be there ",
			"pros": "Comp is good. Benefits are good. I believe in the company's long term success.",
			"cons": "Everything is urgent, no matter how important.Non collaborative culture which makes people fearful of sharing work in progress.Stressful perf culture.If you care about the mission, it's easier to grit your teeth and power through.WLB issues are brushed aside ",
			"resignation reason": "I don't want to devote my life to this. Life is far too short.",
			"authorInfo": "Verified User Former Employee  V*****  Software Engineer I - Aug 30, 2021"
		},
		"266": {
			"rating": "3.0",
			"desc": "Its all about getting work done",
			"pros": "- Smart people- Good founders- Right intentions- Remote friendly",
			"cons": "- Bad execution. Speed over anything.- Patch and move on.- Entitlement and me first- Everything is a priority.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*******  Software Engineer - Aug 28, 2021"
		},
		"267": {
			"rating": "3.0",
			"desc": "It's not a bad culture, there is just none",
			"pros": "Individual contributors are incredibly consciousness and try to do the right thing. It's not an evil company. It's a media darling. In 10years the hype could be real.",
			"cons": "Our margins are a race to the bottom. We're more Amzn than FB/GOOG; and in that vein looking for our own AWS cash cow, which we haven't. Payments acquiring is not a zero to one business.Outside of the Collisons (mostly Patrick)and our legal counsel, the tops execs are meh. (Side bar, former product lead reminds of Christian Bale in Amercian Psycho) Org and management is pretty out of their depth and middling; basically mercernaries waiting for IPO. The company over indexes on comms, so probably the whitest company amongst peers.The problem with culture, there is no culture. It's hard to make moving money around sexy or like we're changing the world.",
			"resignation reason": "It became a grind; our velocity relative to our size necessary annoying.",
			"authorInfo": "Verified User Former Employee  e********  Engineer - Aug 28, 2021"
		},
		"268": {
			"rating": "5.0",
			"desc": "Everyone is smart",
			"pros": "* A lot to be built* Mannerism in the culture* Ambitious people fairy land* Pay",
			"cons": "* Management is a hit or miss* Long hours with each quarter level deliverables* Fires everywhere due to lack of ops rigor",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g******  Infrastructure Engineer - Aug 25, 2021"
		},
		"269": {
			"rating": "4.0",
			"desc": "Hoping this earns me a year of retirement",
			"pros": "Hard-working, smart people generally. Rocket ship with a great brand.",
			"cons": "White men dominate the higher ranks, increasing bureaucracy, and poor work life balance. Hoping it gets better with return to office.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Marketing Manager - Aug 24, 2021"
		},
		"270": {
			"rating": "5.0",
			"desc": "Great company on a great trajectory",
			"pros": "+ Amazing company culture focused around helping users, collaboration, producing results, and staying humble.+ Some of the kindest, most talented, and most collaborative coworkers I've ever had the pleasure to work with. People are always willing to help you out; it's a very positive work environment.+ Great place to learn valuable skills. The work is very cross-functional and you'll learn all about financial technology, policy, and other considerations that are relevant to any business that accpets payments online. You can take what you learn here and apply it in so many areas. + WLB is team-dependent but I feel empowered by my manager and team to set the WLB expectations that align with my own personal priorities and goals. I've been pleased with WLB. ",
			"cons": "- The company is not very diverse. There are very low numbers of women and underrepresented minorities across all levels and areas. - There is a lot of work to do, and that can sometimes mean feeling heavily understaffed for certain projects or having to constantly juggle priorities or convince relevant cross-functional teams to put in the work to unblock some parts of your project. In general, people are collaborative but there are not enough people to do everything that needs to get done.- We are hiring a lot, but the hiring process can sometimes feel overly slow and methodical. This ends up advantaging people with internal references, which in turn further hurts our diversity since we then tend to pull talent from the same professional circles. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*****  Product Manager - Aug 19, 2021"
		},
		"271": {
			"rating": "5.0",
			"desc": "Best company",
			"pros": "high growth, competitive salary huge impact on projects. Love it",
			"cons": "no down side at all every one should come work here",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*********  Engineer - Aug 19, 2021"
		},
		"272": {
			"rating": "5.0",
			"desc": "So far so good",
			"pros": "Nice people, interesting work, comp is good, lots to learn.",
			"cons": "Not sure yet as I've only recently joined the company.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Program Manager - Aug 13, 2021"
		},
		"273": {
			"rating": "4.0",
			"desc": "Good place so far ",
			"pros": "People are really talented, TC is great and there's lots of work to be done ",
			"cons": "WLB can be lacking at times, need to establish boundaries early on ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J*****  Software Engineer - Aug 10, 2021"
		},
		"274": {
			"rating": "5.0",
			"desc": "Great wlb, tc and culture",
			"pros": "Stripe has a great culture and wlb as well as potential for compensation with receiving pre IPO stock.",
			"cons": "Still feels start-uppy although it clearly has grown way past the point of being a start up.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*******  Software Engineer - Aug 10, 2021"
		},
		"275": {
			"rating": "4.0",
			"desc": "Pretty good overall",
			"pros": "People are generally nice and very talented, and the culture is surprisingly inspirational / motivating. The problems are interesting and challenging.",
			"cons": "There are growing pains. Fast career growth is possible due to the large number of opportunities, but you do have to take responsibility for seeking and seizing them, which can be difficult. More structured mentorship would be helpful.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Software Engineer - Aug 10, 2021"
		},
		"276": {
			"rating": "4.0",
			"desc": "Good place but poor wlb",
			"pros": "rocketship growthgood compensation good culture and leadership smart coworkers ",
			"cons": "Wlb is not a thing Perf pressure and tight deadline New policy leads to huge compensation inequality ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s******  Software Engineer - Aug 8, 2021"
		},
		"277": {
			"rating": "3.0",
			"desc": "Good company",
			"pros": "It has a good culture. People are also mostly friendly. ",
			"cons": "There are some fast growing pain just like other companies.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n*****  Software Engineer - Aug 6, 2021"
		},
		"278": {
			"rating": "4.0",
			"desc": "Hypergrowth company on great trajectory ",
			"pros": "High quality people that are very motivated and strong competitive positioning ",
			"cons": "Career progression may be difficult and hours can be bad ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o*********  Strategy & Business Development - Aug 5, 2021"
		},
		"279": {
			"rating": "5.0",
			"desc": "Stripe is not for everyone, but if it's for you, you'll do very well",
			"pros": "-collaborative work environment-opportunity to make significant impact -significant scope of work -opportunity to build process",
			"cons": "-a lot of work-lack of process-humble culture can limit opportunity to share more wins-very buttoned up culture",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*****  Human Resources - Aug 4, 2021"
		},
		"280": {
			"rating": "4.0",
			"desc": "Brilliant culture",
			"pros": "Brilliant culture - everyone is really nice and collaborative. Lots of smart people Growing rapidlySerious about the mission of increasing the GDP of the internet",
			"cons": "Despite efforts to build HQs outside of the US, the company is still significantly US centric and slow to ship to other markets",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Engineer - Aug 3, 2021"
		},
		"281": {
			"rating": "4.0",
			"desc": "Interesting work, work life balance is not that great",
			"pros": "Really smart coworkers, interesting work and cool customers, friendly culture",
			"cons": "Lots and lots of meetings, lots of pressure to deliver",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x********  Software Analyst - Aug 2, 2021"
		},
		"282": {
			"rating": "5.0",
			"desc": "Best place to be",
			"pros": "Awesome business and awesome people for high impact. Best place to be",
			"cons": "None, as long as you're good. If you're not good - don't join. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  G*******  Software Engineer - Aug 2, 2021"
		},
		"283": {
			"rating": "3.0",
			"desc": "A fantastic culture...in decline",
			"pros": "Charismatic and visionary founders. Products impacting many users across many industry. Team of A+ players. ",
			"cons": "Work-life balance. Rapid growth has degraded the previously collaborative and friendly culture. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  M*******  Product Manager - Aug 2, 2021"
		},
		"284": {
			"rating": "5.0",
			"desc": "Inspiring place to be",
			"pros": "Work life balance is good, lots of exciting stuff being build and great people. ",
			"cons": "Teams and managers are changing quite fast due to growth.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Software Engineer - Aug 2, 2021"
		},
		"285": {
			"rating": "4.0",
			"desc": "Great place to work overall",
			"pros": "Very chill manager, good WLB (on my team at least), good compensation",
			"cons": "Codebase is not the best to work with but it becomes a lot easier after a couple of months ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  E*****  Software Engineer - Aug 2, 2021"
		},
		"286": {
			"rating": "5.0",
			"desc": "I enjoy it",
			"pros": "awesome people, always ambitious and moving fast. for my team, management has been very hands off - engineers define the roadmap and direction entirely",
			"cons": "moving fast means a lot of change, which means frequent refactors and change-related incidents. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Software Engineer - Aug 1, 2021"
		},
		"287": {
			"rating": "5.0",
			"desc": "Great company",
			"pros": "Great comp, roadmap, and culture — especially the focus on developer experience and tools.",
			"cons": "If you don't set specific work hours, it's easy to get sucked into a bad work-life balance due to the global nature of the company.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Software Engineer - Jul 31, 2021"
		},
		"288": {
			"rating": "5.0",
			"desc": "Big impact, but you'll have to work for it",
			"pros": "Tons of smart people, a lot of impact. Fast moving. ",
			"cons": "You'll need to work hard to have a large impact. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*****  Product Manager - Jul 30, 2021"
		},
		"289": {
			"rating": "2.0",
			"desc": "Poor work-life blend and middle management",
			"pros": "- Great pay and benefits: Stripe probably has one of the more generous comp packages out there.- Challenging work: There's no shortage of unique problems or ideas to solution.- Executive Leadership: The executive team at Stripe is incredibly strong. There are no doubts in John and Patrick's vision for what Stripe does next, and other members of executive leadership also have a sound perspective on where the product roadmap and Stripe head in totality.",
			"cons": "- Middle Management: Re-organizations are normal to any company; they tend to happen frequently at Stripe. This has brought in several new middle managers. Some teams end up churning through 3-4 managers a year, all with varied visions and ideas. This causes major projects to be abandoned, and constantly juggling varying priorities. There are lots of great teams and managers at Stripe, but if you're unfortunate to land on a team that's going through large re-organizations that's had high manager attrition, expect a bit of turmoil. - Work Life Balance: Be prepared to always be online. You'll be working across time zones with multiple different team cohorts, and if you're not online when they are, you'll be behind the next day or projects will take major direction changes.- Lack of career progression: There's a lot of growth happening at Stripe, and that's no secret. Hiring doesn't seem to be internally sourced for upward roles, and being a top performer who brings smart ideas doesn't guarantee career progression.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Program Manager - Jul 30, 2021"
		},
		"290": {
			"rating": "2.0",
			"desc": "No career growth, fast growing business",
			"pros": "Ambitious company, growing quickly. Big vision and exciting place to be. ",
			"cons": "People here are stressed. They are here for the money, but culture is bad. Everyone works themselves to the bone, there isn't clear career growth and there is plenty of nepotism from Google. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o*****  Product Manager - Jul 27, 2021"
		},
		"291": {
			"rating": "5.0",
			"desc": "Excellent comp and work life balance",
			"pros": "The compensation is top notch, especially with the great work life balance.",
			"cons": "Team has grown rapidly, some areas have under invested in management so there is sometimes little support in that regard. It's actively being solved though.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Software Engineer - Jul 26, 2021"
		},
		"292": {
			"rating": "3.0",
			"desc": "Disappointing middle management ",
			"pros": "ad hoc vacation days and good insurance plan + perks",
			"cons": "poor middle management, no diversity in hiring (most folks come from the same company)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Analyst - Business Consulting - Jul 24, 2021"
		},
		"293": {
			"rating": "5.0",
			"desc": "No cons to date",
			"pros": "Having joined in covid in mid-2020, I've felt like management has done a solid job in fostering culture within teams and the wider org amidst rapid growth. ",
			"cons": "none that I've experienced so far in the past year plus",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Account Executive - Jul 20, 2021"
		},
		"294": {
			"rating": "5.0",
			"desc": "Feel lucky to work here",
			"pros": "Smartest humblest people driven to help users. Transparent leadership, tough problems but rewarding",
			"cons": "WLB can be tough - high expectations New stripes have brought more overhead and processes ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h****  Technical Program Manager - Jul 16, 2021"
		},
		"295": {
			"rating": "3.0",
			"desc": "Management is not great, tenured and talented folks are leaving",
			"pros": "A lot of growth and product opportunityUsers first value is strongI learned a lot in the early years.",
			"cons": "Compensation is low for the marketNewer stripes have changed the culture a lotManagement is not consistent ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Program Manager - Jul 14, 2021"
		},
		"296": {
			"rating": "5.0",
			"desc": "Cool problems",
			"pros": "The work is interesting and addresses real problems. Lots of talented colleagues.",
			"cons": "Growing pains as company gets bigger. Some orgs have bad processes for project planning.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*****  Software Engineer - Jul 13, 2021"
		},
		"297": {
			"rating": "4.0",
			"desc": "Brilliant people, poor WLB boundaries",
			"pros": "- you get to work with brilliant, yet humble people everyday- build great products- great leadership",
			"cons": "- poor work life balance, very hard to switch off - constantly fire fighting due to the growth of company",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Operational Risk Analyst - Jul 13, 2021"
		},
		"298": {
			"rating": "4.0",
			"desc": "Good Compensation, Boring Work",
			"pros": "Enjoyed the company culture, lucky enough to be in a team with good WLB, and there seems to be a lot of opportunities for growth.",
			"cons": "Really boring work without much flexibility for a change. Management seems quite unorganized at times as well.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Software Engineer - Jul 11, 2021"
		},
		"299": {
			"rating": "4.0",
			"desc": "Great culture and managers",
			"pros": "Hierarchy is flat and pretty open - there's a culture of sharing and helping other teams. Compensation is very competitive as well.Managers are very competent, able to prioritize projects and people well.",
			"cons": "Work life balance is a hit-or-miss depending on ongoing deadlines or team.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o*****  Software Engineer - Jul 11, 2021"
		},
		"300": {
			"rating": "5.0",
			"desc": "Exciting work, great people",
			"pros": "A culture of humility and kindness, with some really exciting things on the horizon",
			"cons": "Work life balance tends to be a little poorer, Organization is undergoing growing pains",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q*****  Software Engineer - Jul 8, 2021"
		},
		"301": {
			"rating": "4.0",
			"desc": "Good place to work",
			"pros": "Growing company and top mgmt is really good and good culture ",
			"cons": "401K benefit is not great and high expectations and performance review is not clear",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Manager, Finance and Accounting - Jul 6, 2021"
		},
		"302": {
			"rating": "3.0",
			"desc": "Mileage varies",
			"pros": "Great fast growing spaceTenured Stripes are great to work with. New Stripes hit-or-miss",
			"cons": "Too many new Stripes trying to assert themselves by building processes and empires that don't make senseToo much like any other big tech company now",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d****  Sale Manager - Jul 5, 2021"
		},
		"303": {
			"rating": "3.0",
			"desc": "Great leadership but culture eroded over past year with overly aggressive hiring without proper integration ",
			"pros": "Exceptional founders, kind intentions, big ambitions and total addressable space ",
			"cons": "Unfortunately, in the recent 18 months Bureaucracy has been creeping into this massively scaling organization machine ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Business Development - Jul 3, 2021"
		},
		"304": {
			"rating": "3.0",
			"desc": "Poor WLB but Good Comp",
			"pros": "Good compMotivated teammates and managersMostly interesting projects ",
			"cons": "Quick ships and then on to the next thing, no maintenance until something catches on fireKTLO work is ignored and not recognizedEveryone wants to prioritize new projects2 perf cycles a year makes everyone hyper-focused on perf",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Business Analyst - Strategy and Operations - Jul 3, 2021"
		},
		"305": {
			"rating": "4.0",
			"desc": "Pretty good",
			"pros": "Everything is pretty good, not many complaints. Although can be team dependent",
			"cons": "lots to do, WLB can suffer (this is also team dependent)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J*****  Software Engineer - Jul 2, 2021"
		},
		"306": {
			"rating": "4.0",
			"desc": "Ambitious company",
			"pros": "- relatively easy to find ambitious coworkers / teammates- diverse product portfolio- CEO is great",
			"cons": "- lots of growing pains- lots of new management which comes with frequent org churns- easy to feel lost- increasing amount of politics (part of growing pains)- WLB is not the best, partly due to company ambition",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z********  Software Engineer III - Jul 2, 2021"
		},
		"307": {
			"rating": "4.0",
			"desc": "Great colleagues, work life balance is ok",
			"pros": "The caliber of engineers is great. Imagine the best teammates you worked with at all your previous jobs in one place.",
			"cons": "Understaffed. Hard to advocate for yourself w management because they're also stretched thin.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*****  Technical Recruiter - Jul 2, 2021"
		},
		"308": {
			"rating": "5.0",
			"desc": "Once in a generation company ",
			"pros": "Full of motivated, smart people who care about the central mission and are genuinely kind to others. Deeply intellectually rigorous and (relatively) minimal politics. Top leadership is thinking long term not short term. Rising tide lifts all boats.",
			"cons": "Stripe is full of bright people, with a high bar for excellence. all teams are stretched thin, and some dangerously so, which can lead to an intense work environment and burnout. This has not been the case for me but it is apparent in other parts (esp engineering, infrastructure, product).Growing extremely fast inevitably leads to some subpar middle managers and miscommunication.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s******  Sales - Jun 28, 2021"
		},
		"309": {
			"rating": "5.0",
			"desc": "Stress and vest ftw ",
			"pros": "Intense in a good way. Ppl help each other and  are in place for huge growth. ",
			"cons": "Scaling fast be ready to edit company and improve it  ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  8******  Product Manager/Strategy - Jun 26, 2021"
		},
		"310": {
			"rating": "5.0",
			"desc": "Full of brilliant people",
			"pros": "1. Lots of smart folks2. Good comp and benefits",
			"cons": "1. Needs to write a doc for literally anything2. Some teams are understaffed",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J*****  Software Engineer - Jun 26, 2021"
		},
		"311": {
			"rating": "4.0",
			"desc": "Lots to build",
			"pros": "Lots of things to buildLots of freedomSeemingly no deadlines",
			"cons": "Sorbet can be somewhat slowLocal UI testing also somewhat slow",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*********  Software Engineer II - Jun 21, 2021"
		},
		"312": {
			"rating": "4.0",
			"desc": "Terrible onboarding, great people",
			"pros": "Obviously talented people Useful product Decent compGreat perks Engaged colleagues New equity structure removes upside",
			"cons": "Lack of clarity from management Apparently there's a pip culture‘Boys club' of pre-RSU folks",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*****  Engineer I - Jun 20, 2021"
		},
		"313": {
			"rating": "5.0",
			"desc": "Great Culture and Management",
			"pros": "- Competitive TC, generous benefits/perks.- Nice and well-defined culture.- Management seems good to great in my region.- Need more time to evaluate WLB",
			"cons": "- Literally nothing (yet to find out). Really hope can come back to the office after the pandemic.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r****  Software Engineer - Jun 16, 2021"
		},
		"314": {
			"rating": "1.0",
			"desc": "Hire and fire culture, poor management",
			"pros": "- smart peers- cool product - great pay and benefits ",
			"cons": "- inept management with constantly changing priprities- no support system for new hires- arbitrary firings during initial 3-6 month ramp up period",
			"resignation reason": "The management was incredibly inconsistent and not supportive. WLB sucked, and it wasn't worth the stress.",
			"authorInfo": "Verified User Former Employee  F*****  Senior Software Engineer - Jun 11, 2021"
		},
		"315": {
			"rating": "5.0",
			"desc": "Great place to work! Loooove it",
			"pros": "- great people, best I've worked with- huge opportunity ",
			"cons": "- lots to do but limited resources - internal docs are average ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  K*****  Software Engineer, Applications Developoer IV - Jun 10, 2021"
		},
		"316": {
			"rating": "5.0",
			"desc": "Great company overall",
			"pros": "Great company, great culture (everyone is super nice and always happy to help), great product + internal documentation.",
			"cons": "Company WLB isn't the best, teams are always restructuring. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Software Engineer - Jun 7, 2021"
		},
		"317": {
			"rating": "4.0",
			"desc": "Work life balance ",
			"pros": "Pre IPO and good compensation. Mission drive and real impact ",
			"cons": "Slow in APAC and little payment methods that is relevant in APAC",
			"resignation reason": "Finish vesting and found a better opportunity out there so I left ",
			"authorInfo": "Verified User Former Employee  j*****  Sales - Jun 6, 2021"
		},
		"318": {
			"rating": "3.0",
			"desc": "Good opportunities but bad management",
			"pros": "Many opportunities to gain expertise and exploreChance to deal with real production issues",
			"cons": "STRESS!! Terrible perf designation and calibrationToo quick change of manager and skip level managers",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Software Engineer - Jun 5, 2021"
		},
		"319": {
			"rating": "3.0",
			"desc": "Ambitious and successful company but high-stress",
			"pros": "* Patrick Collison is a great and brilliant CEO* Growth of the company is super strong, with many more opportunities* Lots of different areas to have a large impact* Lots of smart, ambitious people working there* Not much red-tape* Moves very fast despite being a medium-largish company now",
			"cons": "* Very stressful work, both on-call and projects* Project management isn't very structured, which means estimates are off and many folks overwork to compensate for too-ambitious deadlines* A lot of scaling issues (which are being worked on), but it means many teams are fighting fires constantly",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Senior Software Engineer - Jun 3, 2021"
		},
		"320": {
			"rating": "4.0",
			"desc": "Thoughtful and Talented people but challenging transition phase",
			"pros": "Company prides itself in rigour and long term thinking.Strong community spirit in earlier days, but much more corporate now.Great grounding in terms of payments knowledge.",
			"cons": "Slow in decision making and can be stubborn in beliefs to compete effectively in unique market nuances.Ultra competitive industry - not a con but need to sharpen our playbook in circumstances whereby there needs to be medium term strategies before long term ideals can be achieved. Very flat structure with lack of progression for senior Individual roles.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Business Development - Jun 1, 2021"
		},
		"321": {
			"rating": "5.0",
			"desc": "Tough WLB but good compensation",
			"pros": "Great benefits in office, good equity offering, great people to work with. Leadership team is amazing ",
			"cons": "Work/Life balance can be tough, not a lot of room for career progression.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  F*****  Risk Analyst - May 27, 2021"
		},
		"322": {
			"rating": "4.0",
			"desc": "A rocket ship with no sign of stopping.",
			"pros": "- Strong culture.- Tons of interesting work to be done.",
			"cons": "- WLB- Growing pains with corporate processes, tech debt, perf.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  Software Engineer - May 26, 2021"
		},
		"323": {
			"rating": "4.0",
			"desc": "Need to manage your own wlb",
			"pros": "good comp, kind and humble people, overall good work culture",
			"cons": "work life balance can be challenging. more and more mediocre managers and politics.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*****  Program Manager - May 25, 2021"
		},
		"324": {
			"rating": "5.0",
			"desc": "Great overall",
			"pros": "Great culture, people, products are going places. Benefits are good",
			"cons": "- The recent adjust in compensation (fixed $ of RSUs)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Software Engineer - May 25, 2021"
		},
		"325": {
			"rating": "4.0",
			"desc": "Amazing vision but lots of growing pains",
			"pros": "- Patrick and John are true visionaries. They have great things planned for the company in a way that doesn't feel ridiculous or unwise - benefits are quite good- WLB is what you make of it, as long as you are confident setting your own boundaries- lots of extra vacation days during the pandemic- curious and kind coworkers",
			"cons": "- most managers aren't great- you'll work infinite hours if you can't say no or set boundaries - dev tooling still feels medieval - constantly understaffed for our ambition- infra changes a lot under you- hard to balance company priorities against team charter if you're on a product team- external hires are changing the culture to noticeably feel like Google v2",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Software Engineer - May 20, 2021"
		},
		"326": {
			"rating": "5.0",
			"desc": "Exciting and Engaging Work, Excellent Engineers",
			"pros": "Excellent engineers to learn from and growGreat opportunity to make meaningful impactCompetitive compensationFast growth",
			"cons": "Goals are usually much more ambitious than the available headcount provided.Infrastructure could be improved",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*****  Software Engineer - May 18, 2021"
		},
		"327": {
			"rating": "4.0",
			"desc": "Good comp, poor WLB",
			"pros": "- good compensation- smart and contentious coworkers  - growing rapidly",
			"cons": "- poor WLB- lots of churn on roadmap- new managers",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Software Engineer - May 13, 2021"
		},
		"328": {
			"rating": "3.0",
			"desc": "Used to be great, now just another corporate soulless company",
			"pros": "Very good TC even with the changes to AV grantsProbably still going to see a lot of upside before IPO",
			"cons": "Very politicalWLB really depends on which team you land and inLots of mediocre managers",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Software Engineer - May 7, 2021"
		},
		"329": {
			"rating": "3.0",
			"desc": "Mediocre talent, tech, management",
			"pros": "Growing industry.Company product strategies are good.Good at external partnerships and marketing.",
			"cons": "Wlb. Everyone is doing the job of two people.Tech.Culturally closed off and passive aggressive.Management micro managed.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*********  Software Engineer - May 5, 2021"
		},
		"330": {
			"rating": "4.0",
			"desc": "Okay work life balance",
			"pros": "Great people, pay is decent, they care about work life balance.",
			"cons": "They are getting taking themselves too seriously and getting rid of nice things and slowly getting rid of fun. Perf is too stressful. Recruitment and HR feels like a black hole.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b***  Software Engineer - May 4, 2021"
		},
		"331": {
			"rating": "5.0",
			"desc": "not good at wlb, but has the great work environment ",
			"pros": "1. talent engineer2. Great work culture3. Opportunities for level up4. Possible to IPO",
			"cons": "1. Heavy Duty 2. Wlb is bad3. Too many things for few ppl",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*****  Software Applications Engineer - May 3, 2021"
		},
		"332": {
			"rating": "5.0",
			"desc": "Great company",
			"pros": "Fast moving, great people, really feel like I can make an impact. Great compensation.",
			"cons": "Things can be a bit chaotic; you have to be OK with uncertainty ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S*****  Software Engineer - May 1, 2021"
		},
		"333": {
			"rating": "5.0",
			"desc": "Endless Opportunity ",
			"pros": "- Company has a long runway ahead of itself to decide how it wants to continue pivot and grow into a megacap - lot of fun problems to solve in the real world via the cloud ",
			"cons": "No mega back door Roth no other major complaints here",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  /*******  Software Engineer - Apr 29, 2021"
		},
		"334": {
			"rating": "4.0",
			"desc": "Great company, growth mode ",
			"pros": "Great company in hyper growth modeCollaborative culture even with everyone remote ",
			"cons": "Long hours and working across time zones can be hard sometimes ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S******  User Operations Specialist - Apr 24, 2021"
		},
		"335": {
			"rating": "4.0",
			"desc": "Great place for career trajectory",
			"pros": "Great for career growthDepending on your team, lots of high pri workVery fair compensation ",
			"cons": "Need to create your own wlb, heard theres lots of manager chirn",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Software Engineer - Apr 22, 2021"
		},
		"336": {
			"rating": "5.0",
			"desc": "Positive experience so far ",
			"pros": "- solid roadmap both now and the future - hyper-focused on customer - thoughtful leadership during the past 12+ months in trying to get all employees what they need for a healthy work/life balance- solid additions at exec level to mature company ",
			"cons": "- growing pains as usual on the maturity curve, but certainly addressing most better than other places I've been. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Manager, Operations Engineering - Apr 21, 2021"
		},
		"337": {
			"rating": "4.0",
			"desc": "Smart, kind people, some growing pains",
			"pros": "Smart kind people, pays well. Extra vacation time during covid.",
			"cons": "Perception of quick to fire, bad wlb, makes for an undercurrent of not feeling secure.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*****  Software Engineer - Apr 21, 2021"
		},
		"338": {
			"rating": "4.0",
			"desc": "Can be good, watch out for churn ",
			"pros": "Business is solid and growing fastCompetent, kind coworkersStill relatively transparent for a company its sizeLimited only by your ambitions",
			"cons": "Lots of churnCompany is currently trying to do a lot at once- increase product scope, increase global presence, while improving infra & going publicYou'll likely have at least a couple crappy managers",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A*****  Software Engineer - Apr 21, 2021"
		},
		"339": {
			"rating": "3.0",
			"desc": "Behind other companies at this scale and trajectory",
			"pros": "People are generally kind and helpful when they have bandwidth to do so",
			"cons": "Infrastructure is terrible Leadership has unrealistic expectations and poor insight into team goals",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Software Engineer - Apr 20, 2021"
		},
		"340": {
			"rating": "4.0",
			"desc": "Not for coasters",
			"pros": "People here are incredibly driven and intelligent. Hard to stand out here.",
			"cons": "See above. Lots of talented individuals. On a rocketship but need to contribute.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Software Engineer - Apr 18, 2021"
		},
		"341": {
			"rating": "5.0",
			"desc": "Learning a lot",
			"pros": "Great management, exciting work, smart colleagues, everyone strives to do their best",
			"cons": "Work life balance is hard - especially during the pandemic",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Operations Lead - Apr 17, 2021"
		},
		"342": {
			"rating": "5.0",
			"desc": "Be ready to manage WLB for yourself",
			"pros": "Comp is good, people are among the nicest and most caring group I've worked with. The product is interesting and motivating. Dev productivity is highly invested in. ",
			"cons": "WLB is encouraged, but in reality Stripe tends to hire people who overwork themselves. It's easy to get caught up in that and find yourself working too hard and too late. There's also an expectation for consistent delivery. To be successful, you have to have the self-discipline to continually get good work done during work hours, with no significant gaps in productivity. If you can do that, there's no real expectation to work overtime. The code is messier than other places I've worked. Not a lot of incentive to clean up legacy code as long as it's stable. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Software Engineer - Apr 17, 2021"
		},
		"343": {
			"rating": "4.0",
			"desc": "Strong but beware WLB issues",
			"pros": "Stripe has a great product, a promising future, and rapid growth.",
			"cons": "WLB can be brutal in some groups, with little recognition for the grind. Aggressive performance management culture that inconsistently recognizes employee contributions in reality.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  Software Engineer - Apr 15, 2021"
		},
		"344": {
			"rating": "3.0",
			"desc": "no wlb",
			"pros": "Smart people and the company is generally doing well. Some of the managers genuinely care",
			"cons": "politics, and you are expected to work at all hours. Overlapped swimming lanes",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Data Scientist - Apr 1, 2021"
		},
		"345": {
			"rating": "5.0",
			"desc": "Reach only very slightly exceeds its grasp",
			"pros": "Smart, driven, kind people. A mission worth working for. Leadership that is ambitious and admirable. Generous covid policies. ",
			"cons": "Painful growth stage where many things are understaffed. Lots of responsibility on every employee. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A*****  Software Engineer - Apr 1, 2021"
		},
		"346": {
			"rating": "4.0",
			"desc": "Good culture, visible growing pains",
			"pros": "* Most people are both smart and kind. Projects are ambitious and collaborative.* Excellent on-boarding practice (at least pre-COVID) with a clear investment in new employee success* Employees come from a wide range of previous experience. Great opportunities to learn from FAANG alumni, startup veterans, and subject matter experts in a number of areas.* Plenty of room to make a positive impact, lots of space for learning and growth* Solid cultural values and business foundations",
			"cons": "* Obvious growing pains in both organizational behavior and technical execution. Immature planning and communications practices.* Strange, cult-like worship of founders * Managers are stretched thin, work-life balance can be pretty bad.* A lot of senior leadership does not recognize the value of good product and program management functions as part of a well-performing engineering organization.",
			"resignation reason": "Relocated due to family reasons and impact of COVID-19 ",
			"authorInfo": "Verified User Former Employee  u*****  Engineering Manager - Mar 30, 2021"
		},
		"347": {
			"rating": "1.0",
			"desc": "Hire and fire",
			"pros": "Great benefits and payWritten culture is greatSmart coworkers ",
			"cons": "Hot mess of a codebaseSelf absorbed companyPeople are let silently go",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*****  Software Engineer - Mar 28, 2021"
		},
		"348": {
			"rating": "5.0",
			"desc": "It's a grind, but I love my job",
			"pros": "I've learned more here in the last two years than anywhere else. It was a perfect long term fit for this part of my career. High career growth and I love the people I get to work with everyday. ",
			"cons": "Tons to get done and not always staffed appropriately. Makes for some long nights. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s********  Executive Assistant - Mar 25, 2021"
		},
		"349": {
			"rating": "5.0",
			"desc": "Great leaders and culture ",
			"pros": "Most impressive leadership team I've worked for and really appreciate the humbleness and humor. ",
			"cons": "We are growing really quickly and remote working due to covid has made that tricky. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Administrative Assistant - Mar 25, 2021"
		},
		"350": {
			"rating": "4.0",
			"desc": "Bright future with some growing pains",
			"pros": "Collisons are the real dealCollaborative cultureIn a hypergrowth industry ",
			"cons": "Operates too flat for its sizeHigh expectations Hiring is slow",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  E*****  Marketing Analyst - Mar 24, 2021"
		},
		"351": {
			"rating": "5.0",
			"desc": "Great leadership",
			"pros": "We could fully trust the leadership Collision brothers created, frictionless",
			"cons": "the work load is heavy and onboarding curve is sharp, many context about payments need to be learned.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*****  Software Engineer - Mar 20, 2021"
		},
		"352": {
			"rating": "5.0",
			"desc": "Growing at an incredible pace with even bigger ambitions ",
			"pros": "-Very high bar for talent and kind coworkers-2 extremely gifted founders -extremely large market with beneficial secular trends for core business -immense opportunity to help invent the future of SaaS + financial services ",
			"cons": "-Growing so fast that organizational imbalance pops up in places and creates bandwidth constraints ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*****  Sales - Mar 18, 2021"
		},
		"353": {
			"rating": "5.0",
			"desc": "Great place to learn ",
			"pros": "Lots of opportunities to learn and grow Lots of interesting work to doPeople are warm, kind and friendly ",
			"cons": "They are upfront about Stripe not being a place to rest and vest",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  D*****  Engineer - Mar 17, 2021"
		},
		"354": {
			"rating": "5.0",
			"desc": "Strong emphasis on WLB",
			"pros": "Culture is emphasised and significant attempts are made to maintain this culture, company is performing exceedingly well and growing which makes for an exciting journey.",
			"cons": "Tough to stand out, very competitive environment. Strong performers strive but the learning curve is very very steep at the beginning.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c****  Account Executive I - Mar 16, 2021"
		},
		"355": {
			"rating": "3.0",
			"desc": "Great people, tough stage of growth",
			"pros": "Most people you work with are smart and kind. Leadership is thoughtful and generally does the right thing. ",
			"cons": "Company is in a painful stage of growth right now where critical initiatives are understaffed and foundational work touches all teams. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y*****  Software Engineer - Mar 15, 2021"
		},
		"356": {
			"rating": "2.0",
			"desc": "WLB isn't a thing, politics are. Everyone worships P&J ohh and the Llama",
			"pros": "- Comp upside (especially if started before current comp structure)- good perks for a ‘startup'",
			"cons": "Where to start...- too many leaders to count that are leader only by title. Growing up in the company doesn't make you a leader as is demonstrated regularly by new actual leaders coming in who have walked the walk and then suddenly disappearing one day. Many people keep their jobs by popularity and getting rid of people that have more experience than they do who have just been there for less time.- very academic approach to work. Write all the time, work all the time, present as if it's a lecture, etc.- too much hiring for it's stage (been that way for years). - many former Google leaders and the culture is as such, without the benefits and name recognition.- incredibly boring products (important just boring)- encompasses all the worst parts of the Silicon Valley tech culture, no longer worth the stress for equity upside.- Manager? Hope you like being told to fire people (a lot)",
			"resignation reason": "Juice wasn't worth the squeeze. Best learning was not to fall for the shiny object and do more research on my management chain ahead of time.",
			"authorInfo": "Verified User Former Employee  x*****  Software Engineer - Mar 12, 2021"
		},
		"357": {
			"rating": "3.0",
			"desc": "Experiences vary wildly",
			"pros": "- Comp is great- Big impact (often 1-2 engineers can bring in millions in savings or new revenue)",
			"cons": "- work-life balance HEAVILY dependent on team- lots of critical teams understaffed- a reactive work environment - everything is on fire all the time- Stripe has serious issues executing large, cross-team initiatives due to politics",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d******  Software Engineer - Mar 9, 2021"
		},
		"358": {
			"rating": "5.0",
			"desc": "Great culture, but challenging",
			"pros": "- Very great culture. All people are nice and willing to help. However, sometimes you need to ping people to get things done. - Fast-pacing and challenging environment. Always learning something new and working on new projects.- High ambitions of the company and inspiring CEOs- Good salary, benefits and nice company gifts",
			"cons": "- A lot of intensive work, very big technical debt. - On-call rotations are not paid and can be stressful.- Unexpected firings of colleagues",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a********  Software Engineer - Mar 9, 2021"
		},
		"359": {
			"rating": "4.0",
			"desc": "great mission and potential",
			"pros": "stripe is likely going to be very very valuable down the linemost people are great. ",
			"cons": "things are trending in a not so great direction unfortunately ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Engineer - Mar 8, 2021"
		},
		"360": {
			"rating": "4.0",
			"desc": "Ch",
			"pros": "- really smart/kind coworkers (although i'm sure this can vary with teams)- great compensation/career progression (at least in the early ranks)- lots of opportunity for ownership and pitching ideas as an engineer",
			"cons": "- projects are often understaffed and a lot of time gets spent on keeping the lights on- on call can be a pain and depending on your team, there's a million things you need to keep state on which can be stressful",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*****  Software Engineer - Mar 6, 2021"
		},
		"361": {
			"rating": "2.0",
			"desc": "Bad work life balance, things constantly on fire",
			"pros": "-Great compensation-Leadership is inspiring -Tremendous momentum-Lots of interesting problemz",
			"cons": "-Terrible work life balance-Terrible review process - working 9-5 will likely get you PIPed-Things are constantly on fire ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Engineer - Mar 6, 2021"
		},
		"362": {
			"rating": "5.0",
			"desc": "Quickly growing ",
			"pros": "Excellent company growth trajectory Fantastic people Complex, interesting space that is payments ",
			"cons": "Work life balance (unless you are very skilled at setting clear boundaries)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*****  Technical Recruiter - Mar 5, 2021"
		},
		"363": {
			"rating": "5.0",
			"desc": "Everything is pretty good",
			"pros": "When my friends complain about their jobs, I can never relate. Management is a little chaotic but competent. Company mission is great. Coworkers are fantastic. ",
			"cons": "Some bad technical decisions made in the past make life painful, but fixing them is maybe not a priority yet and it can be hard to make time for those improvements.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l******  Software Engineer - Mar 3, 2021"
		},
		"364": {
			"rating": "4.0",
			"desc": "Fast growing company",
			"pros": "Smart peopleChallenging environmentPatrick is always interesting to listen toStock awards have grown in value well",
			"cons": "On call burdenWe invest a lot in developer tooling but the experience is still slow and often times broken",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Engineer - Mar 3, 2021"
		},
		"365": {
			"rating": "4.0",
			"desc": "A fast moving company with great career growth",
			"pros": "- Ability to have a lot of impact.- Very competitive compensation.- Fast moving.",
			"cons": "- Outdated tech stack.- Work life balance isn't as great as BIG 4.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B******  Software Engineer - Mar 1, 2021"
		},
		"366": {
			"rating": "3.0",
			"desc": "Good company, but you have to be lucky with your manager",
			"pros": "* people are brilliant and nice* good compensation and perks* excellent support systems (dev productivity, people ops, IT, etc.) ",
			"cons": "* keeping up with the those few hundred email threads you're in on any given day eats a good chunk of your working hours* gratuitous meetings consume the rest* engineering managers have little to no oversight. If one puts people on PIP and fires them left and right, no one bats an eye* if you end up on an understaffed project, your job will be putting out fires, all day every day, without chances of making forward progress and advancing through the ranks.",
			"resignation reason": "A better job opportunity came along, with fewer cons from the list above.",
			"authorInfo": "Verified User Former Employee  n*****  Senior Software Engineer - Feb 25, 2021"
		},
		"367": {
			"rating": "3.0",
			"desc": "Lots to learn, culture needs a slice of humble pie",
			"pros": "Tons of time to write, think and be strategic. People are generally nice. Global exposure Attracts great talent User-first mentalityHigh expectations of qualityGreat conversations around mealsAmazing supportive employee led and run communities ",
			"cons": "Culture is dry, and serious New idea are limited to what people are comfortable with GTM teams are plagued with fearMistakes have career limiting consequences High turnoverInnovation is choked by processBuild over buy mentality makes them lag in industry standards. ",
			"resignation reason": "Aggressive hostile management, career stagnation, innovation is discouraged, things are hidden from Executives, and poor behavior from middle management is tolerated ",
			"authorInfo": "Verified User Former Employee  g********  Revenue Manager - Feb 23, 2021"
		},
		"368": {
			"rating": "4.0",
			"desc": "Mobile Dashboard has been a pleasure to work on so far but early days.",
			"pros": "Very good comp for remote NAGreat autonomy on my specific teamSmart folks with usually more than one skillsetOpportunity to leverage skills outside immediate skillset with great support",
			"cons": "Can be overwhelming at first the range of work to be done outside immediate skillset but the support is there at least on my given teamLooking forward to having folks specialize more in future and not being stretched across the stack as we scale further",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Software Engineer III - Feb 23, 2021"
		},
		"369": {
			"rating": "3.0",
			"desc": "Great people but might not be a great culture for everyone",
			"pros": "- super smart and nice people - endless things to do - good benefits other than 401k match ($2k)",
			"cons": "- company and team (eng on a product team) culture apply pressure to always be achieving more: top down pressure on goals; hard to push back sometimes when it can be seen as lack of efficiency as leverage or just being understaffed - minimal onboarding support, with many new managers: probably especially bad for not very self-motivated new grads- pro or con: need to write a LOT",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Software Engineer - Feb 18, 2021"
		},
		"370": {
			"rating": "4.0",
			"desc": "Lots of talented people, lots of pressure to perform",
			"pros": "- Coworkers are all super friendly and very good at what they do.",
			"cons": "- There can definitely feel like there is quite a bit of pressure at times. Depending on what kind of environment is best for you, this can lead to a pro in that everyone you work with will be good at what they do and care a lot. This can be a downside if you're looking for a more relaxed environment. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*****  Software Engineer - Feb 15, 2021"
		},
		"371": {
			"rating": "2.0",
			"desc": "Always on PIP",
			"pros": "- Inspiring and energetic founders- Topline pay and benefits- Increase GDP of the internet is the real deal and really great to learn from and be apart of- Engineering peers are generally supportive, open minded, and empathetic",
			"cons": "- Have to conform to highly verbose writing and communication style, else you are booted out; basically comms are higher ranked than your engineering output- Engineering is rushed and it's basically a tech debt factory- Tech debt makes your WLB go down the drain- At L4 there is basically no career growth unless you are lucky; your promotion is if you aren't fired- Unsupportive and mentally unstable managers: they tell you to prioritize one thing one week and another thing next week, then the third week blame you for not being able to prioritize the right things. There are some great managers, but most are landmines sadly.- Culture of fear unless you are good friends with your management chain",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S*****  Software Engineer - Feb 14, 2021"
		},
		"372": {
			"rating": "5.0",
			"desc": "Best place I've worked at",
			"pros": "Great manager, work life balance, culture, benefits. HR team kills it",
			"cons": "My experience doesn't seem to reflect the rest of Stripe based on other reviews.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w*****  Software Engineer - Feb 14, 2021"
		},
		"373": {
			"rating": "4.0",
			"desc": "Exciting but growing too fast ",
			"pros": "Exciting company - making lots of progress from many angles.Lots of smart and dedicated people to work with ",
			"cons": "Bad wlbGrowing pains from growing too quickly Everything is a top priority ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*******  Operation Analyst - Feb 10, 2021"
		},
		"374": {
			"rating": "4.0",
			"desc": "Great founders, inspiring mission",
			"pros": "- Patrick and John are very inspirational- Rapid growth- Coworkers who seem to like/care about each other- Great opportunity to learn",
			"cons": "- Your success depends greatly on your manager, and many of them are not great- PIP culture",
			"resignation reason": "Didn't get along with manager, left for greener pastures ",
			"authorInfo": "Verified User Former Employee  G*****  Communications Associate - Feb 9, 2021"
		},
		"375": {
			"rating": "4.0",
			"desc": "What can I say",
			"pros": "The problems are challenging and immense The people top notch for the most part",
			"cons": "Oh the politicsManagement isn't super clear on direction Lots of org shifts depending on where you are",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q*****  Engineer - Feb 9, 2021"
		},
		"376": {
			"rating": "2.0",
			"desc": "Ok for some, horrible for others ",
			"pros": "Solid company missionSmart (genius), kind foundersRemote friendlySolid business and lots of earning potential ",
			"cons": "Work life balance is absolutely horrendous in some areasPockets of very incompetent, two faced, cold middle management They talk about having a high write culture, means docs, white papers, etc. are constantly being written. You can spend 40 / hrs a week just reading all the stuff that crossed your Inbox, and most of it will be important to your long term success. Ignore them to your own peril.Then literally everyone complains that it's hard to find information in the company because there's too many stale docsSudden and drastic shifts in priorities because the company doesn't really know how to scale and are just reacting and learning as they go. So much time wasted because of lack of foresight and hard decision making to set things up for longer term success, because leaders MUST have their near term resultsMost boring culture ever",
			"resignation reason": "Most boring culture ever. In Eng, there is literally zero room for levity compared to other companies. Expected to be 100% business 100% of the time. ",
			"authorInfo": "Verified User Former Employee  m********  Software Engineer - Feb 8, 2021"
		},
		"377": {
			"rating": "2.0",
			"desc": "Incompetent management and frequent reorgs",
			"pros": "Awesome founders, good WLB, intellectually challenging tasks, nice people, name is getting bigger ",
			"cons": "Management often burying their head in the sand, products getting very complicated in the backend, waste of resources due to frequent reorgs, no career/personal growth, favoritism over OGs ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Operations Manager - Feb 7, 2021"
		},
		"378": {
			"rating": "5.0",
			"desc": "Brilliant people, great culture, fast-paced ",
			"pros": "Extremely intelligent people Great missionCollison brothersTransparent communication ",
			"cons": "Do not expect to coast.. ever. Stripe is incredibly fast-paced and the expectations are high. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Administrative Analyst - Feb 5, 2021"
		},
		"379": {
			"rating": "5.0",
			"desc": "Awesome fast paced growth company. These come around maybe 1 or 2 times in your entire career in software",
			"pros": "Tech CultureFast Moving / ExcitingLots of latitude to improve things",
			"cons": "More startup than midsize company - if you enjoy lots of process and MS powerpoint slides Stripe is not for you.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*****  Engineering Group Leader - Feb 4, 2021"
		},
		"380": {
			"rating": "5.0",
			"desc": "Great company ",
			"pros": "Great co on a great trajectory. Really enjoy working every day!",
			"cons": "Lots of hard working people, which isn't exactly a con!",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*****  Engineer - Feb 2, 2021"
		},
		"381": {
			"rating": "4.0",
			"desc": "lots of growth and changing priorities",
			"pros": "great ambitionstrong visionworking on the right thingsmaking big investments in critical areas",
			"cons": "chaoticthrashingbad work life balancelots of changing prioritiesstraining old timers ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*********  Engineering Manager I - Feb 1, 2021"
		},
		"382": {
			"rating": "5.0",
			"desc": "Management is a little hairy at the moment",
			"pros": "Great culture, very smart and humble people, impactful work  in general.",
			"cons": " Some days can be very stressful, and perf levels bands are very broad so expectations are high.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Senior Software Engineer I - Feb 1, 2021"
		},
		"383": {
			"rating": "4.0",
			"desc": "Great company and founders, unsustainable work life balance ",
			"pros": "- great company culture- genius and transparent founders- top of industry benefits and compensation- love my team and colleagues (all very accountable and intelligent)",
			"cons": "- terrible work life balance (and I used to work in finance)- harsh performance review calibration - constant fear of losing my job",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*****  Software Engineer - Jan 27, 2021"
		},
		"384": {
			"rating": "4.0",
			"desc": "Growing pains, smart and kind people",
			"pros": "Ambitious and challenging for self starters, good compensation and upside ",
			"cons": "Inconsistent manager and team dynamics so can be very political how decisions are made ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*****  Program Manager - Jan 26, 2021"
		},
		"385": {
			"rating": "4.0",
			"desc": "Ok company but not great place for PM's",
			"pros": "Very nice people, launch beautiful and elegant products, great growth trajectory as a company ",
			"cons": "Too much complexity in products and too many re-orgs, too many high priority projects not properly staffed, not a good place for PMs (eng managers run the show)",
			"resignation reason": "No career growth, got re-orged too many times, burn out",
			"authorInfo": "Verified User Former Employee  E*****  Product Manager - Jan 26, 2021"
		},
		"386": {
			"rating": "4.0",
			"desc": "Generally good but getting wary of management",
			"pros": "- Good comp- Good trajectory- Good people- Nice size (big enough to have good resources, but not so big)",
			"cons": "- Feels like upper management unilaterally makes decisions and doesn't listen super hard to rank and file. Transparency might be going away (hard to tell)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  M*****  Software Engineer - Jan 23, 2021"
		},
		"387": {
			"rating": "4.0",
			"desc": "Ambitious, but thrashy culture",
			"pros": "People are nice, hardworking. Want to work on interesting problems and products. Amazing what's been built so far",
			"cons": "Constant mgmt changes, claims to be non-hierarchical but in reality very top down. Inconsistent with how people are held accountable or rewarded. Can seem to be who you know versus what you accomplish ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Program Manager - Jan 22, 2021"
		},
		"388": {
			"rating": "2.0",
			"desc": "Don't believe the hype",
			"pros": "- great TC- very rich written culture (everything important is available to all employees)- benefits, perks, and food- great brand on your resume",
			"cons": "(Terminal org)- Terrible WLB- Everyone brags that they only take vacation because they're about to lose vacation days- Management values reacting to problems over being proactive to prevent them- Retention is horrendous. No managers have been here for even a year--everyone else was fired or escaped to other teams. People are always switching out of Terminal or quitting Stripe altogether.- Always at the beck and call of big customers. No room for tech debt or proper infrastructure.- PIP culture",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h********  Software Engineer - Jan 21, 2021"
		},
		"389": {
			"rating": "3.0",
			"desc": "3.5 Genius founders, politics, growth...",
			"pros": "-Great growth. This means your equity will grow and there's so much still left to do at Stripe.-Great benefits & compensation. Stripe pays well and provides excellent benefits with the exception of the 401k matching ($2k only).-Genius founders. It's inspiring to have two genius founders who care so much about their company.",
			"cons": "-Politics. It's not about how well you do your job, it's about who you know. Stripe has a complicated culture. You're not successful or not rewarded unless you know the right people. -Growing Pains. Once upon a time, you could voice concerns and provide feedback. We used to care. Now we're changing to a corporation where we say we have these values, but our leaders don't lead by example.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Analyst - Business Consulting - Jan 19, 2021"
		},
		"390": {
			"rating": "5.0",
			"desc": "Brilliant and supportive team, growth opportunities, engaging day to day",
			"pros": "Intelligent and humble coworkers who make work fun, and rally around interesting problems. Mission supports real businesses and people at scale. Opportunities for personal growth, including as the company scales. Stripe invests in retaining talent, including internal mobility and transfers. ",
			"cons": "Varies team by team. Less work life balance as people are passionate and work hard. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Product Manager - Jan 16, 2021"
		},
		"391": {
			"rating": "4.0",
			"desc": "Good, but growing pains are felt",
			"pros": "Lots of growth opportunities, smart and talented people, remote friendly",
			"cons": "Decreased transparency, particularly during covid, and general normal growing pains",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Software Engineer - Jan 15, 2021"
		},
		"392": {
			"rating": "3.0",
			"desc": "Riding high on the brand name",
			"pros": "Good compensation benefitsNice people to work withHas huge growth potential",
			"cons": "If you are not working our of SF, you will find it really hard to take on challenging workVery very slow pace of execution. For a company that has so much potential to grow, the pace of execution at Stripe is appallingManagement communicates, but are not clear all the times. Conflicting messages are communicated at timesToo much bureaucracy getting into the system now",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*****  Software Engineer - Jan 14, 2021"
		},
		"393": {
			"rating": "3.0",
			"desc": "Nice people",
			"pros": "ICs are generally nice and want to be helpful. Work with really great engineers who care about the company and their teamsEveryone is doing at least two different jobs so you get a experience doing a bit of everything.",
			"cons": "seen numerous examples of changes in the org that make no sense or haven't been thought out wellmanagers are constantly changing which hurts career growth for junior engineersdoing someone else's (designer, pm, manager, because you don't have one) job doesn't do you any favors during perf review ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Software Engineer - Jan 14, 2021"
		},
		"394": {
			"rating": "4.0",
			"desc": "Growing company that has potential to be Google/Amazon level in 10 years if they execute properly.  ",
			"pros": "* Great people who are great at what they do* Interesting product/space",
			"cons": "* Compensation philosophy is shifting resulting in significantly less upside opportunity.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Analyst I, Business Support and Analytics - Jan 12, 2021"
		},
		"395": {
			"rating": "5.0",
			"desc": "Great people, ambitious mission, and all the challenges of scale",
			"pros": "* Ambitious mission + high-quality suite of products * Great executive leadership * Co-workers are smart, hard-working, humble, and kind, with surprisingly minimal 'get-ahead' politics * Opportunities to learn and grow are everywhere with a rapidly expanding business ",
			"cons": "* The company's growing fast and things change rapidly, which can be disorienting* The company's really understaffed, so the pace and expectations are intense. Pre-IPO companies are not for the faint of heart. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  Operations Lead - Jan 11, 2021"
		},
		"396": {
			"rating": "5.0",
			"desc": "Top notch",
			"pros": "People are very smartOpportunity size is hugeSolving hard and real problems",
			"cons": "Very under-resourced on almost all fronts - hard to perform unless you work overtime",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h******  Product Manager - Jan 10, 2021"
		},
		"397": {
			"rating": "4.0",
			"desc": "Great business trajectory",
			"pros": "Business trajectory at its current scale feels unmatched amongst private companies.",
			"cons": "Most teams are severely understaffed, leading to burn out and poor WLB.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  Engineering Manager - Jan 7, 2021"
		},
		"398": {
			"rating": "5.0",
			"desc": "Patrick and John are amazing",
			"pros": "You join this company because P&J are truly that awesome. The trust in them as leaders is pretty significant. ",
			"cons": "All the same politics as you'd find anywhere, it's a big company now. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*******  Software Engineer - Jan 7, 2021"
		},
		"399": {
			"rating": "5.0",
			"desc": "👍 ",
			"pros": "Stripe is a nice and great company to work for.",
			"cons": "Not really much for me to complain about at Stripe.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  Engineer - Jan 7, 2021"
		},
		"400": {
			"rating": "5.0",
			"desc": "Lots of opportunity, lots of stress",
			"pros": "Stock upside. Opportunity for impact. Smart people. Growing fast. ",
			"cons": "Firing people quietly, stressful perf process, hard to maintain WLB",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*****  Software Engineer - Jan 6, 2021"
		},
		"401": {
			"rating": "5.0",
			"desc": "pretty good work life balance and scaling pains are real",
			"pros": "pretty good work life balance; good stock growth opportunity; interest engineering problems",
			"cons": "lack of management help; limited career growth; scaling pains are real",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Engineer - Jan 6, 2021"
		},
		"402": {
			"rating": "4.0",
			"desc": "Great mission, lots of swirl",
			"pros": "Well intentioned mission around providing access to businesses to moving money easily and facilitate payments. Ambitious products and vision around what us possible ",
			"cons": "Disciplines involved with product that aren't specifically eng or PM get undervalued and understaffed. Like design, research, data science. Lots of mgmt swirl and overly complex processes. Unclear how strong a product development process we actually have. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*******  Operations Lead - Jan 5, 2021"
		},
		"403": {
			"rating": "5.0",
			"desc": "Ambitious mission and company. Rigorous and rewarding job",
			"pros": "Still early days at StripeReally smart coworkersInteresting and challenging problems",
			"cons": "Starting to be more challenging to build 0 to 10 products",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Product Manager - Jan 3, 2021"
		},
		"404": {
			"rating": "5.0",
			"desc": "Passionate employees and fast growth",
			"pros": "Stripe is full of energetic hard-working people and is growing quickly",
			"cons": "Not as laid back as bigger companies, work life balance can be tricky",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*****  Software Engineer - Dec 27, 2020"
		},
		"405": {
			"rating": "4.0",
			"desc": "Overall company is doing well but experience may be team dependent",
			"pros": "Great company mission, smart co workers and interesting problems to solve",
			"cons": "Poor work / life balance and increasing bureau and hierarchy ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*********  Finance - Dec 27, 2020"
		},
		"406": {
			"rating": "3.0",
			"desc": "Just not a fit for me",
			"pros": "Brand nameProducts and customers- you learn a lotTalented peopleGood brand name to have in your resume. I enjoyed the first 6 months",
			"cons": "ManagementGrowing painsWeird cultureI developed anxiety and became depressed as it was not a cultural fit for me and I was passive aggressively goaded by a colleague with no backing from my manager. I was really relieved to quit! The kind of immaturity I had to deal with drained my soul",
			"resignation reason": "Culturally not my cup of tea! Confused management who cannot provide any direction or take criticism.",
			"authorInfo": "Verified User Former Employee  a*********  Engineer - Dec 26, 2020"
		},
		"407": {
			"rating": "5.0",
			"desc": "I love the written communication culture. It makes impactful work as a remote so much easier.",
			"pros": "Rapid growth creates interesting problems. There is so much interesting work to do. It's not hard to find ways to add a lot of value. ",
			"cons": "There is a recent sense of longing for the good old days by some long tenured employees. This is not helping our culture or our product since it alienates new ideas and new people. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*********  Software Engineer - Dec 26, 2020"
		},
		"408": {
			"rating": "3.0",
			"desc": "Declining rapidly",
			"pros": "Most people are fun, ambitious, and warm. Lots of interesting projects and problems, lots of autonomy. They at least pay lip service to caring about marginalized people even if it's not always carried out. Hard work is noticed, usually. ",
			"cons": "A lot of the people who contributed most positively to the culture all left around the same time and it's not clear why. CEO seems hypersensitive to criticism in the last few months, and the operating principles that used to make perfect sense have been replaced with techbro babble. They're mostly about doing things faster and putting Stripe before yourself, being selfless, then being warm and caring as an afterthought. They removed all references to editing the company or even the slightest mention of accountability. Those changes are pretty in line with how leadership has started cracking the whip recently. I used to feel like I was here to contribute uniquely, now I'm just told who I need to be and how I am sanctioned to feel to fit in and told to hurry up and leave if I don't like it. Luckily I get to work on interesting stuff and my direct manager is good, otherwise I'd be out by now.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c***  Project Manager - Dec 22, 2020"
		},
		"409": {
			"rating": "2.0",
			"desc": "Morphing into a political game of thrones",
			"pros": "- doing well since e-commerce is doing well; hopefully IPO someday- decent cash and bonus- on the surface, everyone is nice- p&j host q&a every few weeks, you get a general sense of what's going on- not as hq centric as other tech firms",
			"cons": "- perf is becoming very political and weird, seems like a purge is on in some parts- suddenly a colleague might vanish with no heads up- lots of new leaders from outside payments, still peeling the payments onion- slow speed due to legacy monolith code stack, all changes need have cross-functional collaboration- not at all platformized, so planning means ad-hoc renegotiation with dependent teams for bandwidth- some teams are confused as to why they exist, constantly re-orging",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*******  Produce Manager - Dec 21, 2020"
		},
		"410": {
			"rating": "4.0",
			"desc": "Unique culture with smart people",
			"pros": "- Smart people who are humble- Founders- Ability to have great impact",
			"cons": "- Really depends on the team you're on and who your manager is- getting more political and hierarchical- not great at recognizing and rewarding performance",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*****  Product Marketer - Dec 19, 2020"
		},
		"411": {
			"rating": "5.0",
			"desc": "Overall great",
			"pros": "I think what stripe is building is truly great and truly important for the world. People are very kind and willing to communicate which I think is great.",
			"cons": "Not all teams are part of stripe core so sometimes it can feel you are no part of what stripe is building. It's hard to find open opportunities to participate in new upcoming products.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o*****  Software Engineer - Dec 19, 2020"
		},
		"412": {
			"rating": "3.0",
			"desc": "Great Business but Growing Pains",
			"pros": "- Incredibly smart people- Amazing mission- Incredible trajectory ",
			"cons": "- Lack of clear priorities makes it hard for the organization to rally around the right things- Political performance management process- Management will never thank you for working hard",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*********  Program Manager - Dec 18, 2020"
		},
		"413": {
			"rating": "4.0",
			"desc": "Not great, not terrible",
			"pros": "- Great teammates- Lots of opportunities in fintech- Decent autonomy",
			"cons": "- Limited career growth opportunities (company seems to prefer hiring externally over internal promotions)- Not a fun place to work at- Work life balance varies a lot on a team by team basis- A lot of homegrown, not that great tech",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Software Engineer - Dec 16, 2020"
		},
		"414": {
			"rating": "3.0",
			"desc": "Not what it used to be",
			"pros": "* Smart and kind ICs* Good benefits* Lots of market opportunities within fintech",
			"cons": "* Teams vary in maturity, managers vary in quality * Politics* Limited growth opportunities (would rather hire senior folks than grow existing employees)* Limited equity upside for new joiners (new RSU policy)* Culture is changing. More hierarchical. More corporate (but still expects you to work startup hours). Management should explicitly address the changing culture - it's the elephant in the room for tenured folks* Needs to figure out how to scale ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*****  Program Manager - Dec 15, 2020"
		},
		"415": {
			"rating": "4.0",
			"desc": "Team mates are great",
			"pros": "High caliber people all round and culture feels academic. Benefits are pretty good.",
			"cons": "HR and management leave a lot to be desired and some decisions are really opaque especially considering leadership keeps touting transparency.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Software Engineer - Dec 7, 2020"
		},
		"416": {
			"rating": "4.0",
			"desc": "Great company but much depends on your team",
			"pros": "Patrick/John are the real deal.Strong mission that makes meaningful impact.Smart/humble people",
			"cons": "Run lean/key person riskUnder investing in certain teamsLots of shake-ups in leadership in certain orgs/constant churn.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Technical Product Manager - Dec 6, 2020"
		},
		"417": {
			"rating": "4.0",
			"desc": "Good company in an industry with a lot of growth potential",
			"pros": "Smart and humble people. Management is transparent. Good benefits. Mission driven. ",
			"cons": "Work life balance is not great. Not very data driven due to the nature of the product. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*****  Data Scientist - Dec 5, 2020"
		},
		"418": {
			"rating": "4.0",
			"desc": "Going to be great...eventually ",
			"pros": "Smart people Good product market fit Bringing in the right management ",
			"cons": "No work life balance Little internal support from cross functional teamsCompensation ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  Sales - Dec 5, 2020"
		},
		"419": {
			"rating": "4.0",
			"desc": "Great people, difficulty scaling product development, lack of leadership in some areas",
			"pros": "- User focused- Most people you work with will be very smart, driven, kind, and well-intentioned- High quality of work in most areas- Solid product market fit",
			"cons": "- Struggles to fund support certain areas properly (PM, design, front end, platform teams, developer productivity and infrastructure)- Strong, high level product leadership is severely lacking- Scaling has been difficult",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Design Manager - Dec 3, 2020"
		},
		"420": {
			"rating": "3.0",
			"desc": "Not scaling well",
			"pros": "Smart and humble peopleGood benefitsStrong potential and growth trajectory",
			"cons": "Org design / structure and many junior managersNot progressing and valuing tenured people",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n*******  Staff Engineer - Dec 1, 2020"
		},
		"421": {
			"rating": "5.0",
			"desc": "Good",
			"pros": "Good WLB and Benefits, transparent & friendly company culture. Company goals are clearly defined. ",
			"cons": "Information can be silo'd and requires tracking down and verifying. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*******  Customer Solutions Engineer - Nov 24, 2020"
		},
		"422": {
			"rating": "3.0",
			"desc": "Taking the bad with the good",
			"pros": "Stripe has a clean, exciting mission, and the Collison bros are very sharp and inspiring. The engineers are very smart.",
			"cons": "Stripe has a reputation for being nice, but definitely does a lot of quiet, sudden firings in the background. Much of this is arbitrary, and with no manager feedback in advance.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Engineering Manager - Nov 16, 2020"
		},
		"423": {
			"rating": "5.0",
			"desc": "Good",
			"pros": "Well run company. Nice colleagues. Great upside. Transparent. Great documentation. ",
			"cons": "Work a lot, high expectations across the board. Colleagues can be a bit cold. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  National Account Executive - Nov 4, 2020"
		},
		"424": {
			"rating": "4.0",
			"desc": "Amazing culture and people, everything else depends on the team ",
			"pros": "Transparent and supportive culture. Smart, humble and hardworking co-workers. Company has lots of growth potential.",
			"cons": "Constant shifts in organizational structures and priorities. Some teams have mediocre WLB   and/or constant fire-fighting",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b***  Engineer - Oct 29, 2020"
		},
		"425": {
			"rating": "5.0",
			"desc": "Fast moving company with a lot of ambition",
			"pros": "- fast growing, a lot of opportunities- large ambition, not polishing a small product, a lot to build- great people, friendly, smart and well intentioned",
			"cons": "- fast moving, priorities can shift quick- need to get good at making tough decisions quickly",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*****  Engineer - Oct 19, 2020"
		},
		"426": {
			"rating": "5.0",
			"desc": "Very different experience. Some teams are not well run",
			"pros": "If you're joining a good team, you'll have opportunities to grow and good projects.",
			"cons": "If you're joining an incompetent org you are in for a bad time. e.g. there is an where folks are forced to work on a suicide project ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  G*****  Software Engineer - Oct 19, 2020"
		},
		"427": {
			"rating": "5.0",
			"desc": "All nice and amazing people",
			"pros": "* Fair compensation* lots of opportunieses for personal careeee growth* two co-founders are incredibly smart and have good vision",
			"cons": "* some teams don't have good work life balance* some managers are less experienced",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*****  Software Engineer - Oct 19, 2020"
		},
		"428": {
			"rating": "5.0",
			"desc": "I really enjoy working at Stripe, It's the best company!",
			"pros": "- great career growth- great engineers- strong leadership- performance culture",
			"cons": "None that I can think of right now, honestly, it's been great!",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Engineering Manager - Oct 16, 2020"
		},
		"429": {
			"rating": "5.0",
			"desc": "Great company with some growing pains",
			"pros": "* Work is high impact and feels meaningful* There are a lot of high-visibility projects/work which can lead to rapid career growth if you are willing to take risks and go after it* People are wonderful to work with, super friendly and polite even in stressful situations* Work life balance is great compared to past jobs/peers at other companies (although I do hear this is quite team specific)",
			"cons": "* Decision making is ad hoc, not well structured. If you can navigate that it's fine but can be frustrating/intimidating to folks who don't work well with a bit of chaos.* Tooling is great but has lots of rough edges* Things are moving quite fast here, lots of organizational change* Most managers are not super experienced and we don't do the greatest job at training people up",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Software Engineer - Oct 15, 2020"
		},
		"430": {
			"rating": "1.0",
			"desc": "Worst management ",
			"pros": "The documentation culture- makes it great for covid times.not sure if anything else is good ",
			"cons": "Everything else - it's a fish market , random growth , politics , silly overwork and arrogance from leaders ",
			"resignation reason": "Hated the culture , hated the leadership . Micromanager. Did not like the work ",
			"authorInfo": "Verified User Former Employee  S*****  Engineering Manager II - Oct 13, 2020"
		},
		"431": {
			"rating": "4.0",
			"desc": "Hard work, but worthwhile ",
			"pros": "Surrounded by intelligent people who make you a better person ",
			"cons": "Not an coast by culture. To meet expectations is to constantly be exceeding them. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s********  Sales - Oct 6, 2020"
		},
		"432": {
			"rating": "4.0",
			"desc": "Smart peoole",
			"pros": "-high caliber of people so far -thorough documentation-extensive Onboarding ",
			"cons": "-big company feel (can't just go to a person to get a question answered)-harder to onboard in this remote environment ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Engineer - Oct 4, 2020"
		},
		"433": {
			"rating": "3.0",
			"desc": "Good life work balance, wish compensation was better",
			"pros": "Life work balanceCollaborative cultureAccess to leadership Fast growth",
			"cons": "Growing painsCompensationBenefits 401k match, wellness, commuting Management transparency ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Software Engineer - Oct 2, 2020"
		},
		"434": {
			"rating": "5.0",
			"desc": "Challenging but interesting work",
			"pros": "* Interesting engineering problems* pretty good work/life balance* Really thoughtful and inspiring founders/leadership",
			"cons": "* Your experience very much depends on your team and manager* Some teams can be very page-heavt",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S*****  Software Engineer - Sep 29, 2020"
		},
		"435": {
			"rating": "4.0",
			"desc": "Solid company with outstanding talent, great culture, but uninspiring focus",
			"pros": "- outstanding talent- great culture- excellent leadership- potential for growth",
			"cons": "- dry subject matter- in a tough competitive landscape",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  2*******  Software Engineering - Sep 29, 2020"
		},
		"436": {
			"rating": "4.0",
			"desc": "Not a place to coast",
			"pros": "- Patrick is the best reason to work here- Business model enables natural growth, covid helped the company",
			"cons": "- Inefficient hiring for leaders and senior engineers- Lots of politics at middle management",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Software Engineer, Technical Lead - Sep 28, 2020"
		},
		"437": {
			"rating": "5.0",
			"desc": "The smartest colleagues in the business.",
			"pros": "Having worked at other FAANGs for years before my time at Stripe, I've been privileged to have brilliant coworkers over the course of my career. That said Stripe easily takes the cake for the best. You will work harder than ever, and there are certainly growing pains going on right now, but it's an incredible place to work. I've learned a ton.",
			"cons": "-Non engineering comp needs some work and isn't competitive with FAANG.-Less levels means more ambiguity moving across the company-Folks work hard here! But I find this almost to be a strength since coasters don't really get away with it here.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A***  Manager, Account Management - Sep 26, 2020"
		},
		"438": {
			"rating": "5.0",
			"desc": "pretty good",
			"pros": "lots of problems to solve, great opportunities to make impactseen questionable decisions from higher ups, but C-suite is solid",
			"cons": "lots of problems to solve, too many things to do and degrades wlb",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Software Engineer - Sep 26, 2020"
		},
		"439": {
			"rating": "5.0",
			"desc": "The next Amazon",
			"pros": "Top level leadership are visionaries. Stripe is making a tangible impact across the globe and there's much more to come.The people at Stripe are incredible. Intellectually curious, ambitious and humble.",
			"cons": "Systematically understaffed, and in some areas critically so.Growing pains are real and felt widely.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Engineer - Sep 24, 2020"
		},
		"440": {
			"rating": "5.0",
			"desc": "Excellent overall level of engineering quality",
			"pros": "- World-class engineering, high quality people all around- Stripe is a leader and innovator in an ever-growing market- Empathetic culture- Founders are some of the best in the business",
			"cons": "- The usual issues with hypergrowth arise - some get left behind and burnt out",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Software Engineer - Sep 24, 2020"
		},
		"441": {
			"rating": "4.0",
			"desc": "Great culture, inefficient management",
			"pros": "The company seems to truly care about building a fulfilling place to spend a large chunk of your career. Compensation is solid. If you're good at taking initiative, there is a lot of cool stuff to make a case for and execute on. The problems are interesting and stimulating. Genuinely smart and kind coworkers. Lovely offices with delicious food. ",
			"cons": "Manager quality is low. Being an EM at Stripe is hard and I don't think most external hires are good at it. Too few TPMs and PMs. ICs and EMs have to take on PM tasks as a result, and this rarely ends well. Leadership seems increasingly distant from realities on the ground. WLB is poor on certain teams. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Staff Software Engineer - Sep 22, 2020"
		},
		"442": {
			"rating": "5.0",
			"desc": "Best experience ever",
			"pros": "Fast career growth, not a lot of BS, interesting challenges.",
			"cons": "I can't think of many, it has been good so far.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Software Engineer - Sep 19, 2020"
		},
		"443": {
			"rating": "4.0",
			"desc": "Product focus, writing heavy, conservative tech",
			"pros": "Strong product market fit, vision from CEO, potential from equity return",
			"cons": "Technology are less advanced, monolithic Ruby over mongo, though there are changes to services recently, a lot of writing docs, very demanding on delivery and wlb",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g********  Engineer - Sep 19, 2020"
		},
		"444": {
			"rating": "3.0",
			"desc": "onset of losing identity",
			"pros": "1. good overall comp including benefits2. most people are smart and genuinely nice3. problem space is practically limitless",
			"cons": "1. hiring spree in 2019 introduced bad eggs that have outsized influence over the silent (and nice) majority2. trying to do too many things; chasing the next shiny thing. tech debt and infrastructure is reaching an inflection point3. leadership is starting to live in an ivory tower",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*********  Engineer - Sep 18, 2020"
		},
		"445": {
			"rating": "4.0",
			"desc": "bad work life balance, patrick is the best",
			"pros": "patrick and john truly are the best, colleagues are smart",
			"cons": "you work a lot, management (outside of founders) is a revolving door",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Software Engineer - Sep 15, 2020"
		},
		"446": {
			"rating": "3.0",
			"desc": "Lack of quality engineering projects in APAC regions",
			"pros": "1. Well compensated : Base + RSUs2. Smart and friendly peers3. Access to some of the best engineering leaders in the tech industry",
			"cons": "1. Most of the engineering projects in APAC deals with building new payment integrations or maintain an existing one. This inherently shifts the focus from tech to product perspective. At the end, even as a backend engineer, you would spend more time in communication (with internal teams or external vendors) compared to actual engineering effort and the skew is really large.2. Horrible codebase (large monolithic ruby spaghetti) !!!!!3. With a focus on rolling out new features / products, technical debts are not given equal importance. 4. If everything is a priority, then its not prioritization. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Software Developer - Sep 14, 2020"
		},
		"447": {
			"rating": "4.0",
			"desc": "Smart people who genuinely want to do the right thing.",
			"pros": "See summary. Smart inspiring people who want to own the culture and aim to do the right thing",
			"cons": "Change can happens quickly and can feel like a surprise ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q*****  Manager, Consulting - Sep 11, 2020"
		},
		"448": {
			"rating": "4.0",
			"desc": "it is what you make ifnit",
			"pros": "plenty of opportunities to step up if you're willing to. ",
			"cons": "can be easy to get lost, information and decisions  are not disseminated that effectively. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l****  Engineer - Sep 11, 2020"
		},
		"449": {
			"rating": "5.0",
			"desc": "Strong engineering culture but very team dependent",
			"pros": "- Very good compensation- Interesting technical challenges and opportunities to take ownership- Great developer productivity tools and engineering systems- Company culture is genuinely oriented towards guiding principles",
			"cons": "- Situation can be very team dependent, with effects on manager favoritism, work/life balance and choice of projects",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*******  Software Engineer - Sep 10, 2020"
		},
		"450": {
			"rating": "5.0",
			"desc": "Unclear leadership but still a rocket ship",
			"pros": "Great culture, solid pay, good coworkers, growing fast now ",
			"cons": "Leadership is always playing games, never know what they're thinking or doing ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Technical Account Manager - Sep 9, 2020"
		},
		"451": {
			"rating": "4.0",
			"desc": "Stripe",
			"pros": "Great people Good work life balance and Good career progression ",
			"cons": "Very slow to make any changes Compensation is not comparable to other big tech companies ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Product Support Specialist - Sep 9, 2020"
		},
		"452": {
			"rating": "3.0",
			"desc": "Highly team dependent",
			"pros": "Good comp, technically challenging and if you end up on the right team you'll be surrounded by supportive people.",
			"cons": "If you end up on the wrong team expect poor work/life balance, managers playing CYA games and few opportunities to move.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*****  Engineer - Sep 9, 2020"
		},
		"453": {
			"rating": "5.0",
			"desc": "Potential for huge impact. ",
			"pros": "Intellectual, smart company. Scale and infrastructure means you can work at a global company that touches most verticals and industries. ",
			"cons": "Nebulous internal process. Biased towards planning, writing, reviewing documents, over ship moving and iterating. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Technical Operator - Sep 8, 2020"
		},
		"454": {
			"rating": "5.0",
			"desc": "Excited for the next phase!",
			"pros": "Smart, empathetic coworkersInteresting, novel problems to solveLow-ego culture ",
			"cons": "Growing pains!Hard to find information on Confluence Career development expectations are difficult",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a****  Program Manager - Sep 8, 2020"
		},
		"455": {
			"rating": "5.0",
			"desc": "Lots of room to define role",
			"pros": "Internship is great! Lots of smart people. Many emphasize having product skills over technical skills. Interns are given lots of room to define their role and propose and take on new projects if there is interest. Flexibility is wonderful. ",
			"cons": "Internship technical project work can sometimes be boring! Internship is not challenging, but is a good opportunity to be a fly on the wall at the company (which is VERY valuable). ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Software Engineer - Sep 4, 2020"
		},
		"456": {
			"rating": "4.0",
			"desc": "Strategic vision but major growing pains and lack of ownership",
			"pros": "Payments has range of areas to go deep in Humble and respectful colleaguesGenerally good reputation externally ",
			"cons": "Huge growing pains with the rapid growth- can be difficult to get concrete answers internallyDecentralized ownership across highly interconnected products (also one of the reasons it can be so difficult to get anything done with 100% certainty), which could also come from not always hiring people with direct payments or fintech expertise/experienceFlat hierarchy without title changes between promotions (uplevels), which can be confusing externally and make internal escalations disorganizedTeams generally seem bandwidth constrained and some disengaged from the users first operating principle",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Sales - Sep 2, 2020"
		},
		"457": {
			"rating": "2.0",
			"desc": "Disappointed",
			"pros": "Emphasis on being kind to one anotherVery nice offices and food (when you can use them)Company is not widely despisedGuaranteed riches 😉",
			"cons": "Uninspiring tech, low quality codeBoring domainSome less-than-stellar managers",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c********  Software Engineer - Sep 1, 2020"
		},
		"458": {
			"rating": "2.0",
			"desc": "Incompetent middle management ",
			"pros": "Stripe business is doing well and payment industry is promising",
			"cons": "WLB and career growth vary depend on middle management and very few are good",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Program Manager - Aug 29, 2020"
		},
		"459": {
			"rating": "5.0",
			"desc": "Very happy, lots of growth",
			"pros": "Great company with tremendous business outlook. Thoughtful leadership and the culture is generally great (but don't know how long that's going to last as we hire more and more people, and already noticed the increasing number of a**holes).",
			"cons": "Stripe's business and products are built upon being super technical so if you don't like to think technical it will be challenging. And as a consequence, the company is very engineering-centric (good for eng teams, but might not be good for everyone)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Data Scientist - Aug 22, 2020"
		},
		"460": {
			"rating": "5.0",
			"desc": "Pretty happy",
			"pros": "Great for career growth, pay is good, benefits are spectacular, and absolutely love my team. My manager doesn't care where or when I work as long as I produce. Been at company less than a year and we're already talking about up leveling in a few months.",
			"cons": "Super high expectations. Depending on what team you're on, wlb can be a challenge. I'm fortunate enough to be on a great team.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*******  Human Resources - Aug 20, 2020"
		},
		"461": {
			"rating": "3.0",
			"desc": "at mid level becomes a lot of politics",
			"pros": "good work for the most partinteresting challengescomp and benefits",
			"cons": "politicsdepending on team wlb is not the greatestconstant shuffling of orgs",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Engineer - Aug 19, 2020"
		},
		"462": {
			"rating": "4.0",
			"desc": "Huge opportunity to learn and grow but know what you are signing up for.",
			"pros": "1. Learned and grew A TON. Both professionally and personally.2. Given the opportunity and exposure to work on a few high impact and really interesting projects.3. Work with some of the very best in the industry.",
			"cons": "1. WLB. Not the best- would work 60+ hours a week at times, but largely a function of shifting priorities and unrealistic timelines. 2. Toxic Managment. This is probably not everywhere at Stripe but burned through a lot of managers and had several reorgs on our team. Things will change overnight drastically and you have to be prepared for that. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S*******  Risk Management - Aug 19, 2020"
		},
		"463": {
			"rating": "5.0",
			"desc": "bullish",
			"pros": "likely to be a very valuable companymost poeole are top notch ",
			"cons": "not a cushy job by any means. You can not rest and vest here",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i********  Technical Recruiter - Aug 18, 2020"
		},
		"464": {
			"rating": "5.0",
			"desc": "Great compensation",
			"pros": "Comp is more competitive than even places like Citadel! And most FAANG except maybe FB and Netflix (but the paper TC is comparable)",
			"cons": "The team is STACKED so its very easy to feel impostor syndrome",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Software Engineer - Aug 18, 2020"
		},
		"465": {
			"rating": "4.0",
			"desc": "manager is roulette, good culture ",
			"pros": "Work life balance is goodTransparency about company healthRetain consistent bar for hiring",
			"cons": "Manager bar variesStruggle with scalingManaging out happens a lot",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*******  Technical Program Manager - Aug 16, 2020"
		},
		"466": {
			"rating": "4.0",
			"desc": "great place to join, must self guide",
			"pros": "great company momentum, strong excitement, collaborative culture, strong hiring bar, very realistic interview content (no LC)",
			"cons": "no one will prevent you from working long hours, people management is uneven, have to make your own career",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*****  Staff Software Engineer - Aug 16, 2020"
		},
		"467": {
			"rating": "5.0",
			"desc": "really good work life balance and tc",
			"pros": "company is great and the work is interesting tc is good",
			"cons": "nothing that i can think of other than a slightly inactive blind group",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Software Engineer - Aug 16, 2020"
		},
		"468": {
			"rating": "5.0",
			"desc": "Great fast paced company to work for",
			"pros": "good compensation , good number of perks,  fast paced , transparency between teams , lots to learn",
			"cons": "too much growth in too short time means culture is always changing , no transparency from upper management ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Software Engineer - Aug 16, 2020"
		},
		"469": {
			"rating": "3.0",
			"desc": "Room to improve",
			"pros": "- Higher levels of autonomy that helps you build a great experience, if compared to bigger techs.- Flat structure that makes you feel closer to senior leadership.",
			"cons": "- Work-life balance is really bad. Hub structure makes it hard not to find yourself working in odd hours on a daily basis.- Compensation far from meeting responsibility levels.- Performance bar (from a management perspective) is higher. This means it's harder to get rates beyond Meets Expectations, which also means you get promoted much slower than other tech companies.- Performance bonus (for non Sales roles) is paid once a year, instead of 50/50 like other techs. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Program Manager - Aug 15, 2020"
		},
		"470": {
			"rating": "5.0",
			"desc": "tc good for new grad",
			"pros": "tc good for new grad in tech, like really fking good",
			"cons": "getting a bit too big, people are very nice, but sometimes a bit too uptight/pc",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*******  Software Engineer - Aug 12, 2020"
		},
		"471": {
			"rating": "3.0",
			"desc": "overall good comapny to be at",
			"pros": "tc is amazing, company growing fast which means equity is worth something",
			"cons": "wlb sucks, mismanagement in a lot of areas, changes poorly communicated",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*********  Software Engineer - Aug 12, 2020"
		},
		"472": {
			"rating": "5.0",
			"desc": "High impact and energizing work",
			"pros": "It has been a pleasant surprise at how much impact I've been able to have in such a short amount of time. Its energizing to be working on projects that affects thousands of businesses and developers and used by millions of customers.Pay is also pretty great :)",
			"cons": "This isn't the place to rest and vest. You're surrounded by hard working individuals and there is an expectation tonperform. That type of culture isn't for everyone.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*****  Software Engineer - Aug 11, 2020"
		},
		"473": {
			"rating": "5.0",
			"desc": "we haven't won yet",
			"pros": "the culture. people are respectful. there's a culture of openness and transparency. ",
			"cons": "usual growing pains. the next year or so will determine if it's possible to hold onto the stripe culture or not.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*********  Software Engineer - Aug 10, 2020"
		},
		"474": {
			"rating": "4.0",
			"desc": "Lots of good things... and bad things",
			"pros": "The good: Very good career growth opportunities, lots to do, given lots of ownership and responsibilities. Lots of trust between levels regardless of seniority. Oh and the compensation is well above average, lots of flexibility and support for remote work.",
			"cons": "Tough WLB, strict performance and uplevel expectations. Shitty internal mobility. Ruby is 💩",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t********  Software Engineer - Aug 10, 2020"
		},
		"475": {
			"rating": "5.0",
			"desc": "overall really great company with a really great future",
			"pros": "good projects, good managers, good career growth, decent to good wlb",
			"cons": "wlb can be bad since theres so much to get done sometimes",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*****  Software Engineer, Web Applications - Aug 10, 2020"
		},
		"476": {
			"rating": "4.0",
			"desc": "Good place to work ",
			"pros": "Company has very lofty goals, smart co workers, good comp",
			"cons": "You have to own your own career growth, not a lot of guidance from management ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*******  Software Engineer - Aug 10, 2020"
		},
		"477": {
			"rating": "5.0",
			"desc": "We haven't won yet",
			"pros": "Company's future is so bright like a diamond 💎💎💎 CEO is very transparent",
			"cons": "They will flick you out like a booger if you don't perform. Not for rest and vesters",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S********  Partner Group Program Manager - Aug 8, 2020"
		},
		"478": {
			"rating": "4.0",
			"desc": "Well intentioned ambitions ",
			"pros": "People care about their work and get things done. Bar is high for product development. Founders are wicked smart and genuinely care. And technical. Compensation quite good especially with future prospects. Engineers have much more ownership. ",
			"cons": "Work life balance can struggle at times although seems to be getting better at least. Management can be missing or inexperienced. Bar for success is high (which can be good too). Fintech isn't a product domain for everyone. Business opportunities are great although Too focused on business instead of career development at times. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Software Engineer - Aug 8, 2020"
		},
		"479": {
			"rating": "4.0",
			"desc": "Great company, tough WLB",
			"pros": "Great company, solid and attentive leadership, high quality product and engineering orgs",
			"cons": "High expectations and tough WLB, still new, but they may not be ambitious enough to achieve their goals ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Software Engineer - Aug 8, 2020"
		},
		"480": {
			"rating": "5.0",
			"desc": "Great culture and wlb",
			"pros": "culture(communication transparency)wlb is generally okay depending on teamcomp is good",
			"cons": "young managementnot too many teams to switch to hmm",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*********  Software Engineer III - Aug 7, 2020"
		},
		"481": {
			"rating": "4.0",
			"desc": "Pretty, pretty good.",
			"pros": "Stripe is full of  smart, friendly people who care about their work.",
			"cons": "It can result in an environment though where people care to a fault and there's a lot of self-directed pressure to perform.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Software Engineer - Aug 7, 2020"
		},
		"482": {
			"rating": "4.0",
			"desc": "Some rough edges but overall pretty good",
			"pros": "Great coworkers, great product / business vision, a lot of optimism",
			"cons": "A lot of systems/processes are still pretty immature, but it seems like there are active efforts to improve them.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*****  Software Engineer - Jul 25, 2020"
		},
		"483": {
			"rating": "4.0",
			"desc": "High comp and fast-paced work",
			"pros": "High compensation for SWE rolesLots of diverse fast-paced projects",
			"cons": "No strong company culture, lots of people are focused on their own careers over relationships at work.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  D*****  Software Engineer - Jul 9, 2020"
		},
		"484": {
			"rating": "3.0",
			"desc": "Can't build a career at Stripe, but great place to learn",
			"pros": "Lots of learning, esp about the financial services area90 out of 100 Stripes are great people to work, and whom you'll hire again and hang out withFantastic CEO",
			"cons": "No career development for most Stripes at this point. Promotion = getting moved laterally, or taking on more work. Stripe keeps hiring seasoned veterans above folks into management position at this point in timeIncreasing level of politicking within the company (which is expected). There are bad actors who get away with being terrible or incompetent due to having tight relationships with the right senior leaders",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*****  Lead Developer - Jul 3, 2020"
		},
		"485": {
			"rating": "5.0",
			"desc": "Great Culture and Move Fast",
			"pros": "* Top Tier Benefits.* Smart People.* TC is among FAANG Level.* CEO is fantastic",
			"cons": "* Opportunities are not quite available outside HQ eg. Data Scientist, MLE etc.* Move too fast sometimes.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Software Engineer - May 30, 2020"
		},
		"486": {
			"rating": "3.0",
			"desc": "Great to build your career",
			"pros": "Great place to start and launch your career. You'll be surrounded by some very talented people. The company is pretty transparent, almost surprisingly so.",
			"cons": "The transparency can be too much sometimes. It was a bit too much for me on some levels. Not sure if the culture has changed now. I don't think the culture is sustainable.",
			"resignation reason": "Too much management, work-life balance could be better, office politics leading to losing talent",
			"authorInfo": "Verified User Former Employee  0*********  User Operations Specialist - May 28, 2020"
		},
		"487": {
			"rating": "4.0",
			"desc": "Passionate, driven, hopeful",
			"pros": "Everyone's been pretty welcoming and helpful when I need it. It's flattering to be a part of a great group of people here. You'll be given responsibility so you have to get a handle on it.",
			"cons": "Work and life balance isn't the best. It can get really intense sometimes. Managers might have a certain level of expectations that you have to work at.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*******  Software Engineer - May 25, 2020"
		},
		"488": {
			"rating": "4.0",
			"desc": "You learn a lot here",
			"pros": "There are some of the smartest people I've worked with. I learned so much from them and have grown. Very happy about this if I choose to move to another company, I have a new level of confidence.Opportunity to make real impact.",
			"cons": "Sometimes there's a lack of structure. General inexperience in some leadership positions but this has gotten much better recently.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  7****  Software Engineer - May 25, 2020"
		},
		"489": {
			"rating": "5.0",
			"desc": "Highlight of my career",
			"pros": "Amazing team. Very high hiring standards here. The people they bring on are very intelligent and driven. It motivates me to go to work with these people everyday.This is the most financially rewarding position I've been in up until now. Financial incentives are definitely and important factor. ",
			"cons": "You have to be hands-on and self disciplined to do a good job here. Work life balance is difficult but doable.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*******  Software Engineer - May 25, 2020"
		},
		"490": {
			"rating": "4.0",
			"desc": "Company has grown immensely",
			"pros": "It's a great product and fun to work on. We've achieved amazing growth and I'm looking forward to see where it goes from here. Good pay and benefits.",
			"cons": "Super stressful to work here. I've felt burned out multiple times in the past. Can get political.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*********  Senior Software Engineer - May 25, 2020"
		},
		"491": {
			"rating": "4.0",
			"desc": "Challenging, you'll be rewarded if you're driven",
			"pros": "Hard working, incredibly smart colleagues.Fast-paced environment, dynamic work.Great pay, benefits, and culture.As long as you work hard, you won't have any problems.",
			"cons": "Sometimes unhealthy competition.Anxiety of having to achieve your targets.Pressure to be a top performer.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n******  Recruiter - May 25, 2020"
		},
		"492": {
			"rating": "3.0",
			"desc": "Not a bad place",
			"pros": "Relatively decent benefits. Most people think it's an incredible place to work at. While it is nice, it's not at that high of a level.",
			"cons": "Young leadership, pretty inexperienced, leads to some org problems. Company is growing fast and sometimes can't keep up.Poor work life balance.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n******  Program Manager - May 25, 2020"
		},
		"493": {
			"rating": "3.0",
			"desc": "Fast paced",
			"pros": "Hope you get into a good team. What team your in dictates how you'll spend your time here. ",
			"cons": "If you end up in the bad team, you can expect to stay there for a few years max. Promotions are given based on visibility rather than actual performance.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  3****  Operations Specialist - May 24, 2020"
		},
		"494": {
			"rating": "5.0",
			"desc": "Great first job",
			"pros": "Working with some great people here, I realized I still have a long way to go. Really motivating to be surrounded by driven people. Good benefits and great office. Product is well-positioned and looking forward to see how it grows in the near future.",
			"cons": "I heard it was hectic but that's since calmed down. Burnout is definitely real. It took a few months before I got a handle on things.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m********  Marketing Manager - May 24, 2020"
		},
		"495": {
			"rating": "4.0",
			"desc": "Learn as much as possible and move",
			"pros": "Good benefits and strong comp. Decent stock options. Intelligent coworkers. Constantly changing to keep up with the market. ",
			"cons": "No more unlimited PTO. Management can be toxic. Hard to get good performance reviews unless you suck up to your boss. Expect to get okay performance reviews. Pretty cutthroat culture, competitive peers. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  6*********  Operations Specialist - May 21, 2020"
		},
		"496": {
			"rating": "4.0",
			"desc": "Good place for people who want to grow your career",
			"pros": "Been working here for two years already, and I'm still loving it! The company is constantly growing and seen as successful. The culture is good and pay is ok. You can work along with some amazing people who are intelligent, smart, and ambitious. ",
			"cons": "It would be a great fit for those who are engaged and keep looking for opportunities to grow as the environment is ever-changing. If you are not the one who loves working in the changing and challenging environment, Stripe wouldn't be the best fit for you. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Account Support Manager - May 14, 2020"
		}
	}
}
