{
	"_default": {
		"1": {
			"rating": "3.0",
			"desc": "Great WLB, Permanent wfh, Good care for employees",
			"pros": "Top leadership cares about their employees. Stands for their values. Transparency is the key here.  ",
			"cons": "CSS is a different animal in the whole company. Immediate managers are just working as per their group managers command. No innovation at ground level. Growth in CSS is pain area. You are rated with all possible softskill found in the world. Everything needs confluence page, to prove your work/worth.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  _********  Applications Support Engineer - May 5, 2022"
		},
		"2": {
			"rating": "4.0",
			"desc": "Great work life balance and culture for big tech",
			"pros": "Good WLB, good people, work sometimes can be interesting and has high visibility",
			"cons": "Slow to roll out features ,Growing pain, Management can be tough to deal with",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*****  Software Engineer - May 2, 2022"
		},
		"3": {
			"rating": "4.0",
			"desc": "Good place to chill",
			"pros": "- Great Culture- Great WLB- Great Management- Remote work available ",
			"cons": "- Compensation not as high as other higher tier companies- Promotion leveling not as easy",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j******  Software Engineer I - May 2, 2022"
		},
		"4": {
			"rating": "4.0",
			"desc": "Management can be a miss, great otherwise",
			"pros": "You feel really valued and are treated like a human being. It's clear the company isn't cutting corners when it comes to recognizing and valuing their employees.The company values manifest themselves all the time. From the big company decisions to the small everyday things.",
			"cons": "Management, for me, seems to have a tendency to be uninterested in your career growth. Our L&D department is very ineffective and spends months 'developing' needlessly convoluted processes that only serve to waste your time and get abandoned/ignored weeks after they're released. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S***  Support Engineer - Apr 30, 2022"
		},
		"5": {
			"rating": "4.0",
			"desc": "Great WLB",
			"pros": "- Great WLB in most teams - EQ over IQ- Company values ",
			"cons": "- Not so Great WLB in some teams- Growing pains - Can be slow at times due to multi geo model ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w*****  Software Engineer - Apr 29, 2022"
		},
		"6": {
			"rating": "5.0",
			"desc": "So far work culture is great ",
			"pros": "* Great culture* WLB is great* Management is fine for me",
			"cons": "* Exploration part is more than coding for me till now.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  _***  Software Developer I - Apr 28, 2022"
		},
		"7": {
			"rating": "5.0",
			"desc": "Friendly People, Amazing Culture",
			"pros": "People are friendly and welcoming. All remote work. The benefits are great. The work is interesting and there are opportunities to work on what you want to work on.",
			"cons": "Being promoted beyond P5 seems hard and unlikely. A lot of senior management is filled externally it seems. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P**  Software Engineer - Apr 28, 2022"
		},
		"8": {
			"rating": "5.0",
			"desc": "Employee  focused ",
			"pros": "Most likely dependent on team/manager but in my experience takes employee well-being very seriously. Solid company and benefits. ",
			"cons": "Can be tough coordinating time zones with AUS if you are in the US but they make it work. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*********  Operation Analyst - Apr 28, 2022"
		},
		"9": {
			"rating": "2.0",
			"desc": "Crap job",
			"pros": "Nice people, above average perks and total compensation, remote work",
			"cons": "Bureaucracy, elitism, micromanagement, over-engineering, low staff morale, poor onboarding, no support, don't follow own mission or values or engineering guidelines, hard to get anything useful done",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*****  Software Engineer - Apr 27, 2022"
		},
		"10": {
			"rating": "4.0",
			"desc": "Overall good but could be better",
			"pros": "Open company, no bs. Opportunities to engage with high level stakeholders and atlassian leadership.",
			"cons": "Backend systems need major improvement, limited personnel to support sales and customers ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Sales - Apr 25, 2022"
		},
		"11": {
			"rating": "5.0",
			"desc": "Great place to work",
			"pros": "They treat their employees super well - monthly days off, great compensation and benefits, friendly teammates and managers",
			"cons": "Things are definitely slow paced and not for those who want to work a lot",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Senior Software Engineer - Apr 25, 2022"
		},
		"12": {
			"rating": "4.0",
			"desc": "Great place if you are in the phase of focusing more on culture, quality, work-life balance. ",
			"pros": "- work life balance in abundance - really warm people generally- cross-geo culture- living by Atlassian values ",
			"cons": "- harder to get promotions- career skills and growth may take time- shipping velocity comparatively low- no growth for good mid level managers so they leave. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c**  Product Designer - Apr 24, 2022"
		},
		"13": {
			"rating": "4.0",
			"desc": "Bad management in Enterprise Org",
			"pros": "Work life balance is good.Decent compensation. Good benefits and perks",
			"cons": "Very bad managers in India.My managers takes notes  of my leaves and then ask team to apply leaves on workday.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*****  Software Engineer I - Apr 22, 2022"
		},
		"14": {
			"rating": "4.0",
			"desc": "Great work life balance, mostly really nice people, mediocre compensation, good technical quality",
			"pros": "Great work-life balanceMost people are really niceGood engineering quality",
			"cons": "There are people in upper management who don't care about those below themMediocre compensation",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Software Engineer II - Apr 22, 2022"
		},
		"15": {
			"rating": "4.0",
			"desc": "Great place to settle in for a good chunk of your career",
			"pros": "Common to be happy staying here for several years. Good work-life balance and people actually use the unlimited PTO. People seem to really care about each other. Lots of growth happening in the company. ",
			"cons": "Benefits/salary are good, but not the best compared to bigger companies. Easy to plateau in career growth after a while if you’re not switching teams. Lack of salary transparency. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*****  Software Developer - Apr 20, 2022"
		},
		"16": {
			"rating": "4.0",
			"desc": "Good WLB and long term growth",
			"pros": "- Given the WLB, the pay is good- Since company is still growing at a healthy pace, lot’s of opportunity to grow into roles/advance",
			"cons": "- Engineering excellence could be improved- Lack of enforcement of top-down vision. Individual teams are almost given too much autonomy. Leads to teams over-developing features for their own gain, not the company’s. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*****  Software Engineer - Apr 18, 2022"
		},
		"17": {
			"rating": "5.0",
			"desc": "Great WLB and culture with solid compensation ",
			"pros": "Best company I've worked for. I take tons of time off and the remote first culture and WLB here are unmatched. Compensation isn't tier 1 but it's not bad given everything else. Big potential for growth and good executive management.",
			"cons": "Could give a little stronger compensation to capture more top tier talent ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*******  Software Engineer - Apr 13, 2022"
		},
		"18": {
			"rating": "5.0",
			"desc": "Employee fruendly",
			"pros": "Awesome company to work with.Company is employee friendly. Transperency.",
			"cons": "work-life balance could be better, gettijg promotion is bit challenging",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Support Engineer I - Apr 12, 2022"
		},
		"19": {
			"rating": "4.0",
			"desc": "Great work life balance ",
			"pros": "WLBOpen culturePerks compensationWork from home option available",
			"cons": "Very Slow promo cycleOnly exposure to jira and confluence",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s****  Support Engineer III - Apr 12, 2022"
		},
		"20": {
			"rating": "4.0",
			"desc": "Career best",
			"pros": "It is an experience to work here. Frequent pivots and clear communication keeps things exciting. Made a huge impact on how I will choose companies and rules for the rest of my career",
			"cons": "Not the best pay. With remote work, amazing benefits can’t be used.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*********  Manager, Account Management - Apr 11, 2022"
		},
		"21": {
			"rating": "4.0",
			"desc": "Great manager and team culture",
			"pros": "- Team is very relax, easy going- True remote environment - Outcome measurement rather than hours work, sit in front of computer. People respect each other's time.- There are a hell lot of documentations, some are very well documented but some maybe obsolete or superseded fairly quickly. Dog-fooding to the max across the company in a good way I would say.- Engineers have a lot of opportunities to create cool things.",
			"cons": "- Project is narrow and deep most of the time. One domain could have tenths of teams working in different areas potentially result in dependency issue.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Senior Software Engineer - Apr 10, 2022"
		},
		"22": {
			"rating": "4.0",
			"desc": "Good wlb",
			"pros": "amazing wlb and benefits are good as well as team is good",
			"cons": "growth is sort of slow at this companycompensation is hit or miss ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*********  Software Engineer - Apr 10, 2022"
		},
		"23": {
			"rating": "5.0",
			"desc": "Good work life balance",
			"pros": "Good Work life balanceGood people to learn fromGood compensation",
			"cons": "Quality of Work is lowToo much focus on confluence pages",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s******  Software Development Engineer II - Apr 8, 2022"
		},
		"24": {
			"rating": "4.0",
			"desc": "Good culture and wlb",
			"pros": "Remote friendlyHonest communication relay of leadership level planningFun colleagues",
			"cons": "Products are more well known the companySometimes hard to get things done because people take it too chill",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a********  Program Manager - Apr 7, 2022"
		},
		"25": {
			"rating": "3.0",
			"desc": "Team Dependent",
			"pros": "Tech focusInnovation week and shipit day is goodgood Engineering culture ",
			"cons": "very team dependant. the quality of the management varies between teams and there some managers are not qualified enough to be a manager. People management skills are very poor",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*******  Software Engineer - Apr 5, 2022"
		},
		"26": {
			"rating": "4.0",
			"desc": "Great people and work life balance, pains of being a large company",
			"pros": "- Great people and work life balance- Top tier compensation (in Australia)- No in-office requirement- Internal mobility is strong",
			"cons": "- one of the company values is Open Company No BS, but it's quite hostile to the idea of pay transparency and has explicitly rejected the idea- remote first culture. support for workers who value socialising in person is an afterthought, especially for people who aren't in a city with an office.- large company issues. somewhat luck of the draw as to whether you end up on a team working on an interesting project, and a lot of processes and support are bureaucratic and impersonal.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Software Engineer - Apr 1, 2022"
		},
		"27": {
			"rating": "5.0",
			"desc": "I love working here ",
			"pros": "WLB, best comp I've had, insanely smart coworkers, remote first environment ",
			"cons": "Product direction needs work, kinda feels like a reactionary environment. Obviously people use our products but I don't know about us continuing to growAlso tech debt/legacy but every company has that ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  Software Engineer II - Mar 31, 2022"
		},
		"28": {
			"rating": "5.0",
			"desc": "Great wlb",
			"pros": "The best culture I have ever experienced. Company invests a lot in it’s employees and takes good care of their wlb. ",
			"cons": "Promotions are challenging. There is favoritism on some teams. Lots of new first time managers. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Software Engineer - Mar 31, 2022"
		},
		"29": {
			"rating": "5.0",
			"desc": "Best all round company",
			"pros": "1. Amazing growth opportunity2. Very good culture3. Great WLB",
			"cons": "1. Growth company size is insane.2. Performance review is solely based on manager which can backfire sometimes",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Software Development Engineer - Mar 31, 2022"
		},
		"30": {
			"rating": "5.0",
			"desc": "Great company",
			"pros": "I’m in the product team for Confluence and couldn’t be happier. It has its problems, but it’s all workable and minor.",
			"cons": "Too much freedom makes for a slow design process. Needs a more organized process and decision making strategy. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z***  Content Designer - Mar 30, 2022"
		},
		"31": {
			"rating": "3.0",
			"desc": "You are screwed if you end up in a bad manager",
			"pros": "Work remotelyGood perksNice officeFree foodWLB is Ok",
			"cons": "The base salary is very lowYou are screwed if you end up in a bad managerImpossible to get promotion ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p********  Software Engineer - Mar 29, 2022"
		},
		"32": {
			"rating": "4.0",
			"desc": "Great work life balance but no career growth and low pay ",
			"pros": "Great culture,Great coworkersManagement care about your mental health",
			"cons": "No career growth Had 7 bosses in 2 years and my last boss that I have zero chance getting promoted. I appreciate manager's honesty. Everything is slow. Can't believe this is a SAAS company. We spend more time convincing people and trying to be friends with and you know to to get things done. It's like a frat house sometime",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Program Manager - Mar 29, 2022"
		},
		"33": {
			"rating": "5.0",
			"desc": "No complaints ",
			"pros": "Founder run company with awesome cultureGood WLBCompetitive compensation. RSU grants are greatPeople are brilliant, hard working and very helpful",
			"cons": "Not much. Career growth opportunities are fewer but that’s a problem with most companies",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*****  Senior Data Scientist - Mar 28, 2022"
		},
		"34": {
			"rating": "3.0",
			"desc": "Great work life balance, but that's about it",
			"pros": "Great work life balance, probably best in the industryEmployee benefits and perks are amazing tooRemote first culture shows the company places focus on the employee",
			"cons": "Compensation is lower than other big techLots of short term thinking has led to long term painsOpportunities for ownership and career growth dont seem to be plenty",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J*********  Software Engineer - Mar 28, 2022"
		},
		"35": {
			"rating": "5.0",
			"desc": "Best job I have ever had. ",
			"pros": "Great products and great company culture. The company is winning. ",
			"cons": "Still immature with sales processes and systems. Limitations on enterprise contract options make some deals hard to close. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A*****  Sales - Mar 27, 2022"
		},
		"36": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "- Offers one of the greatest work life balance- focus on quality rather than quantity ",
			"cons": "Working remotely has its own challenges sometimes. Collaboration becomes hard.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Senior Software Engineer - Mar 26, 2022"
		},
		"37": {
			"rating": "5.0",
			"desc": "Great company with..rocket ship",
			"pros": "Great wlb and culture with excellent growth opportunity.  Company is on great trajectory to make ot big",
			"cons": "Below average compensation which is deal breaker for some.Some product has tech debt if you want to work on cutting edge tech",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  9*******  Senior Data Engineer - Mar 24, 2022"
		},
		"38": {
			"rating": "4.0",
			"desc": "pay,wlb,benefits all above average, products uninspiring",
			"pros": "- Pay is fairly competitive, company headed in a good direction- wlb strong- benefits strong- nice balance of QoL dev tooling and deployment speed",
			"cons": "- like other major companies, really team dependent on your manager- neverending tickets- products are old, and slow- promotions are pretty formulaic with not tons of wiggle",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*****  Security Engineer - Mar 24, 2022"
		},
		"39": {
			"rating": "4.0",
			"desc": "The company is good to work overall ",
			"pros": "Good work life balance, employ benefitsRefresher policy is good",
			"cons": "Promotions are tough Compensation could be more competitive compared to market",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Software Engineer - Mar 24, 2022"
		},
		"40": {
			"rating": "5.0",
			"desc": "Great place to work if you are looking for WLB",
			"pros": "- Work life balance- Employee centric company and gives importance to employee's mental health.- Good management",
			"cons": "- Majority of projects have already matured and will be hard to get good work.- Career growth will be slow.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Software Engineer II - Mar 24, 2022"
		},
		"41": {
			"rating": "5.0",
			"desc": "Amazing culture",
			"pros": "I love the behaviour of people hereTech is good",
			"cons": "Pay range can be better Frequency of gifts is reduced recently",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Senior Software Engineer - Mar 23, 2022"
		},
		"42": {
			"rating": "5.0",
			"desc": "Great wlb",
			"pros": "Best company to work for in Australia, good wlb and pay for aus, fully remote",
			"cons": "Fully remote teams can be difficult to work in. Hard to get promoted.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Software Engineer - Mar 22, 2022"
		},
		"43": {
			"rating": "4.0",
			"desc": "good work life balance had a good time there. Learned a lot and career growth is promising ",
			"pros": "Work life balance, compensation very well, good career growth and project.",
			"cons": "sometimes unclear growth depending on project, sometimes very vague project requirements ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j***  Data Analyst - Mar 22, 2022"
		},
		"44": {
			"rating": "4.0",
			"desc": "Good work life balance",
			"pros": "Work-life balance is goodAbove-average compensationGood company culture",
			"cons": "Lack of communication from higher-level managementSudden reorg changes",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Software Developer - Mar 22, 2022"
		},
		"45": {
			"rating": "5.0",
			"desc": "Work life balance is great. 100%remote.",
			"pros": "Managers are very chill.Great Aussie culture.Growing company.Positive vibes. ",
			"cons": "100% remote. Less visibility.Visa sponsor policy not as flexible as other tech firm.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n*****  Marketing Analyst - Mar 19, 2022"
		},
		"46": {
			"rating": "5.0",
			"desc": "Great WLB and remote work",
			"pros": "WLB balance is amazing. Only work past 5pm if I feel like and am interested in the work I’m doing. Remote work has been amazing. I’ll probably never return to office.",
			"cons": "Pay is under market value, but still competitive so it’s not that bad.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c********  Software Developer - Mar 19, 2022"
		},
		"47": {
			"rating": "5.0",
			"desc": "Great work life balance and supportive management",
			"pros": "1. Work life balance2. Opportunity to innovate3. Growth and learnings4. Supportive senior management",
			"cons": "Hierarchy as it is a big company so sometimes decisions take time between orgs",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r********  Staff Engineer/Manager - Mar 18, 2022"
		},
		"48": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "Company has a good overall culture,  Depends on team as well but WLB is also good",
			"cons": "Stocks are going down, 50% decline from last year. But looks like it is the same for other companies as well",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  F*****  Software Engineer - Mar 18, 2022"
		},
		"49": {
			"rating": "4.0",
			"desc": "Good company culture",
			"pros": "- Very open company, transparency from top mgmt. - Growing company, opportunities are there- Being complete remote, quite flexible hours, lots of refresh days- Engineers have lot of freedom and influence",
			"cons": "- It is chaotic and there is always information overload - In my department I see politics in middle mgmt (maybe middle mgmt is like that everywhere ?)- Engineering manager life is very stressful",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*******  Engineering Manager - Mar 17, 2022"
		},
		"50": {
			"rating": "4.0",
			"desc": "Great work from home but no quality work or exciting opportunities",
			"pros": "Great culture Work life balanceBonuses and perksSupportive environment",
			"cons": "No exciting work Growth opportunities extremely team dependent Not clear communications from leadership",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*********  Software Developer - Mar 17, 2022"
		},
		"51": {
			"rating": "4.0",
			"desc": "Great WLB",
			"pros": "Good WLB, unlimited PTO that you can actually useGreat cultureFully remote",
			"cons": "Things move slowly around hereCompensation isn't top tier Work not that exciting",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Software Engineer - Mar 16, 2022"
		},
		"52": {
			"rating": "4.0",
			"desc": "Good culture and balance ",
			"pros": "People are collaborative and friendly. Employees aren’t expected to work around the clock for the most part. ",
			"cons": "Lots of bureaucracy and it takes a while to get things done. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*****  Marketing & Communication Manager - Mar 15, 2022"
		},
		"53": {
			"rating": "5.0",
			"desc": "Best WLB in the market",
			"pros": "work life balanceawesome culture employee friendlyremote friendly perks and compensation industry standard",
			"cons": "Promotion path is unnecessarily convoluted General pain points of working in a company with too many teams.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r******  Software Back End Engineer - Mar 14, 2022"
		},
		"54": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Great people and culture, amazing work life balance, chill management",
			"cons": "Lower TC than competition, compensation cuts if you move out of NYC, SF or Austin",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Software Engineer - Mar 12, 2022"
		},
		"55": {
			"rating": "5.0",
			"desc": "Great work life balance. Compensation provided is lower but they try to balance it with stocks.",
			"pros": "- great company culture- professional people to work with- great benefits",
			"cons": "- compensation is less- growth is slow- Rules are different for India location which feels a bit odd",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*********  Software Developer - Mar 11, 2022"
		},
		"56": {
			"rating": "5.0",
			"desc": "All around rock solid company",
			"pros": "Generally very good management, intelligent teammates, and a trusting supportive environment to work in.",
			"cons": "Compensation is decent, but not top tier for silicon valley company standards.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Software Engineer II - Mar 9, 2022"
		},
		"57": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Can take a lot of vacation no questions askedCompany cares about employees and global issuesRemote friendly",
			"cons": "Compensation isn't just okay for the bay areaCareer growth has been a struggle",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Product Designer - Mar 9, 2022"
		},
		"58": {
			"rating": "5.0",
			"desc": "So far so good. ",
			"pros": "Great benefits especially the medical benefits.  and the people are great. Compensation is overall decent. PTO is encouraged",
			"cons": "Not a lot of discussion about growth. Don’t see too many promotions happening. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*****  Data Scientist - Mar 8, 2022"
		},
		"59": {
			"rating": "5.0",
			"desc": "Great culture",
			"pros": "Wlb, culture, ppl, remote first, flexibility. Cant rly ask for more.",
			"cons": "Onbaording is a bit difficult being fully remote. More docs arnd how things work cud help",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Software Engineer - Mar 8, 2022"
		},
		"60": {
			"rating": "3.0",
			"desc": "Very less ownership and opportunity to work on new stuff",
			"pros": "Benefits and company culture is good. Wlb may slightly depend on team but is good overall.",
			"cons": "Very less ownership and promotions are difficult in my team. Can't work on new stuff",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  _********  Software Engineer - Mar 7, 2022"
		},
		"61": {
			"rating": "5.0",
			"desc": "Great WLB",
			"pros": "Good perksOkay total compGood cultureStock growth is insane",
			"cons": "Mid management nahReorg every yearBar is dropping to get more hires",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Software Engineer - Mar 5, 2022"
		},
		"62": {
			"rating": "5.0",
			"desc": "The best there is to offer",
			"pros": "A lot of focus on values. Flexibility with work-life balance. ",
			"cons": "Some people don't work hard and are just dead weight, and the company is hesitant to let them go. Which makes it hard for other people to stay motivated",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Software Engineer - Mar 5, 2022"
		},
		"63": {
			"rating": "3.0",
			"desc": "Good work life balance. Period.",
			"pros": "If you want to have a relaxed life, this is the place.",
			"cons": "If you want to make money, skip this one! Meagre hikes, rule forcing less excellent ratings across teams.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b****  Engineering Manager - Mar 3, 2022"
		},
		"64": {
			"rating": "5.0",
			"desc": "Great culture, work life balance",
			"pros": "Great culture, work life balance, good compensation and lot of benefits",
			"cons": "Nothing to say. Started my own venture, other than that I don't any reason to leave Atlassian",
			"resignation reason": "Started my own venture, other than that I don't any reason to leave Atlassian",
			"authorInfo": "Verified User Former Employee  u*****  Staff Software Engineer - Mar 2, 2022"
		},
		"65": {
			"rating": "5.0",
			"desc": "Great culture",
			"pros": "Culture, WLB, interesting business model, really solid and passionate founders ",
			"cons": "Some ppl take advantage of the WLB and contributes the bare minimum ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Engineering Manager - Feb 28, 2022"
		},
		"66": {
			"rating": "5.0",
			"desc": "Great work life balance ",
			"pros": "Kind people, great benefits, flexible work from home work life balance. ",
			"cons": "Rigid processes, isolation during remote work from home, onboarding experience. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*****  Marketing Manager I - Feb 28, 2022"
		},
		"67": {
			"rating": "3.0",
			"desc": "Good work life balance ",
			"pros": "Work life balance , benefits , total remote, stock growth ",
			"cons": "Poor career growth , old tech stack . . .",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Software Engineer - Feb 28, 2022"
		},
		"68": {
			"rating": "2.0",
			"desc": "Bad managers",
			"pros": "At the top level the efforts are good and the founders are very considerate. ",
			"cons": "Middle and entry level managers dont live up to the culture. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Senior Software Developer - Feb 25, 2022"
		},
		"69": {
			"rating": "3.0",
			"desc": "Great work life balance",
			"pros": "Work life balance true to values has business success despite aging tech",
			"cons": "Australia hegemony, doesnt actually practice teaming despite the brand, very little career growth support, crippling technical debt",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o****  Program Manager - Feb 14, 2022"
		},
		"70": {
			"rating": "4.0",
			"desc": "Surface vs. Substance Unclear",
			"pros": "Lots of bonus days off to deal with burnout, great benefits",
			"cons": "Team velocity at odds with burnout days given to team, appropriate WLB is confusing",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j********  Data Engineer - Feb 14, 2022"
		},
		"71": {
			"rating": "4.0",
			"desc": "Not  bad",
			"pros": "Laid back and lots of documentation, no set work hours and everyone expects you to live life and then work",
			"cons": "Not a lot of drive to move things forward, everything goes at a slow walking pace",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S*****  Senior Marketing Analyst - Feb 14, 2022"
		},
		"72": {
			"rating": "5.0",
			"desc": "Great WLB",
			"pros": "Atlassian has great WLB. Management is okay and they think about the employees. Refresh days are great.",
			"cons": "Works wise okayish and few things like career growth etc. depend on the team.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*******  Software Development Engineer II - Feb 13, 2022"
		},
		"73": {
			"rating": "4.0",
			"desc": "Laid back culture, Remote first company",
			"pros": "Values are taken seriously, people routinely quote them when making decisionsChoose to WFH or from officeLaid back culture, good team work and colleagues",
			"cons": "Since remote first, minimal in person team gatherings can be isolatingSalary raises do not keep up with the marketSome degradation in the positive, supportive culture from fast expansion",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*******  Software Engineer - Feb 12, 2022"
		},
		"74": {
			"rating": "4.0",
			"desc": "Amazing culture and great WLB",
			"pros": "Atlassian culture is impeccable. We really do treat people right here and I believe that is largely due to the founders & co-CEO’s ensuring the company is driven that way. ",
			"cons": "-Pay could be better, sometimes lags far below competitive -  A bit of mental gymnastics justifying cost of labor approach to salaries in remote hiring. I.e. The best talent can come from anywhere but we are only going to pay them what the market rate for hiring their replacement in the same geo would be",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*****  Software Engineer - Feb 12, 2022"
		},
		"75": {
			"rating": "4.0",
			"desc": "It's Ok...",
			"pros": "Decent appraisal Increment.Smart individuals to interact with.Great focus on CSR. Helping NGO's focusing on Environment, education, health etc",
			"cons": " Flawed promotion criteria. Multiple reorgs happening without taking feedback. one way /top to bottom communication. Leadership not having a clear vision. High attrition rates in some teams. Culture is largely driven by the teams(some are having fun while others are burning the midnight oil).  ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Software Developer II - Feb 12, 2022"
		},
		"76": {
			"rating": "5.0",
			"desc": "Good Company for New Grads",
			"pros": "- Interesting and modern tech stack- Supportive and friendly teammates- Great WLB ",
			"cons": "- Compensation is too focused on RSU (base should be higher)- Time zone differences ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*******  Software Engineer - Feb 11, 2022"
		},
		"77": {
			"rating": "5.0",
			"desc": "Do work for retirement ",
			"pros": "Pretty good cultureWlb is very goodSalary is also good",
			"cons": "Promo could be sometimes difficult because of management . Sometimes you can be out of work",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Software Applications Engineer II - Feb 8, 2022"
		},
		"78": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Good people, great work life balance, decent comp, unlimited pto ",
			"cons": "Compensation is below the top notch companies. Founders are generally pretty liberal but that’s tech for ya",
			"resignation reason": "There’s too much process, techops and meetings that get in the way of real work",
			"authorInfo": "Verified User Former Employee  O*****  Mobile Developer - Feb 7, 2022"
		},
		"79": {
			"rating": "4.0",
			"desc": "Great culture, Great work/life, Good Comp",
			"pros": "The open-minded hiring process allowed me to move into a role using a tech stack completely unfamiliar to me, which gave me the change to learn and grow. The comp is solid, but differs regionally and the regional boundaries don't make much sense. The culture is fantastic; people practice what they preach. Management is like any large company - you see .01% of it in detail and it's a gamble who you get. Generally speaking, management seems hands off and subordinates are very empowered to change things. I have not experienced any issues with top-down leadership. Remote-first allows you to work outside your home office location for 90 days in a rolling 365.",
			"cons": "The only cons I've had are things you will experience anywhere:- More money is always nice- Products have been around a while, so there's legacy code around.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Junior Software Engineer - Feb 7, 2022"
		},
		"80": {
			"rating": "5.0",
			"desc": "Pretty good overall",
			"pros": "People are generally nice and actually live out company values, WLB is good ",
			"cons": "Company is growing and it seems to be adding more and more middle management ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*****  Software Engineer - Feb 6, 2022"
		},
		"81": {
			"rating": "4.0",
			"desc": "So far so good",
			"pros": "Good benefitsWork life balance Unlimited PTO that people actually use ",
			"cons": "Pay is not top tier for tech companies Too political sometimes",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y*****  Senior Data Engineer - Feb 3, 2022"
		},
		"82": {
			"rating": "5.0",
			"desc": "Great place to work",
			"pros": "Great culture, great people, sound management , good wlb overall ",
			"cons": "wlb may not be the best for managers, some practices feel amateur",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k***  Technical Support Manager - Feb 3, 2022"
		},
		"83": {
			"rating": "3.0",
			"desc": "Great culture but too much people movement ",
			"pros": "Culture is great. Team mates good. Compensation and benefits are good. Many many events. ",
			"cons": "Local leadership not good. Work life balance not good. Too much expectation. Average stay in company 2 years. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Engineer II - Feb 1, 2022"
		},
		"84": {
			"rating": "4.0",
			"desc": "Good company for people looking for Work Life Balance.",
			"pros": "- Good Work Life Balance in the company. You can make time for yourself. And this is the best selling point of the company. - Good responsibilities.- Employees are treated well. They have a very good WPE Work place experience team.- Perks and Benefits.",
			"cons": "I think compensation. It might be not good compared to industry's standards. Slightly lower than that.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  D*****  Software Engineer - Feb 1, 2022"
		},
		"85": {
			"rating": "4.0",
			"desc": "Good work life balance",
			"pros": "- good work life balance- compensation is not the best compared to FAANG, but its above average- Good company culture",
			"cons": "- Career growth after reaching P5 (Senior Engineer) is hard",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  Senior Software Engineer - Jan 29, 2022"
		},
		"86": {
			"rating": "5.0",
			"desc": "Great WLB",
			"pros": "Great maternity leave policy for both parents. Good insurance too",
			"cons": "If you are not in a core engineering team, you might not write much code",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*****  Software Engineer - Jan 28, 2022"
		},
		"87": {
			"rating": "4.0",
			"desc": "Great benefits, way too many expectations around extra curricular work",
			"pros": "Smart people, incredible professional growth (skill set not promotion), good pay, great benefits, challenging products",
			"cons": "Unrealistic expectations of balancing craft vs values vs participating in team activities. Too many meetings. Overall too many expectations outside of being good at your job that cause burnout. Not great at getting to the root of team dynamics. They have a lot of plays but little sustainability in strategizing how to resolve the Dynamics. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w*****  Senior Product Designer - Jan 24, 2022"
		},
		"88": {
			"rating": "5.0",
			"desc": "Great product and work life balance",
			"pros": "Work life balanceDiverse cultureGlobally presentPay and team activities",
			"cons": "Since it is globally present from US to Australia, sometimes you'll have to attend meetings at night.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  M*********  Data Analyst - Jan 24, 2022"
		},
		"89": {
			"rating": "4.0",
			"desc": "Great WLB",
			"pros": "- Great WLB- Unlimited PTO (taking PTO is heavily encouraged by management)- Leadership still takes values seriously when making big changes",
			"cons": "- Pay is slightly lower than some other big tech",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Software Engineer - Jan 24, 2022"
		},
		"90": {
			"rating": "4.0",
			"desc": "good perks but getting political now",
			"pros": "company provides lot of good perks and benefits but things are getting political in mid level management. ",
			"cons": "technologically, company is still lagging behind a bit. very difficult to get promoted. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m****  Systems Software Developer II - Jan 22, 2022"
		},
		"91": {
			"rating": "5.0",
			"desc": "Amazing place to work, strong senior leadership",
			"pros": "- Amazing senior leadership with a vision and ability to execute- Good WLB, especially now that the company has gone remote- Great culture. People and results focused, which is rare.",
			"cons": "- Certain teams are better than others.- Some first time managers still figuring it out.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*****  Product Manager - Jan 22, 2022"
		},
		"92": {
			"rating": "5.0",
			"desc": "Great founders, great culture, great people",
			"pros": "Decent compDecent WLBThey genuinely think about employeesDon’t ship unless 100% confident It’s all about teams ",
			"cons": "Work is relentless. Features are being continuously shipped. Not much innovation. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Designer - Jan 19, 2022"
		},
		"93": {
			"rating": "3.0",
			"desc": "Great company and good work life balance ",
			"pros": "Founders think long term - invest heavily in R&D and want to become a multi product company ",
			"cons": "Becoming too big and political Compensation is good for M6 and above",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t******  Online Strategy and Analytics Manager - Jan 16, 2022"
		},
		"94": {
			"rating": "4.0",
			"desc": "Good work life balance",
			"pros": "good work life balance, hires good people, salary is ok",
			"cons": "expanded too fast last year. A lot of younger grads as compared to experienced folks",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Software Engineer - Jan 16, 2022"
		},
		"95": {
			"rating": "4.0",
			"desc": "Great balance and care",
			"pros": "Work life balanceCompensation is median , reorgs are a lot so projects may go away",
			"cons": "Poor managementReorgs are a lot , so projects may go away",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y*****  Software Developer I - Jan 16, 2022"
		},
		"96": {
			"rating": "5.0",
			"desc": "Friendly coworkers, lots to learn",
			"pros": "- TEAM mentality is pervasive throughout the company and culture",
			"cons": "- onboarding is team specific, and in my experience it has been up to the individual to take it into their own hands ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Software Engineer - Jan 14, 2022"
		},
		"97": {
			"rating": "5.0",
			"desc": "Has become a large enterprise company",
			"pros": "People are generally nice to each other. Most try to follow company  values.",
			"cons": "Has become a large company very fast. New leaders come from companies like Cisco and have brought their culture along with them.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k******  Program Manager - Jan 14, 2022"
		},
		"98": {
			"rating": "4.0",
			"desc": "Becoming a slow giant",
			"pros": "Good covid leave and other vacation policies. usually able to get free recharge days. ",
			"cons": "With the push towards a remote first company, free lunches have stopped. Meeting new people which is especially important at a younger age has become harder and quite a few are struggling with the isolation. Developer loop has become horrendously slow with large under investment in the developer experience, resulting in a very low satisfaction rate among developers. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Software Development Engineer - Jan 14, 2022"
		},
		"99": {
			"rating": "5.0",
			"desc": "Wow amazing people",
			"pros": "People are greatCulture is awesomeFrequent perksNo question on leavesEnough leavesWork like balanceYou will just love the company",
			"cons": "Slow career growthWork sometimes not that excitingLaid back",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*****  Software Engineer III - Jan 14, 2022"
		},
		"100": {
			"rating": "4.0",
			"desc": "Great Culture",
			"pros": "Great culture and values with in the company. High growth Prospectus.",
			"cons": "Work life balance can get tricky at sometimes. Working with multiple geographies can be painful",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Senior Software Engineer - Jan 13, 2022"
		},
		"101": {
			"rating": "5.0",
			"desc": "Great Work Life Balance!",
			"pros": "Pros: Great WLB, no pips, work remote almost anywhere you want.",
			"cons": "Cons: Hard to grow career aka promotion, lower compensation than FAANG.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Software Engineer - Jan 11, 2022"
		},
		"102": {
			"rating": "5.0",
			"desc": "Overall great",
			"pros": "Great company culture, compensation is good, supportive coworkers, work life balance, coworkers with high EQ, smart coworkers",
			"cons": "Monolith is a pain to work on, projects are boring at times, on-call rotation, sometimes feels like being part of a cog in a machine",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a********  Full Stack Software Engineer - Jan 10, 2022"
		},
		"103": {
			"rating": "5.0",
			"desc": "Great culture and supportive environment. Pretty open and growing company.",
			"pros": "Work life balance, and caring company. Open for ideas and promoting diversity!",
			"cons": "Compensation doesn’t seem to be at the top level. Comp cycle used to be twice but now it’s only once.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Software Engineer - Jan 7, 2022"
		},
		"104": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Great people and culture. Good benefits and stock compensation. Good problems to work on. ",
			"cons": "Career growth can be slow. Although salary has been great. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Senior Data Scientist - Jan 7, 2022"
		},
		"105": {
			"rating": "4.0",
			"desc": "Very remote friendly. Good culture and people tend to collaborate a lot",
			"pros": "Great place for remote work. Good WLB with most managers. Lots of good internal documentation. ",
			"cons": "Too many meetings discussing minute details. Relatively slow pace of development. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*******  Software Engineer - Jan 6, 2022"
		},
		"106": {
			"rating": "4.0",
			"desc": "Decent overall",
			"pros": "Good people and highly used products. Wlb can be good",
			"cons": "Career growth is difficult and promotions are hard to attain",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Produce Manager - Jan 5, 2022"
		},
		"107": {
			"rating": "4.0",
			"desc": "great work life balance. no one pings you after work hours. team mates are nice and supportive",
			"pros": "great work life balance. no one pings you after work hours. team mates are nice and supportive",
			"cons": "promotion is not fast, yeah that is it oh yes",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S*****  Software Engineer - Jan 3, 2022"
		},
		"108": {
			"rating": "4.0",
			"desc": "Good place for getting settled! ",
			"pros": "1. Work-Life Balance is great. You get time to do your thing. 2. People here are great. They follow the Atlassian values strictly. 3. Good amount of leaves and perks. 4. Timely hackathons and SHIPITs to work on that awesome project that you been carving the time for. 5. Has one of the best Workplace Experience Teams. They care for the employees a lot and the goodies and the presents that Atlassian sends to their employees makes them feel really special. ",
			"cons": "1. Lack of Challenging Work. 2. Compensation can be a bit better. I can name a lot of companies that provide better compensation than Atlassian. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Software Engineer II - Jan 2, 2022"
		},
		"109": {
			"rating": "5.0",
			"desc": "Best place I’ve ever worked ",
			"pros": "There is fantastic work/life balance. Excellent leaders, especially the CEOs. Highly recommend working for Atlassian! ",
			"cons": "There are some growing pains as we grow extremely quickly. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*****  Engineering Manager - Dec 29, 2021"
		},
		"110": {
			"rating": "5.0",
			"desc": "Great all round",
			"pros": "- Great culture, founders are genuinely good people- Hire well balanced people; teams focus on solving tech and product challenges rather than mired in people or performance issues- Pay is reasonable, RSUs and refreshers pair well with healthy stock growth (so far)- Plenty of interesting work, products generally aim to make work better for people (not the worst mission statement)",
			"cons": "- Promos can be more arduous than necessary- Rapidly growing, some significant pain points metastasizing beneath the surface- Difficult for anyone who is not first and foremost a team player - you will plateau quickly if you don't want to work very collaboratively",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*******  Engineering Manager - Dec 29, 2021"
		},
		"111": {
			"rating": "5.0",
			"desc": "Sucks at work life balance",
			"pros": "Provides good Compensation and benefitsGives RSUsWork cultureManagement",
			"cons": "Work gets hecticOne doesn't get enough time for career growthDays just fly away in the work",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Senior Support Engineer - Dec 27, 2021"
		},
		"112": {
			"rating": "5.0",
			"desc": "Great WLB as an intern, very supportive managers and teammates",
			"pros": "Great work life balance, very instructional, decent compensation, welcoming environment",
			"cons": "Zones vary heavily in terms of compensation, promotion requirements not as clear",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j******  Software Engineer - Dec 27, 2021"
		},
		"113": {
			"rating": "5.0",
			"desc": "People are passionate and leaders care about you ",
			"pros": "Atlassian has good work life balance, the people are smart and passionate, ability to have a life outside of work, leaders care about you. You can utilize unlimited PTO provided you get your work done. A lot of opportunity to grow and get promo within the company. Decent high compensation with good stock growth.",
			"cons": "Base pay isn’t as high as some companies in the bay ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s***  Software Engineer II - Dec 27, 2021"
		},
		"114": {
			"rating": "5.0",
			"desc": "Work culture is amazing",
			"pros": "The legendary Atlassian culture is well recognised for a reason. There is a strong emphasis from leadership on maintaining and improving the culture of the place.",
			"cons": "Lots of new starters since it's a high growth organisation. Can sometimes cause growing pains with processes struggling to keep up etc.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  E*****  Engineer - Dec 25, 2021"
		},
		"115": {
			"rating": "4.0",
			"desc": "Pretty great but not as good as before",
			"pros": "Decent pay (for aus)Great WLBBenefits such as COVID WFH allowanceWell known",
			"cons": "Team Anywhere is changing the culture, better for senior engineers but worse for grads",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l****  Software Engineer - Dec 24, 2021"
		},
		"116": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "Great WLB, growth, and benefits. Awesome company culture, highly recommend!",
			"cons": "I can't really think of any cons with the company.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s********  Data Scientist - Dec 22, 2021"
		},
		"117": {
			"rating": "4.0",
			"desc": "A decent place for work",
			"pros": "Awesome culture, Work Life balance, Rising stocks, Good leave policy",
			"cons": "Less growth opportunities, Hierarchy driven and no parity between talents globally",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s********  Senior Software Engineer - Dec 21, 2021"
		},
		"118": {
			"rating": "5.0",
			"desc": "Awesome place to work",
			"pros": "Company cultureEveryone's willing to helpWork is recognised and rewardedGreat work-life balanceAwesome colleagues",
			"cons": "None that I can think of right now. The people, place and culture are good.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t********  Software Developer II - Dec 19, 2021"
		},
		"119": {
			"rating": "5.0",
			"desc": "Great place ",
			"pros": "Nice wlb good perks great benefits would recommend to anyone. ",
			"cons": "Scope is small you may or may not be learning a lot. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*********  Software Engineer - Dec 18, 2021"
		},
		"120": {
			"rating": "4.0",
			"desc": "Great wlb very slow growth good place for lazy bumps ",
			"pros": "Wlb, opportunity to work on whatever you want technology wise",
			"cons": "Too slow for my liking. Not too many people to have technical discussions ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*********  Lead Software Developer - Dec 17, 2021"
		},
		"121": {
			"rating": "4.0",
			"desc": "Good WLB ",
			"pros": "Work life balance is goodManagement seems to be caring",
			"cons": "There are 5 company values which seems super good practically. These values are appreciated in most of the company. However some of the orgs do not seem to don't care about their employees. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*****  Software Engineer - Dec 17, 2021"
		},
		"122": {
			"rating": "5.0",
			"desc": "So far so good",
			"pros": "Incredible WLB, culture, pay, and benefits.  Just joined so still need time to assess. Blind is making me fill this out a month after joining. ",
			"cons": "Fully remote with a global team is weird but you get used to it",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*******  Senior Data Scientist - Dec 17, 2021"
		},
		"123": {
			"rating": "5.0",
			"desc": "Great place for parents ",
			"pros": "- great work life balance - leadership encourages team to frequent time off specially in Pandemic - people first company , so lot of empathy ",
			"cons": "- Sometimes you feel like its too slow specially if you worked for other BayArea companies- comps are not super exciting US geo ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Product Manager - Dec 15, 2021"
		},
		"124": {
			"rating": "2.0",
			"desc": "Perfect place to be lazy",
			"pros": "Very good work-life balance: all the possible ways to take a leave and maternity leave is very generousDoesn't require a lot of technical knowledge to fit inIf you like being lazy at your job and mostly spend time in various ways to be distracted from work (e.g. 1-1, standups, retros and other team rituals, reading unrelated confluence pages and dozens of slack channels) - Atlassian is the perfect place for you",
			"cons": "Zero career development for technical track in the process. Current career ladder only allows you to grow into a manager or an IC who in practice has manager's responsibilities (you can't go in-depth)Company's culture is nice on paper, but is far off track in real life, e.g. open company, no bull&*t but you can't talk openly about project X and Y because **insert the reason**. Current management doesn't care about culture and assumes it can be fixed with town halls/confidence pages/YouTube videos/Zoom calls.Attrition levels are within normal so when your highly knowledgeable colleague resigns - noone is surprised.Not an engineering company, so don't expect people to pay attention to stuff like performance optimisations, resource usage optimisations or anything like that. If it works - great job.No understanding of SDLC: if something is done as ShipIt project then it obviously is ready to be a dependency for any production system in the company. And no, it doesn't need constant investment in maintaining and support.Lack of investment into tooling especially its own products: Bitbucket is years behind its competitors, but the company is too proud to switch to something else that targets the company of Atlassian size as a customer.Large political plays that rival DnD: they distract your manager and his manager from unblocking you to do your job",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  E*******  Principal Software Engineer - Dec 14, 2021"
		},
		"125": {
			"rating": "4.0",
			"desc": "Great place to learn and grow ",
			"pros": "Vast knowledge sharing within companySupportive environment and healthy culture",
			"cons": "Compensation might not be as competitive as top tier industry peers ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c****  Data Engineer - Dec 13, 2021"
		},
		"126": {
			"rating": "4.0",
			"desc": "Great WLB, less scope of growth",
			"pros": "Great Work life balanceCompany values are excellentPerks are good but average",
			"cons": "There is not much scope for career growth, negotiate higher payouts before joining.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Senior Engineer - Dec 12, 2021"
		},
		"127": {
			"rating": "4.0",
			"desc": "Great company to grow",
			"pros": "Good shares Choose ur work styleGood team with lot of bright minds ",
			"cons": "Culture is corrupted Zero WLBIT is ruined and lost its agility",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Senior Product Manager I - Dec 8, 2021"
		},
		"128": {
			"rating": "5.0",
			"desc": "The Happy Place",
			"pros": "Amazing company that values customers and employees first. Great perks, culture and super smart people to work with. ",
			"cons": "Nothing i can think of. Maybe the documentation part on Confluence 😅 Good for transparency but easy to get lost too. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  F*****  Senior Product Designer - Dec 6, 2021"
		},
		"129": {
			"rating": "5.0",
			"desc": "Great Company and Excellent WLB",
			"pros": "- Great WLB- Good perks and culture (aus)- Collaborative teams- Remote",
			"cons": "- A lot of meetings- Slow pace- Promotion paths seem difficult",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Senior Software Engineer - Dec 4, 2021"
		},
		"130": {
			"rating": "5.0",
			"desc": "The founders care",
			"pros": "The big difference I see with Atlassian is that Mike and Scott care deeply about the people in the organisation as well as what the company is trying to achieve. This has set a really positive culture and for the most part works according to its values. ",
			"cons": "The company has grown a lot in the last few years as such we have added thousands of people. Most of the time new people fit in with the culture quickly and well. However there is a more noticeable presence of ex Amazon, Microsoft... who can sometimes bring across non atlassian attitudes (bullying, top down, office politics)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b********  Senior Program Manager VI - Dec 2, 2021"
		},
		"131": {
			"rating": "3.0",
			"desc": "Worst WLB in some orgs",
			"pros": "The company is supportive in terms of perks, leaves and benefits",
			"cons": "Most of the time is spent in useless meetings and the Wlb is taking a toll. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*****  Software Engineer II - Nov 30, 2021"
		},
		"132": {
			"rating": "4.0",
			"desc": "Outstanding culture. The ceos care about people and tries to ensure the best treatment of workers from that level down",
			"pros": "Great culture set from executive levelGreat for work life balanceGreat benefitsFollows through with employee engagement surveys to make sure we are okay ",
			"cons": "Silicon Valley (from VP and down through middle management) is riddled with politics, and just not as chill as the rest of the companyMiddle management, especially the first line of managers in Silicon Valley are substandard and micromanagement prone ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Senior Software Back End Engineer - Nov 28, 2021"
		},
		"133": {
			"rating": "5.0",
			"desc": "Excellent WLB and leadership",
			"pros": "They really know how to make an employee feel well taken care of. ‘Create a great place to work, hire great talent, & let them do their thing.’ New technologies, great company reputation, and consistently voted best place to work.",
			"cons": "There is less structure than one would expect; a lot of newly promoted managers, but their hearts are in the right place.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*********  Technical Recruiter - Nov 23, 2021"
		},
		"134": {
			"rating": "5.0",
			"desc": "We celebrate work/life balance",
			"pros": "Rest and vest feeling with sporadic big efforts mixed in ",
			"cons": "A lot of red tape to move up and not the highest comp out there",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Software Engineer - Nov 15, 2021"
		},
		"135": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Good work culture. You can grow if you want to.",
			"cons": "People are very slow paced. You have to be behind people of you want their reviews or inputs.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Software Engineer II - Nov 15, 2021"
		},
		"136": {
			"rating": "5.0",
			"desc": "Great work Life balance",
			"pros": "Best company culture especially during covid: extra days off, additional company holidays, care for mental health and also families...",
			"cons": "People working for promotion may distract you but generally people help each otherIf you need another team to deliver sth for your project it can take long time..",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*********  Engineering Manager - Nov 12, 2021"
		},
		"137": {
			"rating": "5.0",
			"desc": "fantastic culture",
			"pros": "really great culturepeople do really care about our company values",
			"cons": "cash comp can be higher but with share price this year it kind evens out",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Manager Business & Legal Affairs - Nov 11, 2021"
		},
		"138": {
			"rating": "5.0",
			"desc": "Great company",
			"pros": "Work life balance and compensationStrong leadershipGood workNice teams",
			"cons": "Nothing i found so farSometime working on monolith is pain. But its not bad",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Enterprise Developer - Nov 10, 2021"
		},
		"139": {
			"rating": "4.0",
			"desc": "Good WLB, slow pace",
			"pros": "- Good processes- Good Work life balance- Decent compensation and employee friendly policies",
			"cons": "- Things move slow- Promotions are hard to come by",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b****  Product Manager - Nov 8, 2021"
		},
		"140": {
			"rating": "5.0",
			"desc": "Work life balance is phenomenal, if not boring",
			"pros": "Comp is getting pretty good. Super easy place to skate by and rest and vest.",
			"cons": "Can be boring if you don't have other things in life to fill your time with. Product is sometimes sub-par and engineers aren' always the smartest.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  _*********  Senior Software Engineer - Nov 8, 2021"
		},
		"141": {
			"rating": "4.0",
			"desc": "Good company to settle down 😁",
			"pros": "Open company no bullshit motto ✌️Excellent work culture 👍hackathon kind off days are held every quarter 🤩Good work life balance 👌",
			"cons": "Pay is less than industry standard 🤦🏻‍♂️Management is mix of excellent and average individuals 😆",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Senior Engineer - Nov 7, 2021"
		},
		"142": {
			"rating": "5.0",
			"desc": "A great company indeed where you can learn, enjoy and grow.",
			"pros": "- great perks- surrounded by smart and enthusiatic crowd- they'll spoil you with their benefits and swags",
			"cons": "- Moneywise - too much focus on Rsu- Engineering - Can't say for the company as a whole but my team does not have much crazy engg stuff going on.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Software Developer II - Oct 31, 2021"
		},
		"143": {
			"rating": "3.0",
			"desc": "Rest and vest ",
			"pros": "Super chill work, can get anyway with doing very little.",
			"cons": "Rest and vest lifestyle gets boring when you have some aspirations in life.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Software Engineer - Oct 30, 2021"
		},
		"144": {
			"rating": "5.0",
			"desc": "Great work life balance and extremely compassionate management ",
			"pros": "- WFH, random extra days off every month- Stock options, $TEAM is doing great- You learn a lot from really smart peers- work impacts millions of customers - open company culture ",
			"cons": "- getting promoted is hard- not the best in terms of compensation ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k********  Senior Software Developer - Oct 28, 2021"
		},
		"145": {
			"rating": "3.0",
			"desc": "Good WLB, good pay, easy job, kind of boring",
			"pros": "Good WLB, good pay, easy job, friendly coworkers, Low stress",
			"cons": "Work is boring, hard to make an impact, career growth limited",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Data Scientist - Oct 28, 2021"
		},
		"146": {
			"rating": "5.0",
			"desc": "Reason I have stayed for so long",
			"pros": "Have had only awesome managers, good grows, stock is amazing ",
			"cons": "Lots of reorgs can be disruptive, time zone differences can be hard",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a******  Data Scientist - Oct 28, 2021"
		},
		"147": {
			"rating": "5.0",
			"desc": "Great company with good culture and positive outlook ",
			"pros": "Great perks, work life balance and high growth of the company ",
			"cons": "Not that I can think of right now, I’ve been in the company for less than a year, everything’s pretty good so far ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  G*****  Product Analyst - Oct 28, 2021"
		},
		"148": {
			"rating": "5.0",
			"desc": "Awesome culture, great comp and benefits",
			"pros": "The people are  friendly and smart. The company really cares about you as an employee, about important social issues, about transparency. Overall awesome culture. Great pay and fantastic benefits too.",
			"cons": "None so far. We’ll see how the huge hiring surge goes.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J*****  Solutions Engineer - Oct 28, 2021"
		},
		"149": {
			"rating": "1.0",
			"desc": "Horrible arrogant head of different departments",
			"pros": "Work life balanceExtremely poor technical culture. Very little proper technical work. ",
			"cons": "Horrible arrogant micro managing head of departments specially the new orgs. Thinks they are gods and don't know how to talk. ",
			"resignation reason": "It's crap all the way. No good work. Join only if you want to sit n do nothing",
			"authorInfo": "Verified User Former Employee  s******  Senior Engineer - Oct 28, 2021"
		},
		"150": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "Good payDecent work life balanceReally good management they know what they are doing ",
			"cons": "Pay not as good as faangNot many negatives to share",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Software Engineer - Oct 27, 2021"
		},
		"151": {
			"rating": "3.0",
			"desc": "Epic work life balance but nothing much else",
			"pros": "Decent benefits in terms of office amenities, WFH allowances, utility reimbursements for internet and mobile connectivity, generous paternal leave.",
			"cons": "Not fit for high achievers who would like to make an impact. Your work does not speak for itself and it’s very difficult for introverts to survive here. Reorgs happen almost every two months which shuffles too many things around.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*****  Software Engineer - Oct 23, 2021"
		},
		"152": {
			"rating": "4.0",
			"desc": "World class founders, but culture is fading",
			"pros": "Brilliant founders and strong culture that truly encourages collaboration and team work. The customer-first approach is the real deal. ",
			"cons": "The culture is fading, particularly with Australia being physically quarantined from the rest of the company. Massive reorganization hasn’t changed the fact that no other leaders with equal gravitas as the founders in terms of culture carriers or vision for the company. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  Marketing & Communication Manager - Oct 23, 2021"
		},
		"153": {
			"rating": "4.0",
			"desc": "great work life balance, benefits are decent, compensation is ok",
			"pros": "company culture is generally healthy, so work life balance is good! benefits are also good, although they don't always have great support for employees going through long-term medical issues ",
			"cons": "compensation is just ok, the work can get pretty boring",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*********  Software Engineer - Oct 23, 2021"
		},
		"154": {
			"rating": "4.0",
			"desc": "Great WLB",
			"pros": "Competitive compensationExcellent cultureFrequent timeoffsGood vibeGood stock growth",
			"cons": "Domain is limitedSlow career growth sometimesNothing much actually",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S********  Senior Software Developer - Oct 23, 2021"
		},
		"155": {
			"rating": "4.0",
			"desc": "Great place to work, not very good for career growth",
			"pros": "Benefits and good projectsGreat teammatesVery relaxed cultureAwesome stock",
			"cons": "No career growthManagesr are a hit and miss, some are good, some are very horrible",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*********  Software Engineer - Oct 21, 2021"
		},
		"156": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Good culture. Nice perks. Non-toxic environment. Excellent Stock growth. World class internal tooling",
			"cons": "Compensation could be better. Too many meetings. Promos are difficult",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r****  Software Engineer - Oct 20, 2021"
		},
		"157": {
			"rating": "5.0",
			"desc": "Great place to work",
			"pros": "Values driven culture, senior leaders who seek to understand, ability to shape your own growth",
			"cons": "Too much shipping of internal org vs focus on customers and value",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*****  Program Manager - Oct 19, 2021"
		},
		"158": {
			"rating": "4.0",
			"desc": "Management cares about employees ",
			"pros": "Good culture and supportive management. Leadership is constantly trying to make the company better. Great perks and policies",
			"cons": "Company in the growing stage, things change fast. Still, a hybrid between startup and big organization so everything is not figured out yet. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*******  Data Scientist, Analytics - Oct 18, 2021"
		},
		"159": {
			"rating": "5.0",
			"desc": "Great Company w Great Benefits",
			"pros": "Amazing WLB and cultureBest benefits and perms I’ve ever had ",
			"cons": "If your shares drop in price below the grant value in your contract, Atlassian won’t give you more shares to make up for the loss in value like some companies do ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Software Engineer II - Oct 16, 2021"
		},
		"160": {
			"rating": "4.0",
			"desc": "Good place to work at",
			"pros": "open company, so you know everything aroundflexible timeemployee first learning opportunities ",
			"cons": "pay is not upto mark, rest everything looks great ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R********  Software Engineer II - Oct 15, 2021"
		},
		"161": {
			"rating": "3.0",
			"desc": "great work life balance",
			"pros": "good wlb but a lot of people rest and vest because it’s hard to move upfully remote",
			"cons": "a lot of churnhard to move upsalary is not all that competitive",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t********  Software Developer - Oct 13, 2021"
		},
		"162": {
			"rating": "5.0",
			"desc": "Great engineering culture",
			"pros": "Cross Geo team, lots of smart folks to work with",
			"cons": "Base compensation is not top notch in the entire market",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  R&D Developer - Oct 12, 2021"
		},
		"163": {
			"rating": "4.0",
			"desc": "Great and well-respected products and overblown middle management layer",
			"pros": "Products are really awesome and essentially became a standard staple in the industry. ",
			"cons": "There are too many teams doing what one time could be doing. Too many product managers ‘own’ what one or two could be owning. Which results in a very dispersed ownership. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  D****  Product Manager - Oct 10, 2021"
		},
		"164": {
			"rating": "5.0",
			"desc": "Great company and great wlb",
			"pros": "Probably the best company in the industry for wlb.They have recently addressed compensation issues as well.",
			"cons": "Too much focus on d&i means people who dont deserve to be promoted do get promoted and prioritized.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Engineer, Senior Staff - Oct 9, 2021"
		},
		"165": {
			"rating": "1.0",
			"desc": "Not many good opportunities to build your career. Bias work culture.",
			"pros": "Good pay. Relatively not so great pay.Opportunities to learn the domain, tech selection from old timers.",
			"cons": "There is not much trust and responsibilities handed over to colocation. Always judgemental instead of trusting the process and scale teams across collocations.Autonomy is clearly missing. The decisions are top down.Not so good projects for folks ready to take accountability and deliver results.Biased promotion process.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*******  Software Engineer - Oct 2, 2021"
		},
		"166": {
			"rating": "5.0",
			"desc": "Great work life balance ",
			"pros": "Founders still running the company with strong vision to capture large TAM ",
			"cons": "Hiring too many people, becoming political and big pay gaps",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Finance Director - Sep 30, 2021"
		},
		"167": {
			"rating": "5.0",
			"desc": "Great Work Life Balance",
			"pros": "Competitive pay, great culture and really good work life balance",
			"cons": "Not much clarity around career progression. Other than that can’t think of much",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Data Scientist - Sep 27, 2021"
		},
		"168": {
			"rating": "4.0",
			"desc": "Great WLB and good work too",
			"pros": "Great work life balance, work is also great. May be not that great in all the teams but that is the case almost everywhere. OCNB is taken very seriously and management is not afraid to take on uncomfortable questions openly",
			"cons": "Nothing much, may be they can give more salary, that would make this place best in the world",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w*****  Senior Software Back End Engineer - Sep 24, 2021"
		},
		"169": {
			"rating": "5.0",
			"desc": "It’s okay.",
			"pros": "Pretty good about  sticking with the cultural standard a set for the organization.",
			"cons": "Atlassian values aren’t shared by all teams and ymmv will depend on which team you are on.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  M*****  Engineer II - Sep 24, 2021"
		},
		"170": {
			"rating": "4.0",
			"desc": "Amazing WLB/culture ",
			"pros": "CultureWLBComp/benefits are pretty goodStock is going crazy",
			"cons": "Projects are not as interestingGrowth can be very slow past for P5 and above",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u******  Engineer - Sep 23, 2021"
		},
		"171": {
			"rating": "4.0",
			"desc": "Open company, collaborative culture",
			"pros": "* Employees practice company values daily in their day-to-day* Good work-life balance* Management cares about employees* Open company culture (open documents and communications by default)* People are collaborative and helpful, team-oriented and long-term thinking* High-impact work",
			"cons": "* Atlassian needs to be more innovative and take bigger risks when it comes to innovative technologies (AI, crypto, AR/VR) and trends, we tend to circle around the same areas (integrations) when it comes to innovation. There is the new product framework now that encourages new product ideas, but it’s all circling around the same markets as it’s lower risk. Think bigger and take bigger risks. Microsoft is working on facial computing and quantum technology, we’re building tools that is just adjacent to our existing toolsets.* Market compensation is competitive but can be even more competitive. After all, the company is making lots of money and we should be top-rated when it comes to market compensation.* Decision-making can be more decentralised. We’re the builder of agile tools so let’s practice what we preach and give more autonomy/power to the teams closest to the customers. Strategy can be bottoms up or top down.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m********  Product Manager - Sep 23, 2021"
		},
		"172": {
			"rating": "5.0",
			"desc": "Great work life balance and culture",
			"pros": "- Team culture- Work life balance- Family first- Benefits and perks- Min 20 weeks of paid parental leaves- Chill environment",
			"cons": "- Base comp could be higher- Decision changes all the time- Incompetent leaderships in some departments- Limited career growth",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Senior Software Engineer - Sep 22, 2021"
		},
		"173": {
			"rating": "5.0",
			"desc": "Hyper growth company with supportive teams",
			"pros": "There are lots of opportunities for engineers to learn and contribute .  Growth opportunities are plenty if you are focused on making a difference. Atlassian values make it the best company culture to thrive.",
			"cons": "Need to be disciplined to stay focused on consuming right information as there is too much information is shared. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Manager, Software Development - Sep 22, 2021"
		},
		"174": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "Great people around, awesome culture, WLB are the top pros about Atlassian. ",
			"cons": "Stringent growth path is the one that I can only think of. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*******  Software Engineer III - Sep 21, 2021"
		},
		"175": {
			"rating": "5.0",
			"desc": "Great Work life balance",
			"pros": "1. Good WLB2. Good Compensation3. Good Health Insurance4. Generous Paternity leave",
			"cons": "There isn't really any cons that I can think of right at this moment.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*******  Software Engineer - Sep 20, 2021"
		},
		"176": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Package is goodGood work life balance Management is good",
			"cons": "Everything looks good. Don't have any complaints so far. I have recently joined the company",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Senior Data Engineer - Sep 19, 2021"
		},
		"177": {
			"rating": "5.0",
			"desc": "Good place to work",
			"pros": "Right now big push into employees’ wellbeing, great culture and people (loving the values)",
			"cons": "Promotion takes time and effort (but 100% doable), constant team reorganizations, compensation not spectacular ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Z****  Designer - Sep 17, 2021"
		},
		"178": {
			"rating": "4.0",
			"desc": "Good company !!",
			"pros": "Good culture, really good work life balanceGreat team and management",
			"cons": "Sometimes work becomes routine and learning opportunity might not be available for everyone in every team.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Software Engineer - Sep 15, 2021"
		},
		"179": {
			"rating": "4.0",
			"desc": "Decent folks here in Bangalore",
			"pros": "The culture claims are actually true.I have met the most helpful and thoughtful people.The way they run product management is structured and refreshing",
			"cons": "Pace . Too much. Remote onboarding is hard.Teams are super busy.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*********  Principal Product Manager - Sep 15, 2021"
		},
		"180": {
			"rating": "4.0",
			"desc": "one of the best workplace at least in AUS",
			"pros": "WLB is amazingVery relaxing cultureTC isnt bad compare to my previous job",
			"cons": "bit boring sometimesOld stackToo much useless acronyms! just write the whole word down ffs.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*****  Software Engineer - Sep 14, 2021"
		},
		"181": {
			"rating": "5.0",
			"desc": "Great work life balance and good management ",
			"pros": "The work life balance is greatCompany seems to actually care about people People are truly friendly and aren't just pretending to be. ",
			"cons": "It seems promotions can be capped at the Senior level which bothers some people.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*****  Software Engineer - Sep 14, 2021"
		},
		"182": {
			"rating": "5.0",
			"desc": "Some very good projects to work on",
			"pros": "- Extremely employee and customer-centric- Lots of t-shirts- WFH forever-  Perks- Not your typical top-down corporate culture- Good work-life balance",
			"cons": "Not that I can think of as of now ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Software Applications Engineer - Sep 14, 2021"
		},
		"183": {
			"rating": "4.0",
			"desc": "Great company overall",
			"pros": "Atlassian provides opportunities for those who work hard enough for long enough.  Just be careful with the team you are on,  some might not present enough opportunities for everyone and if that's the case you are better off changing teams. Compensation is on par considering stock growth and wlb.",
			"cons": "Some managers might hinder your growth,  don't waste time if you realise that's the case. Move to another team. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A*****  Principal Software Development Engineer - Sep 13, 2021"
		},
		"184": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "Best for work life balance, great company culture, remote 1st",
			"cons": "Very chaotic with many re-orgs, hard to get promoted beyond senior levels",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z****  Senior Product Manager - Sep 13, 2021"
		},
		"185": {
			"rating": "4.0",
			"desc": "Good WLB & okayish career growth opportunities",
			"pros": "Good work life balance, company cares about the people, stock appreciation. ",
			"cons": "Less career growth opportunitiesToo many org changes, Very tedious promotion process",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Engineering Manager - Sep 11, 2021"
		},
		"186": {
			"rating": "4.0",
			"desc": "Great founders & vision",
			"pros": "Great Work life balance Employee oriented policiesGood peer group",
			"cons": "India management especially Jira group is crap. Inefficient managementNo consistency in application of policiesPartiality ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Software Developer II - Sep 11, 2021"
		},
		"187": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "Great work life balance and work culture with good learning curve.",
			"cons": "Nothing as such, couldn't find any cons for the 1 year I spent here.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  Software Engineer - Sep 10, 2021"
		},
		"188": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "1. Work life balance2. Plenty of time off to recharge3. Good Engineering Practices4. Smart colleagues",
			"cons": "1. Sometimes a lot information to catch up to, might drive someone feel overwhelmed",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q******  Software Developer - Sep 10, 2021"
		},
		"189": {
			"rating": "5.0",
			"desc": "Great work life balance ",
			"pros": "Very chill atmosphere. Everyone is very capable so they do not pressure you.",
			"cons": "Would say that it is difficult to see my teams influence on the larger organisation.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Site Reliability Engineer - Sep 8, 2021"
		},
		"190": {
			"rating": "5.0",
			"desc": "Great autonomy",
			"pros": "Lots of trust and autonomy to lead major decisions. Emphasis on taking time off to avoid burnout.",
			"cons": "I have not yet found any cons.for working at Atlassian",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*******  Software Developer - Sep 7, 2021"
		},
		"191": {
			"rating": "5.0",
			"desc": "Love working here!",
			"pros": "Great work life balance, awesome coworkers who help each other when needed, management seems to care and encourages taking time off, great equity growth",
			"cons": "Name recognition is not the best (yet). 401k is only 100% on 4% - I’ve seen better at other companies",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A*****  Senior Business Analyst - Sep 6, 2021"
		},
		"192": {
			"rating": "3.0",
			"desc": "Good for chilling, for learners, not much",
			"pros": "Great work life balanceValues means somethingChill life Good colleagues",
			"cons": "Very slow paceVery poor in decision makingNothing much for learners",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N******  Software Engineer II - Sep 4, 2021"
		},
		"193": {
			"rating": "4.0",
			"desc": "Great company culture",
			"pros": "I've worked in many organizations before and this is the first organization where I see the company values actually being practiced in every aspect. It really helps to work for a company whose values align with yours.",
			"cons": "Projects move a little slowly and that could be frustrating, but it doesn't happen always.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Designer - Sep 2, 2021"
		},
		"194": {
			"rating": "5.0",
			"desc": "Lives it's value",
			"pros": "Work life balance. Employee friendly culture. Great pool of talent",
			"cons": "Some projects are boring and legacy. Single digit hikes which can be a problem for high pay growth seekers",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Software Engineer - Sep 2, 2021"
		},
		"195": {
			"rating": "5.0",
			"desc": "Good company with work life balance ",
			"pros": "Work life balance is good Perks and benefits like wfh setup etc are good",
			"cons": "Salary not upto the market standards. Tech debt heavy too. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  Software Engineer - Sep 1, 2021"
		},
		"196": {
			"rating": "4.0",
			"desc": "Great management. Decent compensation.",
			"pros": "Company is very TransparentVery Good higher managementWork from home option is great.",
			"cons": "Comparatively lower packages.Teams lack bonding. High stressful work sometimes ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*******  Site Reliability Engineer - Aug 30, 2021"
		},
		"197": {
			"rating": "3.0",
			"desc": "Great WLB but no career growth",
			"pros": "- Company has a really good culture. - A very good amounts of leave. specially that 5 months of parental leave.- Overall workload is less.",
			"cons": "- Career growth is harder when you have less oportunities for the next level. Very unclear path for promotion.- Management is still weak. Complex managerial hirrarcy makes things harder and there are internal politics. If you have a manager with a close mind set, situation has become really difficult",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*******  Software Engineer - Aug 30, 2021"
		},
		"198": {
			"rating": "4.0",
			"desc": "Great working experience",
			"pros": "Great wlbExtremely good culture- open company- encourage you to make your own impact- your team covers your backCompany cares their employee very much- many COVID related extra leaves- COVID related perks- always trying to keep you at a good moodGrowing in a good pace",
			"cons": "Not so good technical growth- due to various reasons, you might not get the most technical challenging thing to do- a bit hard to make impactA bit slow on projectFriction on development and delivery- not the best dev experience with monolith- BUT this also means your chance to improve things and make impact ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*****  Software Engineer - Aug 27, 2021"
		},
		"199": {
			"rating": "5.0",
			"desc": "Great company! Highly empathetic towards employees ",
			"pros": "- great work culture - founders are Extremely dedicated towards addressing needs of employees in challenging times ",
			"cons": "- Career growth is extremely challenging - nothing else is big concern really ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  UX Designer - Aug 26, 2021"
		},
		"200": {
			"rating": "5.0",
			"desc": "Really great work life balance and kind people! ",
			"pros": "I’m a new grad at Atlassian and it’s been amazing so far. The culture lives up to the hype and everyone is so humble, kind, supportive. It’s a great place for people starting off their careers (like myself) because there’s a lot to learn (fast paced environment). The benefits are amazing too - healthcare is OP.",
			"cons": "Compensation isn’t the most competitive but it’s okay - I haven’t been here long enough to experience promotions/raises though.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w***  Associate Product Manager - Aug 25, 2021"
		},
		"201": {
			"rating": "5.0",
			"desc": "WLB is good, great culture",
			"pros": "Great culture and wlb. Office life was better, good wfh budget and employer care",
			"cons": "Study support not there. Would have been nice if there was higher study support",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w*****  Software Development Engineer II - Aug 24, 2021"
		},
		"202": {
			"rating": "4.0",
			"desc": "Rocketship company",
			"pros": "Good benefits-Atlassian covers all premiumsDecent RSUs-usually some annual refreshers",
			"cons": "Growing painsWould like to see larger annual increase for employees exceeding expectations",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y*****  HR Associate - Aug 22, 2021"
		},
		"203": {
			"rating": "4.0",
			"desc": "Great company",
			"pros": "Awesome people working at the company doing exciting things, great team culture ",
			"cons": "Pay is a little below market rate but otherwise great place to work and learn!",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Designer - Aug 18, 2021"
		},
		"204": {
			"rating": "4.0",
			"desc": "Good wlb",
			"pros": "Great people and culture, good benefits, remote work forever, pay is decent ",
			"cons": "Work isn’t that interesting, career development lacking, middle management needs training ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  f*****  Product Manager - Aug 17, 2021"
		},
		"205": {
			"rating": "2.0",
			"desc": "Good pay, poor structure and leadership",
			"pros": "Good compensation with well performing stock. Company focused on WLB",
			"cons": "Poor structure and overall lack of direction means lots of whiplash, inefficiencies. Inexperienced management.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*****  Business Operations - Aug 14, 2021"
		},
		"206": {
			"rating": "1.0",
			"desc": "Run away from this place ",
			"pros": "Some benefits like work fromHome allowance, free stuff and  stock doing well ",
			"cons": "Poor leadership Bro culture Toxic culture where people can write horrible comment on blogs and leadership doesn’t take action ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*******  Human Resources - Aug 12, 2021"
		},
		"207": {
			"rating": "5.0",
			"desc": "Cares a lot about employee wellbeing ",
			"pros": "Great leadership, strong vision, great stock performance, and cares about inclusion ",
			"cons": "Can’t think of anything major top of mind. Can’t complain most days. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  Product Manager - Aug 11, 2021"
		},
		"208": {
			"rating": "4.0",
			"desc": "Great culture and WLB, with floaters around",
			"pros": "Work is interesting, people are nice and smart. You will enjoy working here with great freedom the company gives you. If you manage it well, you will feel accomplished and balanced with your life.",
			"cons": "Some floaters around and not putting in the work. Some favoritism within the team. Some legacy code and pain to evolve.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  3******  Software Engineer - Aug 10, 2021"
		},
		"209": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "1. Great work life balance2. Amazing culture!!3. The people here are really supportive",
			"cons": "Not really. it's overall really good. The people are nice. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  UX Designer - Aug 10, 2021"
		},
		"210": {
			"rating": "3.0",
			"desc": "Great company, but make sure you're getting what you're after",
			"pros": "Diversity of work and teams, talented people, great company values, good work/life balance and compensation (mostly as the company is performing well on stock market)",
			"cons": "Unnecessarily complex architecture making everyone's onboarding painful, pitfalls of a company that has grown too fast: hard to make an impact as an IC, artificial performance review (partly due to an overall weak middle-management layer) constraining career growth & leading to a poor retention culture of really good talents.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d********  Senior Software Engineer - Aug 8, 2021"
		},
		"211": {
			"rating": "5.0",
			"desc": "Great culture and wlb",
			"pros": "Friendly culture and teammates. Some cool products being built. Leadership seem competent",
			"cons": "Can be a bit slow. Need to drive your own career",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*****  Software Engineer - Aug 6, 2021"
		},
		"212": {
			"rating": "3.0",
			"desc": "Things starting to go south",
			"pros": "Good compensation, transparency in many company level decisions, good WLB, very good market growth",
			"cons": "No second chances- harsh grading, many abrupt decisions by IT leaders with little empathy for the staff,  degrading culture, tendency to import talent rather than investing within",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  M*****  Engineer - Aug 6, 2021"
		},
		"213": {
			"rating": "4.0",
			"desc": "Awesome place with great people",
			"pros": "Great peopleWork-life balance is top notchPay is decentLots of trust in employees",
			"cons": "Pay is decent but not too competitive Culture solidifying into classical big Corp cultureGlass ceiling for promotion beyond senior (P5)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*********  Senior Software Engineer - Aug 6, 2021"
		},
		"214": {
			"rating": "4.0",
			"desc": "Great WLB, but can be a Little Slow",
			"pros": "Work life balance is great.Pay and benefits are very goodGood, friendly culture.",
			"cons": "A lot of people that are in 'rest and vest' modeHard to make an impact and work is often boring",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g******  Data Scientist - Aug 5, 2021"
		},
		"215": {
			"rating": "4.0",
			"desc": "Pretty chill",
			"pros": "Not very stressfulFully remoteInteresting projects that can be quiet technical and meatyFriendly teammatesInternal mobility",
			"cons": "Can be difficult to get promoted, especially due to managers changing quite frequently ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  D*****  Product Designer - Aug 5, 2021"
		},
		"216": {
			"rating": "5.0",
			"desc": "Great company with outstanding culture!",
			"pros": "Great leadership at the ALG level. Love the focus on openness and collaboration.Work remote forever!!!",
			"cons": "Doesn't pay as well as other tech companiesCan be a bit siloed",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c******  Senior Business Operations Manager - Aug 3, 2021"
		},
		"217": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "Compensation reasonable and the WLB of my current team is extremely good. No one seems to be particularly stressed and people aren't afraid to have their own lives which I very much appreciate. WFH options available. ",
			"cons": "Slight issue with working up in that you have to be on the big impact teams but that is all. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u****  Entry Level Software Developer - Aug 1, 2021"
		},
		"218": {
			"rating": "3.0",
			"desc": "Average company",
			"pros": "Good company to work until you get bored with the work.",
			"cons": "Don't like to attend meetings at the night. Timing issues.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r******  Enterprise Architect - Jul 31, 2021"
		},
		"219": {
			"rating": "5.0",
			"desc": "Growing Pains - but great people and culture",
			"pros": "- Values are a legit part of the work experience. They are embraced and lived. - Adapted quickly to new ways of working and actively addressing how to operate in a distributed, post-pandemic world.",
			"cons": "Seems like a lot of distrust in enterprise wide programs or changes. Atlassians spends a lot of time hiring incredible people. Trust them, let them innovate in product, in engineering, in HR, in IT. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n*****  People Manager - Jul 30, 2021"
		},
		"220": {
			"rating": "4.0",
			"desc": "A good company",
			"pros": "The culture and benefits are good, at least for AU site.",
			"cons": "My org specifically seems to not having a good direction, unclear mission and roadmap.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a********  Engineering Manager - Jul 29, 2021"
		},
		"221": {
			"rating": "5.0",
			"desc": "Great company with good culture and work life balance",
			"pros": "Good stock growth, collaborative and open culture. Good WLB and new teams/projects.",
			"cons": "Lots of bloated middle management. Low TC, most of company growth is baked into stock price.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c********  Software Engineer - Jul 28, 2021"
		},
		"222": {
			"rating": "5.0",
			"desc": "Top notch culture and work life balance",
			"pros": "Work life balance is solid. The people here are fantastic and are quick to help those around them. ",
			"cons": "Pay wasn’t the absolute highest. I had another offer that was higher but I got a better vibe from Atlassian. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Software Engineer - Jul 27, 2021"
		},
		"223": {
			"rating": "2.0",
			"desc": "Work life balance depends on vertical and team",
			"pros": "Offers pretty good benefits and executives seems to care for employees by offering a lot of perks for mental healthAllow flexible work",
			"cons": "Sometimes unclear requirements and work life balance really depends on the team you are on and your manager.Some teams are stuck with new inexperience managers.A lot of parallel works and work pressure.Remote work adds to longer hours.Reduced perks (lunch, snacks, social events) due to remote work.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*****  Software Engineer - Jul 26, 2021"
		},
		"224": {
			"rating": "3.0",
			"desc": "Good culture and WLB but no career growth",
			"pros": "You can keep relatively good WLB here, no need to work overtime every night. Though sometimes when busy time comes you can end up finishing something until late at night. Benefit is not the most generous, but it's not bad. There is learning budget, parental leave (for both woman and man). ",
			"cons": "Very hard to push for career growth with impact. It's possible because of the team I am in, but the company don't thrive in big changes and for some interesting ideas you have to push extremely hard to get other departments onboard. Also even if you perform as excellent rating for more than a year in review, it's possible you don't get promotion due to an absurd excuse in the end. It feels people who gets in company earlier need to get promoted first. ",
			"resignation reason": "Lost trust in Management's emtpy promise of you will be promoted next cycle. Company lack of innovation. ",
			"authorInfo": "Verified User Former Employee  a****  Senior Data Scientist - Jul 25, 2021"
		},
		"225": {
			"rating": "5.0",
			"desc": "Great WLB",
			"pros": "Great culture and good management support with generous budget for person development ",
			"cons": "Not many downsides. Hours are longer since moving towards a wfh team anywhere model",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*****  Finance - Jul 25, 2021"
		},
		"226": {
			"rating": "5.0",
			"desc": "Great company to work for!",
			"pros": "Coworkers are smart and dedicated to solving problems. The company has really treated me well financially as well. I’m indeed doing my best work as an employee. ",
			"cons": "Working remote has been tough. It will be interesting how we figure it out for the years to come. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  K*****  Senior Data Scientist - Jul 23, 2021"
		},
		"227": {
			"rating": "3.0",
			"desc": "Reasonable work life balance, as long as your team is on the same continent",
			"pros": "Good people on the ground, nice perks, becoming more remote friendly",
			"cons": "Management doesn't know what it's doing, career growth isn't a priority, toxic department heads that negatively influence culture",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*******  UX Researcher - Jul 23, 2021"
		},
		"228": {
			"rating": "5.0",
			"desc": "High on values",
			"pros": "Values, culture, work life balance. Little to no politics. Super employee centric",
			"cons": "Career progression slow in management path. Lot of unmaintainable codebase.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*********  Engineering Manager - Jul 22, 2021"
		},
		"229": {
			"rating": "5.0",
			"desc": "WLB ",
			"pros": "Fast career development, at least for me promotions came quickly ",
			"cons": "Products can be a bit meh at times but it’s not deal breaking ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*********  Software Engineer - Jul 21, 2021"
		},
		"230": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Good culture and management Strong growth trajectory Will continue to do well",
			"cons": "More bureaucratic than early daysGood culture diluted with working from home",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  UX Designer - Jul 21, 2021"
		},
		"231": {
			"rating": "2.0",
			"desc": "Decent Work Life balance but way too processy",
			"pros": "Unlimited time off - haven't seen anyone abuse itDecent Work Life BalanceGood for folks who are starting out on their careers - lots of handholding",
			"cons": "It's like wearing a straight jacket. No autonomy. Lots of process - there is a template & a ticket for everythingSevere micromanagementVery hierarchical and in deep denial about itTalks a lot about psychological safety but that's bullshitSenior leaders withhold information as a way to make folks constantly come to them for decisions",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Designer - Jul 19, 2021"
		},
		"232": {
			"rating": "4.0",
			"desc": "Great wlb, decent pay",
			"pros": "Great wlb, decent pay, excellent benefits and employee friendly policies",
			"cons": "Things move very slow at times, promotions are difficult to come by",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*********  Software Development Engineer II - Jul 19, 2021"
		},
		"233": {
			"rating": "5.0",
			"desc": "Great culture with lots of opportunity for growth.",
			"pros": "- Culture is great; WLB is respected.- Benefits/pay are competitive; unlimited PTO.",
			"cons": "- None that I can think of at this time.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*****  Senior Program Manager - Jul 19, 2021"
		},
		"234": {
			"rating": "5.0",
			"desc": "Great culture ",
			"pros": "Very people focused. Great place to have balanced growth. Is set to grow fast",
			"cons": "Those who are used to formal set ups will struggle ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r****  Recruiter - Jul 19, 2021"
		},
		"235": {
			"rating": "5.0",
			"desc": "It’s great",
			"pros": "Compensation, people, culture. I love working here everyone is so wonderful ",
			"cons": "Worklife balance can be tough with such a distributed workforce ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  UX Designer - Jul 18, 2021"
		},
		"236": {
			"rating": "3.0",
			"desc": "Great if you want work life balanxe",
			"pros": "- Work life balance- You can get opportunities to feature lead occasionally.- Collaborative environment",
			"cons": "- Engineering team is still a bit immature.- The effort to reward ratio is messed up.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  _********  Senior Software Back End Engineer - Jul 15, 2021"
		},
		"237": {
			"rating": "5.0",
			"desc": "Great place to work",
			"pros": "Great company with great products Huge customer base Employee driven company Perks are good Company cares for employee",
			"cons": "Low comp Heavy workLots of expectations from management Some crappy people with low mindset coming as a manager in Bangalore ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J*******  Support Engineer, Senior - Jul 11, 2021"
		},
		"238": {
			"rating": "5.0",
			"desc": "Great culture",
			"pros": "Culture is amazing, lots of transparency among upper management, great work life balance, great perks/benefits ",
			"cons": "Career growth isn’t the best (however there is a built out internal transfer process) ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a***  Business & Systems Integration Analyst - Jul 11, 2021"
		},
		"239": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Nice perks and freed food Healthy policies and virtual .",
			"cons": "Slow growth and bad low tier managers . . .",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H****  Safety Director - Jul 7, 2021"
		},
		"240": {
			"rating": "3.0",
			"desc": "Good company with growing pains",
			"pros": "Atlassian takes care of their employees and tries hard to make work enjoyable. Very receptive to change and feedback.",
			"cons": "Too many pages and opinions which make it hard to move forward on small projects. Difficult split between timelines.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*****  Engagement Manager - Jul 6, 2021"
		},
		"241": {
			"rating": "2.0",
			"desc": "Hated it",
			"pros": "Culture, benefits and people are good but that’s about it",
			"cons": "Worst job I have had largely because of my manager.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Data Scientist, Analytics - Jul 5, 2021"
		},
		"242": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Good learning for new hires looking for experienceBest culture in the industryThinks about it's employees",
			"cons": "Not much in-hand compensationYou could get assigned to the team that uses monolith code",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y****  Software Developer - Jul 1, 2021"
		},
		"243": {
			"rating": "4.0",
			"desc": "Decent place to work mid-career",
			"pros": "* Perks are many, and the pay scale matching is generous when switching in from another company.* Everything you can think of likely has already been thought of, which is great but is also sort of a con.",
			"cons": "* Personally I don't think many can have a large impact in this org given the massive surface area and slow processes, lots of people to please and approvals to take* Lot of Project management stuff, unsurprisingly* Wouldn't recommend this place to a fresher since there are way too many layers of abstraction and there's not a lot of core-tech to learn",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Staff Site Reliability Engineer - Jun 29, 2021"
		},
		"244": {
			"rating": "4.0",
			"desc": "Like a group of friends welcoming or not welcoming a new potential friend",
			"pros": "Fun company, good pay, great benefits... seems like most people get rewarded because of relationships vs impact",
			"cons": "Culture varies from org to org, no one really seems to care enough to make a change and  company surveys produce no positive changes",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*****  Support Engineer - Jun 29, 2021"
		},
		"245": {
			"rating": "3.0",
			"desc": "Great people & work life balance",
			"pros": "Great culture/teammates, great benefits and excellent work life balance. Great place to sail along.",
			"cons": "Poor tech, poor engineering culture, below par pay. Great place for beginners, not so good for senior engineers.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Senior Software Engineer - Jun 29, 2021"
		},
		"246": {
			"rating": "4.0",
			"desc": "Not paid enough in Australia",
			"pros": "Stock growth, interesting problems (sometimes) compared to other companies in Australia.",
			"cons": "I don't know why anyone would work here for a long time wearing 5 different hats (ops, project management, etc.) when you can go for 1k / day contracts where you are only responsible for 1-2 things max.Ah, I know. Only one reason - stock growth, but then, you can just go overseas (USA) and get an immediate salary bump without increase in responsibilities.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I********  Software Developer II - Jun 26, 2021"
		},
		"247": {
			"rating": "2.0",
			"desc": "Good worklife balance, good work culture among peers, Extremely poor growth, irritating management, stagnant work",
			"pros": "Work life balance is good, good for people with family who wants to give less time to work and who considers work means only meetings. Work culture among the peers is good, your peers will most of the time try to help you. Several good benefits (not compensation) ",
			"cons": "Growth is stagnant. Most of the time you will be in meeting which apparently go nowhere. You will be creating several confluence pages and design docs pertaining to things which might never see the day of light just to please your manager who will in turn try to please his/her manager with these silly docs. The managers here call themselves leader which is so funny because they dont show any leader like qualitites. All they can do is throw some random fancy ideas at you and ask you to create some pages or ppts. Your manager will have no context of your work and will never try to know as well hence most of his/her work related suggestions will be of know use to you. Most of them almost no technical expertise and those who have leave the company after a year. You will expected to open yout mouth and blabber any random stuff in every forum and meeting to show how innovative you are.  So in short if you like to show off, like to brag about tiny things and write useless docs, posses less to no tech knowledge, like buttering your manager and have all qualities of a non tech guy, this is the place for you, even better you can be a manager here and call yourself a leader. Ps. This observation is for Bangalore specifically, althougu i get similar vibes is the other sites as well but they may be better.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Software Developer - Jun 25, 2021"
		},
		"248": {
			"rating": "4.0",
			"desc": "Decent WLB, Average pay, being at the right team matters",
			"pros": "WLB is good. Company cares about well being of its employees. People are generally amicable and respectful. WFH options are great.",
			"cons": "Average pay for a company with such a high brand value. Some teams are just best to avoid (Commerce). Growing pains and an unstructured/ undefined career path if you're not an Engineer. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*****  Program Director - Jun 24, 2021"
		},
		"249": {
			"rating": "5.0",
			"desc": "Great for culture and personal development ",
			"pros": "Ambitious but empathetic leadership.Strong values that people really care about and help to deliver a good culture.Leadership that’s not afraid to pivot when they learn new things.Most Employees and leaders are passionate about social issues and creating a better world.Transforming into a great cloud company Great, open communication between teams. Strong vision.",
			"cons": "Pay isn’t as competitive as bigger tech companies.They can pivot frequently, which means projects don’t always get finished.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e******  Senior Product Designer - Jun 24, 2021"
		},
		"250": {
			"rating": "4.0",
			"desc": "Great culture but salary is not the best in industry",
			"pros": "Great working culture, good benefits, helpful peers and good work life balance",
			"cons": "Some teams are struck with new inexperienced manager. Bangalore folks don't get a lot of good work.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Software Developer II - Jun 23, 2021"
		},
		"251": {
			"rating": "5.0",
			"desc": "Best company to work for",
			"pros": "1. Best work culture and great perks as compared to any company2. Great code base and architecture to learn3. Employee friendly, career growth and awesome stock options.4. No hurry of deadlines. Building with heart and balance.5. People are really great in values",
			"cons": "Cant find any cons. Everything is smooth and great. Would update in future.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Full Stack Developer - Jun 22, 2021"
		},
		"252": {
			"rating": "4.0",
			"desc": "Good place to work",
			"pros": "leadership really does care and good benefits and comp from an equity perspective ",
			"cons": "hard to have good work life balance due to global time zones ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n*****  Engineer - Jun 21, 2021"
		},
		"253": {
			"rating": "4.0",
			"desc": "Good place to work ",
			"pros": "comp and benefits are good - leadership cares about company ",
			"cons": "work life balance can be hard due to time zones ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n*****  Engineer - Jun 21, 2021"
		},
		"254": {
			"rating": "4.0",
			"desc": "Work life balance is good ",
			"pros": "company culture and work-life balance facilities and perks charity and donations",
			"cons": "growing org growing painssometimes too much work pressure to handle",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J******  Engineer II - Jun 20, 2021"
		},
		"255": {
			"rating": "3.0",
			"desc": "Good company culture, poor management/leadership direction",
			"pros": "The company promotes work-life balance. Engineers are generally nice people. Open and transparent policies. Blameless culture.",
			"cons": "It's not news that Atlassian's compensation is not as competitive compared to other Silicon Valley tech companies. As a result, the new hires, especially ones hired at senior positions, are lower-skilled. There's been a trend of internal promotion from engineer to manager. Unfortunately, there isn't a strict quality control on these new managers. Some teams are stuck with inexperienced new managers, with no way to provide critical feedback on them.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  K*****  Software Engineer - Jun 20, 2021"
		},
		"256": {
			"rating": "3.0",
			"desc": "great for work life balance ",
			"pros": "it’s alright. nothing to complain. as good as any bay area big company. ",
			"cons": "boring stack. self involved product team. we have just been milking jira’s success. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*********  Software Applications Engineer - Jun 17, 2021"
		},
		"257": {
			"rating": "5.0",
			"desc": "A powerful vision, great leadership, growing pains",
			"pros": "* I've worked for the best manager of my career for the past 2 years* I've had multiple growth opportunities, including a promotion and move into a new role (been with Atlassian 2 years)* We are given foundation leave (40 paid hours) and lots of opportunity to have a wider impact in our communities* Benefits are very generous!",
			"cons": "* Non R&D (Eng/Design/Prod) teams are very small, leading to potential for w/l balance challenges* The global team thing is real - and we haven't sorted out how to enable work across timezones* Compensation in Team Anywhere is not terribly competitive, outside of Zone A",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*****  Business Program Manager - Jun 15, 2021"
		},
		"258": {
			"rating": "4.0",
			"desc": "Overall an awesome company, but shitty management",
			"pros": "- Nice perks - covid- Some awesome people- Overall good WLB",
			"cons": "- Shitty managers- Career growth is not very soft",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n******  Software Engineer - Jun 12, 2021"
		},
		"259": {
			"rating": "3.0",
			"desc": "Chill job",
			"pros": "The work life balance is very cool at this company! ",
			"cons": "The compensation is not as high as other companies. :(",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  |**  Software Engineer - Jun 10, 2021"
		},
		"260": {
			"rating": "4.0",
			"desc": "Very good C-suite leadership but growing pains and a lot of politics",
			"pros": "- Co-founders genuinely seem to care and are empathetic- Crazy about of transparency and communication about company strategy, vision, and roadmaps",
			"cons": "- A lot of politics- Geographically distributed teams means less than ideal working hours (for those that work with teams across the different regions)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S*****  Strategy & Business Development - Jun 10, 2021"
		},
		"261": {
			"rating": "3.0",
			"desc": "Moves slow, but good culture",
			"pros": "Good culture. Family first. Very accommodating. Will work hard to help you succeed.",
			"cons": "Moves slow and not exciting tech. Hard to work across time zones.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*****  Manager, Technology Development - Jun 10, 2021"
		},
		"262": {
			"rating": "4.0",
			"desc": "Overall good employer",
			"pros": "Culture is good. Work life balance is pretty great. Equity is good for BLR. Presence of remote policy.",
			"cons": "Health insurance cover for parents is 80%. Growth might be an issue with some teams.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Software Developer I - Jun 7, 2021"
		},
		"263": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Great company with caring people around. You will get to learn alot.",
			"cons": "Compensation seems to have a little lesser that other companies. Work is good but not great.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  _******  Software Engineer - Jun 4, 2021"
		},
		"264": {
			"rating": "4.0",
			"desc": "Ok in general ",
			"pros": "Tech stack is not the latest but new to keep everyday job challengingOk in every wayGood compensation. But not juicy enough for late joinersVery little room for career growth. Have seen a lot of talented devs stuck at P4/P5 and don’t have the chance to make a BIG impact to get promoted",
			"cons": "PoliticsToo much paperworkBureaucraticToo many meetings even for a Software Engineer",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*******  Software Engineer II - Jun 1, 2021"
		},
		"265": {
			"rating": "5.0",
			"desc": "Great place to work if you get a good manager",
			"pros": "- good benefits - wfh forever- option to go to the office",
			"cons": "- if you get a bad boss you are in deep trouble and there are a lot of them- writing endless confluence pages is valued over producing high quality work- networking over merit- a lot of incompetent workers especially in middle management",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Principal Product Manager - May 31, 2021"
		},
		"266": {
			"rating": "3.0",
			"desc": "Not a good place to do cool things",
			"pros": "Good WLB. Good perks and benefits. Decent pay.  The CEOs seems to care about others. ",
			"cons": "It’s a mediocre company at best if you want to do good work and learn things on the way to become successful in your career. The data science and analytics org is full of people who just do random stuff without any logic. Anything you do is touted as AI. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*******  Data Scientist - May 29, 2021"
		},
		"267": {
			"rating": "5.0",
			"desc": "great company culture",
			"pros": "as the title says, great company culture, nice and friendly working environment. For my role, compensation is competitive and i am fine with it.",
			"cons": "growth is not as much as in large companies. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A*****  Data Scientist - May 25, 2021"
		},
		"268": {
			"rating": "5.0",
			"desc": "Great WLB",
			"pros": "team culture is great. they have a good work life balance as well",
			"cons": "too much middle management old tech stacknot very exciting work",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Senior Software Developer - May 23, 2021"
		},
		"269": {
			"rating": "5.0",
			"desc": "Great WLB ",
			"pros": "Good WLB, flexible hours and support for remote work is available. Good work culture in my team",
			"cons": "work culture can be dependent on which team you are placed in",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*****  Software Engineer - May 20, 2021"
		},
		"270": {
			"rating": "3.0",
			"desc": "Bangalore teams aren't set-up for success",
			"pros": "Great policiesGood equityEmployee friendlyMostly confluence drivenGreat CEO",
			"cons": "Australia leaders aren't happy with Bangalore teamsBangalore teams are targeted and not happy with their growth",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Engineering Manager - May 19, 2021"
		},
		"271": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "1. Good teams and leadership. I am a new joinee so yet to explore things",
			"cons": "1. No cons till now will update with time. I am a new joinee",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Full Stack Engineer - May 18, 2021"
		},
		"272": {
			"rating": "5.0",
			"desc": "great WLB, great people, boring work",
			"pros": "people are nicework is easy30 hour work weekmanagement is trustworthy",
			"cons": "mediocre paywork is boringneed to work across timezones",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w*******  Software Engineer - May 16, 2021"
		},
		"273": {
			"rating": "5.0",
			"desc": "Great leadership and culture ",
			"pros": "- Founders are humble smart- Company invests in people- Well supported teams ",
			"cons": "- Distributed teams, head quartered in Sydney and may have to work Sydney hours depending on your role- Comp can be more competitive ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*******  Software Engineer - May 15, 2021"
		},
		"274": {
			"rating": "5.0",
			"desc": "Great company with strong leadership. Founders are long term focused ",
			"pros": "- great company culture - strong focus on customer - founder taking big bets and driving executive team towards that vision",
			"cons": "- product complexity has translated into org complexity specially for flagship products like Jira- data informed decisions vary by org - some data siloes exists but being addressed- experimentation and instrumentation have mixed adoption across product orgs ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Data Scientist Manager - May 15, 2021"
		},
		"275": {
			"rating": "3.0",
			"desc": "60th percentile pay, it says it all",
			"pros": "You can work in the company only if you're lucky to join a good team.",
			"cons": "* Atlassian pays at 60 percentile, they can't hire people who can do things good enough* One who screams more gets more attention. Managers aren't good programmers, no understanding of what needs to be done, and specifically HOW. Juniors lead the effort, often doing work to dump it later* Really bad P6s, and lots of folks who are toxic. Dealt with toxic P6, it's impossible to prove anything, if you know more than they are, they treat you as a personal attack.* If you want to grow, you HAVE TO make friends with those who is going to promote you (your managers), your technical expertise is not relevant. If you make good jokes with them, you will be promoted.  * I asked the manager (quote) is it true that it's harder in Atlassian to get promotion when you have kids?. He even didn't hesitate and said yes, and explained why exposing the company to liability. This is kind of  managers you have in Atlassian.* One you're in a bad team, you stuck. They push you through CAF (candidate assessment framework) if you wanna switch teams* In Covid-year (2020) they didn't do any salary increase. Nobody got their raise* Personally, no salary increase in 2+ years",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i********  Senior Software Engineer - May 14, 2021"
		},
		"276": {
			"rating": "5.0",
			"desc": "Great place to work",
			"pros": "• Really good culture• Genuinely nice people • Smart people to work with• Complex problems to solve• Impactful work",
			"cons": "Might jot be as fast moving as hustle lovers would want",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*******  Product Designer - May 11, 2021"
		},
		"277": {
			"rating": "4.0",
			"desc": "Amazing culture and work/life balance",
			"pros": "Putting out my experience in the past year. Specifics will vary with team.- Very employee centric- Work/life balance is the best part- Great colleagues and culture- Learnt emphasis on documentation",
			"cons": "- Growth is slow and mostly self driven- Product roadmap isn’t in place- Less impactful work",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Software Development Engineer II - May 10, 2021"
		},
		"278": {
			"rating": "4.0",
			"desc": "Overall great company with really awesome culture. Very transparent with everything.",
			"pros": "- Open company no bullshit is real. The company really pride themselves for being open and transparent.- Takes good care of the employees from a wellbeing perspective. I think we're very spoilt.",
			"cons": "- Growth opportunity very much depend on what project/product you get to work on. High visibility = More promotion opportunities.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m********  Designer - May 10, 2021"
		},
		"279": {
			"rating": "4.0",
			"desc": "Young and Dynamic",
			"pros": "Coming from Microsoft I find this:Fast paced YoungGood Company Culture Friendly",
			"cons": "Management can be more productiveNothing as such so far",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n*****  Senior Data Engineer - May 10, 2021"
		},
		"280": {
			"rating": "4.0",
			"desc": "Good company with progressive values.Good internal mobility. Slow growth though.",
			"pros": "Generally good co workers and helpful managers, decent WLB, work is generally interesting and good. Internal mobility is good.",
			"cons": "Growth is slower / limited compared to FAANG, few below average senior / principal engineers, raises are not the best. There are better places in SV for top performers.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Software Engineer - May 6, 2021"
		},
		"281": {
			"rating": "5.0",
			"desc": "Quite good compared to previous jobs",
			"pros": "Great WLB (it's what you make of it), supportive coworkers, good work.",
			"cons": "Too much tribal knowledge, not enough written down in an easily findable manner.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  1*******  Senior Engineer - May 6, 2021"
		},
		"282": {
			"rating": "5.0",
			"desc": "Great opportunities !",
			"pros": "Lot's of things to learn and great opportunities. Great colleagues to learn from",
			"cons": "Work is little slow paced. Can get a little boring sometimes",
			"resignation reason": "Exploring new opportunities outside this company. Have to see a lot of new tech",
			"authorInfo": "Verified User Former Employee  s***  Software Engineer II - May 5, 2021"
		},
		"283": {
			"rating": "5.0",
			"desc": "Amazing culture, great people",
			"pros": "Work life balance is greatCulture is greatPeople are friendly and understanding and supportive Open communication, lives up to values",
			"cons": "Compensation is not top tierReally that’s the only thing I can say",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t********  Software Engineer II - May 4, 2021"
		},
		"284": {
			"rating": "3.0",
			"desc": "Great work life balance, work may depend on team",
			"pros": "Smart colleagues Work life balanceGood BenefitsApprochable leadershipWork from home forever",
			"cons": "Slow paceNo strong product managersAs of now no clear roadmap atleast in my team. Boring",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*****  Software Engineer - Apr 29, 2021"
		},
		"285": {
			"rating": "5.0",
			"desc": "Culture and WLB are amazing",
			"pros": "Great culture great WLBPeople seem genuinely happy and helpful",
			"cons": "Comp isn’t quite FAANG levelSome monolithic code basesPace isn’t extremely high",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t********  Software Developer II - Apr 27, 2021"
		},
		"286": {
			"rating": "4.0",
			"desc": "Overall good company but you have to look after own learning",
			"pros": "Work life balance.Occasionally get to work on interesting projects.You can improve your communication skills.Most of the people are nice and helpful.",
			"cons": "Slow pace of development.Managers don't have inside knowledge of project or challenges you are facing.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Software Engineer II - Apr 27, 2021"
		},
		"287": {
			"rating": "5.0",
			"desc": "Great Work Life Balance",
			"pros": "Atlassian aims to push for a relaxed culture and the stocks are great.",
			"cons": "The management does not realize the potential in the efforts of teams and is constantly reorganizing teams which is a huge demotivating factor.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J*****  Product Analyst - Apr 26, 2021"
		},
		"288": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Overall a good company. Great Work life balance, open culture. Strong future outlook",
			"cons": "Comp isn’t on par with rest of the industry .",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z*****  Software Engineer - Apr 24, 2021"
		},
		"289": {
			"rating": "4.0",
			"desc": "Ok",
			"pros": "WLB is good. Lots of flexibility to work own hours. ",
			"cons": "Lack of defined processes. Resistance to change. Decision fatigue is common. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J*****  Engineer - Apr 23, 2021"
		},
		"290": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Atlassian has a great company culture. Work life balance is great",
			"cons": "Salary is not competitiveCompany executes projects slowly Lot of management layers",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*********  Senior Data Engineer - Apr 21, 2021"
		},
		"291": {
			"rating": "5.0",
			"desc": "Adherence to values and good work life balance",
			"pros": "Lots of opportunities to improve code base. Freedom to innovate every quarter. Tech stack is constantly trying to catch up with current trend. But good problems to solve.Open culture is a huge plus given communication in the engineering community is very open and so is the documentation. Serves as good exposure. ",
			"cons": "Slow dev turn around cycles due to legacy architecture in some teams. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Software Developer II - Apr 21, 2021"
		},
		"292": {
			"rating": "3.0",
			"desc": "Decent WLB; Rest depends on team",
			"pros": "Focus on WLB - whether you actually get to take it depends on your teamLots of low hanging fruit to create impact",
			"cons": "Things take a lot of time to developColleagues use the 'no bullshit' value to really be abrasive jerksVery task driven and not people driven",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q*****  Product Manager - Apr 19, 2021"
		},
		"293": {
			"rating": "4.0",
			"desc": "Great wlb, good pay, not so much career growth",
			"pros": "Great wlb, perks. Good pay but not as good as Google or uber.",
			"cons": "Not much career growth due to not much work available. Slow processes. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g****  Software Developer - Apr 19, 2021"
		},
		"294": {
			"rating": "3.0",
			"desc": "Good WLB, Not for ambitious people",
			"pros": "- WLB- Comp in BLR- Permanent Remote is now official- Not a Bay Area Company",
			"cons": "No growth for senior ICs. P5 to P6 is hard, P6 to P7 is impossible",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Principal Engineer - Apr 18, 2021"
		},
		"295": {
			"rating": "3.0",
			"desc": "Great culture with minimal career growth",
			"pros": "Great culture, smart people, growing company with decent products, cares about customers ",
			"cons": "Very minimal career growth, no life/work balance, everyone is burnt out but the goals/work keeps raising, getting more political",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A*****  Product Manager - Apr 18, 2021"
		},
		"296": {
			"rating": "4.0",
			"desc": "great work life balance+culture",
			"pros": "people are really nice and good to work with. excellent wlb and good culture",
			"cons": "comp seems slightly on the lower end / raises are small",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*******  Software Engineer II - Apr 15, 2021"
		},
		"297": {
			"rating": "4.0",
			"desc": "Great company to work at",
			"pros": "Everyone is collaborative and cross functional teams are great to work with ",
			"cons": "As we are scaling and growing, the company has a whole needs to adjust. Increased workload and initiatives since Covid and working remote.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b********  Product Analyst - Apr 14, 2021"
		},
		"298": {
			"rating": "5.0",
			"desc": "Solid company to grow your career ",
			"pros": "Great teammates Smart people and upper managementBeautiful offices and good snacks ",
			"cons": "Work life balance can be a dragIts gotten really. Corporate over the years ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o*****  Finance Controller - Apr 14, 2021"
		},
		"299": {
			"rating": "4.0",
			"desc": "Mostly good",
			"pros": "People are generally kind and friendly and the business is healthy. The company treats employees pretty well and working round the clock isn’t the norm. ",
			"cons": "People who spend more time self-promoting and writing internal blogs than working get rewarded There is a weird culture of pretending everything is great all the timeIt is bureaucratic and difficult to get anything done ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*****  Marketing Manager - Apr 8, 2021"
		},
		"300": {
			"rating": "5.0",
			"desc": "Amazing culture and work life balance",
			"pros": "Extremely relaxed cultureStress freeWork life balance is very good",
			"cons": "Compensation isn't FAANG levelSome legacy code and huge codebases but nothing unworkable",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Software Engineer II - Apr 7, 2021"
		},
		"301": {
			"rating": "5.0",
			"desc": "Great work to be done",
			"pros": "Can definitely learn a lot, move fast and learn a lot about the craft from experienced people",
			"cons": "Getting bigger means a lot of internal competition and hiring a lot",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Designer - Apr 6, 2021"
		},
		"302": {
			"rating": "1.0",
			"desc": "WLB vs compensation",
			"pros": "Great WLB. Friendly coworkers. Great benefits including unlimited PTO that you can actually use.",
			"cons": "HR. Raises aren’t great and depend on department. Company vision could be boring to some.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q*****  Software Engineer I - Apr 3, 2021"
		},
		"303": {
			"rating": "2.0",
			"desc": "Easiest work of your life but don't expect to grow or be paid well",
			"pros": "The work is ridiculously easy if you land on the right team and work-life balance is great.",
			"cons": "Compensation is horrible. Managers have their hands tied by the company processes and will not be able to do anything for you.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  x*****  Senior Software Engineering - Mar 28, 2021"
		},
		"304": {
			"rating": "3.0",
			"desc": "Okay company if you are in the right org",
			"pros": "Decent comp, some good co-workers, get to work from home",
			"cons": "Zero growth in certain orgs unless you know the right people",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Busineess Analyst - Mar 26, 2021"
		},
		"305": {
			"rating": "5.0",
			"desc": "One of the best company to work for!",
			"pros": "Everything about this place is awesome. The opportunities are countless and there is a lot to learn in most of the teams.The management takes good care of employees and keep on coming up with new employee friendly policies.Everything from compensation structure to various benefits provided to the employees helps developing a sense of belongingness for the company.I have not found any negative competitions here and everyone is always ready to help you out. ",
			"cons": "Sometimes there is too much work which affects the WLB but this is not very frequent.I can not find any other cons for Atlassian.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  G****  Software Engineer I - Mar 25, 2021"
		},
		"306": {
			"rating": "4.0",
			"desc": "Strong Values, minimal career advancement opportunities",
			"pros": "They have a strong sense of company values across the board and direct manager mentorship has been stellar.",
			"cons": "There have been at least 3 org changes and leadership changes in the last 6 months and at least one more on the near horizon. The changes and departure of leaders were backfilled with outside hires rather the internal promotions where viable candidates exist.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  h*****  Customer Success - Mar 23, 2021"
		},
		"307": {
			"rating": "3.0",
			"desc": "It is what you make of it. ",
			"pros": "Remote working.Many great people, who truly want to work as a TEAM.Lots of work to do (therefore, never boring).",
			"cons": "Rapid scaling brings the usual business challenges.Too many tools, systems, and communication channels.  Chaotic environment, with too many voices/opinions.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Program Manager - Mar 23, 2021"
		},
		"308": {
			"rating": "5.0",
			"desc": "Great wlb",
			"pros": "Live up to its values, good company, cares it employees",
			"cons": "Lot of tools and portals, no clear communication on all the benefits / portals / perks. HR process needs revamp",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*****  Senior Engineer - Mar 19, 2021"
		},
		"309": {
			"rating": "5.0",
			"desc": "Happy to work at Atlassian",
			"pros": "great culture, show care to employees, good compensation and benefit, encourage permanently wfh",
			"cons": "kinda laid-back since it's a aus company, nothing bad at all",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*********  Engineer - Mar 19, 2021"
		},
		"310": {
			"rating": "4.0",
			"desc": "Some pluses more minuses",
			"pros": "Plus - WLB, company is making money stock is shooting up and some good benefitsBest place to chill for 4 years which a lot of ppl are doing",
			"cons": "Minus - lot of middle management since going from ic 5 to ic 6 is very hard, every Ic 5 becomes an M1 with 1-2 reports and not much experience and wants to continue doing their IC tech stuffVery marketing driven but wants to show that they are a tech company hence technical skills are not valued only talking skills They are a tier lower than Faang and their benefits reflect that. So it’s ok but not the best",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y*****  Software Developer V - Mar 18, 2021"
		},
		"311": {
			"rating": "3.0",
			"desc": "Great work life balance and nothing else",
			"pros": "Great work life balanceMaster of your own time and work",
			"cons": "Sad management level in IndiaWork is similar to service sectorCompensation is at lower endGrowing is difficult because of lack of work",
			"resignation reason": "Management team is bad and growing seemed difficult. Had no reason to stay there considering these factors",
			"authorInfo": "Verified User Former Employee  t****  Senior Software Engineering - Mar 17, 2021"
		},
		"312": {
			"rating": "5.0",
			"desc": "Great Culture",
			"pros": "Good people and cultureGood learning opportunitiesCompetitive salaryGood stock performance",
			"cons": "Hiring employees too fast. There is a risk of diluting culture.Can't think of anything else",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S********  Senior Data Scientist - Mar 12, 2021"
		},
		"313": {
			"rating": "4.0",
			"desc": "Management needs to improve",
			"pros": "Founders are super cool. Good people.OpennessTech stack.Compensation",
			"cons": "Management is clueless.Too many reorgs.Clueless managementNew setup so culture has not permeated.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Software Engineer II - Mar 12, 2021"
		},
		"314": {
			"rating": "5.0",
			"desc": "Company culture on point",
			"pros": "You really feel like the top of the company cares about it’s employees. ",
			"cons": "Depending on where you are within on the company, values may not matter as much. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Software Developer - Mar 5, 2021"
		},
		"315": {
			"rating": "4.0",
			"desc": "Great company, but IT is almost like services company in India",
			"pros": "Great BenefitsWork life balanceRemote workYou will surrounded by smart people",
			"cons": "IT teams not same as product teamsIT management is racially biasedToo much changes all the time",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*********  Software Development Engineer II - Mar 4, 2021"
		},
		"316": {
			"rating": "5.0",
			"desc": "Its a nice place to work.",
			"pros": "Work life balance and now remote work for whoever wants it is great.",
			"cons": "Pay is in the middle/lower end of silicon valley companies. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Site Reliability Engineer - Mar 4, 2021"
		},
		"317": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "Stock is growing.Compensation is reasonable.Product has clear direction ",
			"cons": "Slow because of legacy code base.Platform is not up to the date.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y*****  Software Applications Engineer IV - Mar 3, 2021"
		},
		"318": {
			"rating": "4.0",
			"desc": "Great place to start",
			"pros": "The company is at an inflection point and will enter a phase of massive growth soon. As I'm a recruiter, that leaves me feeling job-secure. I'm new to the team (few months), but the culture *actually* seems to be governed by the values every SaaS company likes to create for talking points. Founders are hella transparent. Leadership seems solid overall. And on my team at least, there's not only opportunity for growth, but it's a primary conversation. My manager is genuinely invested in my professional development and advancement within the company. New company policy allows indefinite remote work.",
			"cons": "Comp isn't as competitive as it could be, especially considering we compete with The Big Guys for engineering talent. Benefits are in the same boat - plentiful, but not quite the same $$$ investment as an Amazon or a Google. The company has a LONG to go in the DEI space, but they're trying and it seems positive changes are rolling out soon.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*******  Technical Recruiter - Mar 3, 2021"
		},
		"319": {
			"rating": "4.0",
			"desc": "Great company with great values",
			"pros": "Great company, focused on looking out for their employee wellbeing.Equity growth. ",
			"cons": "- compensation- higher management taking action but not engaging with the grass roots first means there is still disconnect between the folks with problems and those several levels removed trying to solve them. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Engineering Manager - Mar 2, 2021"
		},
		"320": {
			"rating": "4.0",
			"desc": "Great Culture",
			"pros": "+ You feel a sense of security in the company.+ Peers respect you and you get to have a say.+ They are true to their value of OPEN COMPANY NO BULLSHIT.",
			"cons": "- Pace of work is slow as there is a lot of bureaucracy.- Haven't participated in a review cycle so cannot comment on that.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  G*****  Senior Engineer - Mar 2, 2021"
		},
		"321": {
			"rating": "5.0",
			"desc": "Great work life balance and teamwork ",
			"pros": "Work life balance is really goodGreat work culture as well",
			"cons": "Total compensation isn't the bestSome organizations/teams aren't working on interesting work.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y*****  Software Engineer - Feb 25, 2021"
		},
		"322": {
			"rating": "2.0",
			"desc": "Depends on your team",
			"pros": "Weekly WLB is okLong term balance not good bc culture of not using PTOComp was okay",
			"cons": "Poor management longer term goals change constantlyNepotismThey do not follow their values",
			"resignation reason": "Poor decision making and high turnoverTeam culture was bad ",
			"authorInfo": "Verified User Former Employee  J*********  Business Analyst - Feb 25, 2021"
		},
		"323": {
			"rating": "2.0",
			"desc": "Company is not what it used to be.  Stay away if you can",
			"pros": "Work life balance since WFH started is the only thing good since going public",
			"cons": "Middle management is ruining the company.  Going public has destroyed the culture that made Atlassian a great place to work.  The so called values Play As A Team, Open Company No Bullshit and Don’t fuck the customer are just empty platitudes now.Upper management is now playing games with when annual reviews and pay raises take place so that there are 18 months between reviews.  Company sponsored events were going downhill in quantity and quality long before COVID came alongEverything that is happening leads me to believe that something dark is coming",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e**  Support Engineer - Feb 25, 2021"
		},
		"324": {
			"rating": "4.0",
			"desc": "Really depends on team",
			"pros": "Overall company has a good culture and good wlb. Some teams are great. ",
			"cons": "Some teams in BLR are hyper competitive. Making it a rat race. Writing confluence page for everything that happens. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d********  Software Developer - Feb 25, 2021"
		},
		"325": {
			"rating": "5.0",
			"desc": "Great company to work",
			"pros": "Good people, great products, good work . Some projects are really good",
			"cons": "Hectic work. Loss of perks due to WFH. Pay is low compared to others.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q*****  Software Development Engineer II - Feb 24, 2021"
		},
		"326": {
			"rating": "3.0",
			"desc": "Good work life balance ",
			"pros": "Work life balance is good. There are a lot of extra-curricular activities.",
			"cons": "Management in India is not good. Not much scope for growth. Compensation is not market standard. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g******  Software Developer - Feb 24, 2021"
		},
		"327": {
			"rating": "2.0",
			"desc": "Good company but no growth",
			"pros": "- good values but mediocre culture- Decent work life balance",
			"cons": "- poor compensation- not much growth- repetitive work(depends on team to team)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Software Developer II - Feb 24, 2021"
		},
		"328": {
			"rating": "5.0",
			"desc": "Great culture and open company",
			"pros": "Good work-life balanceLots of social sessionsGreat perksGood management",
			"cons": "None as of yet, too soon, will update in time :p",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e********  Software Engineer I - Feb 21, 2021"
		},
		"329": {
			"rating": "4.0",
			"desc": "Value driven company",
			"pros": "The culture truly emphasises on the company values. People are generally helping each other and collaborative than competitive.",
			"cons": "Lack of standardization leads to reinvention and rework in several places.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  k*****  Engineer - Feb 16, 2021"
		},
		"330": {
			"rating": "5.0",
			"desc": "Varies depending on team",
			"pros": "Decent wlb. Team talent varies depending on team. You need to be popular to get promoted. Sometimes feels arbitrary. Some managers have been there for 3+ years and provide little value. ",
			"cons": "Low comp, mediocre intellect. Managers play favorites. Overly complicated strategy on marketing side",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Marketing Operations Manager - Feb 11, 2021"
		},
		"331": {
			"rating": "5.0",
			"desc": "5 years on, still really happy here",
			"pros": "- Great parental leave policies (20 weeks for paternity leave)- Forward thinking in terms of work from home culture etc. Happy for people to work for home for ever if they want to.",
			"cons": "- Promotions are difficult to get but I think this is mostly because they are trying to maintain a higher bar at higher ranks of seniority.- Interview process is a bit borked. I see candidates get the whole way through the process with signs that they are doing well only to be rejected at the 11th hour.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Engineering Manager II - Feb 11, 2021"
		},
		"332": {
			"rating": "4.0",
			"desc": "Great work life balance and benifits",
			"pros": "1. Work life balance 2. Benefits3. Great culture 4. Good learning  if you are in right team ",
			"cons": "1. Frequent  changes in management  decisionNo cons except that ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  G*****  Software Engineer II - Feb 10, 2021"
		},
		"333": {
			"rating": "2.0",
			"desc": "IT is a living hell",
			"pros": "Benefits are good. Good healthcare coverage, decent 401k match and stock grants. Supposedly the company has great values but you won't see them in IT.",
			"cons": "Where to begin? It's probably risky to give too much information, I don't want to be identified. If you have the misfortune to end up under the BLR Commerce umbrella, probably worth finding a new job. Prepare for rampant cronyism and political nonsense. Job and location are deliberately false.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Software Engineer - Feb 6, 2021"
		},
		"334": {
			"rating": "4.0",
			"desc": "Growth equals opportunities",
			"pros": "Products add value in a wfh worldThoughtful leadershipAmazing culture Aggressive growth means more opportunities ",
			"cons": "Adequate compensation (but often not as competitive)Some teams have a more difficult time with wlb than others ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*******  Design Manager - Feb 6, 2021"
		},
		"335": {
			"rating": "5.0",
			"desc": "Overall great company",
			"pros": "Great culture, people are awesome, company is doing well, learn a lot ",
			"cons": "Not any cons I can think of - very good so far! ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a********  Business Analyst - Strategy and Operations - Feb 3, 2021"
		},
		"336": {
			"rating": "5.0",
			"desc": "Employee friendly",
			"pros": "Great company to work for. Very employee friendly and good projects to work on.",
			"cons": "Cant think of any cons. Few people may not like WFH culture.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Senior Software Developer - Feb 3, 2021"
		},
		"337": {
			"rating": "4.0",
			"desc": "Great work life balance but very avg compensation",
			"pros": "The company, quite genuinely, cares about its employees' well-being a lot.",
			"cons": "For the name brand, they are and for the number of people, they try to hire they don't really compete at the compensation side of things. (they also know and acknowledge this)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Software Engineer - Feb 2, 2021"
		},
		"338": {
			"rating": "5.0",
			"desc": "Great place to work",
			"pros": "Lot of opportunities to work on for those interested to learn",
			"cons": "Nothing which can be called as cons, except be ready to be part of a growing company which comes with its set of opportunities",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Talent Acquisition - Jan 27, 2021"
		},
		"339": {
			"rating": "5.0",
			"desc": "Solid company values, work life balance, interesting problems to solve",
			"pros": "I joined Atlassian for the collaborative culture and its growth potential, and I have not been disappointed. We take our company values very seriously, and what each value means is clearly spelled out. We publicly give kudos ($) for colleagues who embody a company value. Team members, managers, and leaders are also very understanding of work/life balance needs especially through COVID and a very challenging 2020. Atlassian offers dedicated mental health resources for anyone struggling and supporting family/friends. Atlassian is also in an interesting growth space, with plenty of challenging problems (both product and technical) to solve. ",
			"cons": "Team missions and swim-lanes could be better defined (largely due to the rapid rate of growth and change), although middle management is open to letting ICs step in to define them as long as they can make a case for it. Many teams can benefit from a more open mindset of thinking about enabling Enterprise customers, but this too is improving. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  w********  Senior Product Manager - Jan 26, 2021"
		},
		"340": {
			"rating": "4.0",
			"desc": "Great Leadership",
			"pros": "- Great benefits (although they haven’t been updated to a post-COVID world)- Great executive leadership team- Economically stable company",
			"cons": "- Not clear career path- Those who have the right relationships are the ones being recognized and promoted- LOTS OS POLITICS. I mean A LOT. Very ambitious and young leadership leading to low Emotional Intelligence and poor way to evaluate IC and middle managers.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y*****  Marketing Manager - Jan 21, 2021"
		},
		"341": {
			"rating": "5.0",
			"desc": "Solid work life balance and good exec leaders.  Nice to have founders who still care",
			"pros": "Work life balance way better than mostFounders still care and it showsNot much big company bullshit",
			"cons": "Growing number of useless middle managersSome areas of biz are operating like its 2010",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A*****  Business Analyst - Jan 21, 2021"
		},
		"342": {
			"rating": "5.0",
			"desc": "Feel lucky to work at atlassian",
			"pros": "There is lots to love about Atlassian! People, culture, values, business model.",
			"cons": "There could be better communication at the company as it grows up. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Senior Manager, Strategy & Operations - Jan 20, 2021"
		},
		"343": {
			"rating": "5.0",
			"desc": "Great place to work, but less technical challenges and lot of busy work",
			"pros": "Really great cultureGreat products and swagGenuinely cares about employees",
			"cons": "Too much hierarchy and too many peopleIntense competition to advance career difficult to differentiateVery few good people managers",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*******  Software Engineer II - Jan 19, 2021"
		},
		"344": {
			"rating": "4.0",
			"desc": "Great to chill at",
			"pros": "Perfect if you want to chill, get money. Really good positive culture and good wlb. Pretty good TC, stock has been pretty great in recent times",
			"cons": "For cutting edge tech look for newer startups(Maybe I'm crazy, but competition for confluence could swoop in, maybe asana, idk what's up with bitbucket)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*****  Software Engineer - Jan 16, 2021"
		},
		"345": {
			"rating": "5.0",
			"desc": "Good place to work if you ",
			"pros": "- Open culture and high transparency- Great work life balance. Top management cares about employee well being- Helpful people and great collaborative culture. Very few jerks as far as I can see- Company seems to be making good strategic moves ",
			"cons": "- Below average compensation- Unclear career growth- Engineer manager not showing interest in helping people develop ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Software Engineer - Jan 15, 2021"
		},
		"346": {
			"rating": "5.0",
			"desc": "CSS india is not the best place to be",
			"pros": "The culture is amazingThe office is well equipped abd probably best in BangaloreCompensation is not the best still competitive",
			"cons": "Poor Indian managementBiased decision makersExploiting companies good culturePoor tech stack",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*********  Support Engineer III - Jan 13, 2021"
		},
		"347": {
			"rating": "5.0",
			"desc": "Growth stage, full of opportunities",
			"pros": "Lot of opportunities to learn and contributed. Good pay, good work life balance, good learningsBest culture. ",
			"cons": "Constant changes cause chaos sometimes. The company is also scaling and you have to stay current.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J*****  Software Engineer II - Jan 13, 2021"
		},
		"348": {
			"rating": "4.0",
			"desc": "Good wlb, not particularly strong eng culture, decent comp but could be better, good stock",
			"pros": "atlassian has really good wlb, founders are really smart, really good and friendly culture. the company makes good business decisions and the stock is really good",
			"cons": "everyone hates atlassian products but is forced to use them. it gets old reading how much people hate your product on reddit and hackernews. engineering feels very reactive. hard to ship new features because the codebase is such a mess",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*****  Software Engineer II - Jan 8, 2021"
		},
		"349": {
			"rating": "3.0",
			"desc": "Mediocre technical managers",
			"pros": "Good work life balanceUpper management cares for the companyOpen culture",
			"cons": "In order to grow quickly it seems like that they have hired mediocre managers who really don't care about the technical work or skills. They give you any random project and it doesn't matter if you should be involved in it or you should be owning it. Manager doesn't see what are your strong points or weakness to help you grow in your career. The team is writing non maintainable code and doesn't think that the teammate is providing valueable feedback. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Software Development Engineer In Test II - Jan 7, 2021"
		},
		"350": {
			"rating": "5.0",
			"desc": "The best large company culture you can find. ",
			"pros": "Atlassian has the best culture for a large company. Founders set a solid example for ethics, inclusion, and teamwork. Politics exists, but isn’t overly disruptive.  Hyper growth company and bottoms-up decision making help empower teams. Pay is at the 70th percentile, 100% health is covered, 100% of 4% 401k match, $600 fitness stipend, RSU grants and refreshers. Very remote friendly.",
			"cons": "Not the top paying company, but there are intangibles like flexible PTO and great leadership that help offset that. Sometimes timezones are a bit difficult to coordinate between the US and Sydney.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Designer - Jan 5, 2021"
		},
		"351": {
			"rating": "4.0",
			"desc": "Great Work Life Balance",
			"pros": "- Work Life Balance- Innovation time- company culture",
			"cons": "- Slow Growth- Less than market compensation- Scale not to high",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  y******  Software Engineer - Jan 5, 2021"
		},
		"352": {
			"rating": "4.0",
			"desc": "Great company to work at",
			"pros": "Great work-life balance, interesting work and the people are great.",
			"cons": "Compensation is less than competitors and there isn't as much opportunity for growth.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*****  Software Engineer - Jan 5, 2021"
		},
		"353": {
			"rating": "5.0",
			"desc": "Great place to work but comp needs to be better",
			"pros": "Values are not just tag lines on the wall, it is more or less followed. People are great and there seems to be an underlying willingness to help in the company. People are smart and your work life balance is important for the company. ",
			"cons": "Compensation is not at where it should be. Moving from levels is difficult.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  O*********  Project Manager - Dec 31, 2020"
		},
		"354": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "the food is good and the teammates are amazing, couldn't ask for better work either",
			"cons": "not much career growth seen, and many people seem to burnout after doing same work for a while",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  Software Engineer - Dec 30, 2020"
		},
		"355": {
			"rating": "5.0",
			"desc": "Nothing but good things to say!",
			"pros": "* Leadership is passionate, ethical, and oriented toward doing the right thing for our team, for the world, and for our customers.* Growth opportunities in a mix of forms - I had the opportunity to promote from senior to principal in my first year based on performance. Others have moved into people leadership roles.* The people are smart, talented, and care deeply about our business.",
			"cons": "* We've invested so heavily in the R&D side of our business that operations has run too lean, and we're starting to catch up. This sometimes impacts employee and customer experience when the People team is run too thin, or when procurement/finance teams are stretched (as examples).* In our Silicon Valley offices, we struggle with the same sense of entitlement/lack of reality that the rest of the Bay area does.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W*****  Operation Analyst - Dec 28, 2020"
		},
		"356": {
			"rating": "5.0",
			"desc": "Great culture and wlb",
			"pros": "Culture and wlb are very good and management seems to encourage PTO. Company lives by the values it has.",
			"cons": "Compensation is not bad but not quite as good as other big name tech companies",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T*****  Software Engineer - Dec 24, 2020"
		},
		"357": {
			"rating": "5.0",
			"desc": "Amazing place to work",
			"pros": "Work life balance, great and supportive management, follows company values, extremely open company",
			"cons": "Little career growth and ambiguity around what does it take for career progression ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Operations Support Manager - Dec 24, 2020"
		},
		"358": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Great team to work with, great work life balance, good culture but as it grows it is changing.",
			"cons": "Compensation isn't great but it's decent with the company's growth.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a********  Designer - Dec 23, 2020"
		},
		"359": {
			"rating": "4.0",
			"desc": "Great WLB, management a bit out of touch",
			"pros": "Company values mean a lot and are prevalent in work",
			"cons": "So much wasted time on unimportant matters due to bad decision making from upper management",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Engineer I, Software Development & Engineering - Dec 22, 2020"
		},
		"360": {
			"rating": "5.0",
			"desc": "Pretty good opportunity",
			"pros": "Joined because I liked the domain and the work.Good structured process with room for error handling. Career growth opportunities. Decent compensation. Pretty good wlb",
			"cons": "Working with new folks can be cumbersome.Not the best product out there. Could focus on the product experience more. Sometimes overloaded with work. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  W******  Product Designer - Dec 21, 2020"
		},
		"361": {
			"rating": "5.0",
			"desc": "Great WL",
			"pros": "Great People great team and lots of support.Strong in tech",
			"cons": "None I can’t think of anything bad.Remote situation impacts all companies",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Software Developer I - Dec 21, 2020"
		},
		"362": {
			"rating": "2.0",
			"desc": "Things barely move forward",
			"pros": "Good place if you don't care about career growth, fair comp",
			"cons": "A little bit stagnant place, bad management and career growth",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A*****  Software Engineer - Dec 20, 2020"
		},
		"363": {
			"rating": "4.0",
			"desc": "Great work life balance ",
			"pros": "Great WLBPpl in general are nice and considerateCulture is good",
			"cons": "Limited career progression opportunities Pay was 2nd tier Lots of tech debt ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Y*****  Engineer - Dec 18, 2020"
		},
		"364": {
			"rating": "3.0",
			"desc": "Good, but growing pains",
			"pros": "Overall still a good culture and not a bad place to launch a career.Management can be great, OK, or terrible, but it varies wildly by team and individual. Still, some really great people at Atlassian.",
			"cons": "(non-eng) progression can hit a wall after 3-4 years with no clear progression opportunities outside of management.the company is becoming big, and with it comes bureaucracy and politics. it takes longer to get things done and a lot more time is spent aligning and in endless meetings vs. actually doing the work.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  G*****  Data Scientist - Dec 18, 2020"
		},
		"365": {
			"rating": "4.0",
			"desc": "Great company culture and great people",
			"pros": "Company culture is really good and great people to work with. Latest tech stack is also something that I liked around here. ",
			"cons": "Even though work life balance and vacation time is really good overall in the company, it really depends on the team that you are working on and the manager of your team. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a********  Software Engineer - Dec 14, 2020"
		},
		"366": {
			"rating": "5.0",
			"desc": "Its a great place to work ",
			"pros": "work culture, the attitude of the people, benefits, leave policy, and their care towards maintaining that culture.",
			"cons": "nothing as of now with a short span at Atlassian",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*****  Senior Developer, Business Intelligence - Dec 14, 2020"
		},
		"367": {
			"rating": "5.0",
			"desc": "Excellent culture; people really lean on the values",
			"pros": "- People are open and direct but also very caring with a strong culture of transparency- Good compensation ",
			"cons": "- Oftentimes have to work with folks in Sydney, which makes for late meetings",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Business Strategy Manager - Dec 9, 2020"
		},
		"368": {
			"rating": "4.0",
			"desc": "Great culture but many groups has not very good managers",
			"pros": "Great business processesPeople are very helpful across the whole organizationGood work-life balance",
			"cons": "The worst manager I had in my career was at Atlassian - manipulative, non-technical micromanager running a team of engineers.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*****  Software Engineer - Dec 9, 2020"
		},
		"369": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Yearly hikes are based on market correctionNo peer competition Values",
			"cons": "Growth is stagnantMicrobanding is a trap to move up tue ladder",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Support Engineer - Nov 28, 2020"
		},
		"370": {
			"rating": "5.0",
			"desc": "Culture with ton of positivity",
			"pros": "Awesome culture and talented folks care for each other and so on ",
			"cons": "None at the moment can be competitive with comp and vision",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Designer - Nov 27, 2020"
		},
		"371": {
			"rating": "4.0",
			"desc": "Great culture",
			"pros": "Great culture and great people to work withStrong WLB",
			"cons": "Compensation not as competitivecareer growth is not that clear",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Software Engineer - Nov 26, 2020"
		},
		"372": {
			"rating": "4.0",
			"desc": "Good benefits, but bad culture ",
			"pros": "- good benefits - newly work from home - cushy in the sense that you can get away doing little ",
			"cons": "- pay isn’t competitive - culture isn’t as teamwork-first as they present it to be- mid-management is full of egos- low opportunity for growth",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s******  Product Designer - Nov 24, 2020"
		},
		"373": {
			"rating": "4.0",
			"desc": "Good work life balance",
			"pros": "Good work life balanceOpen cultureTeammates are helpfulCompany is growing and there are good learning opportunities ",
			"cons": "Managers don’t seem to be technically strong or know how to manage the team and get best out of the team",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*****  Software Developer II - Nov 24, 2020"
		},
		"374": {
			"rating": "4.0",
			"desc": "5 stars to Atlassian work culture",
			"pros": "Pay grade is competitive, Amazing benefits and stock value is doing well. ",
			"cons": "Career growth depends on your team and manager. Middle management is not that great to drive good projects. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m********  Software Engineer - Nov 19, 2020"
		},
		"375": {
			"rating": "2.0",
			"desc": "All Hype. Not good.",
			"pros": "WLB is good for most teamsProducts do make a differenceGenerally care about employee’s well-being",
			"cons": "Shifting standards to push people harderPeople who lived the culture has mostly leftNo agile development process - Mini waterfallsLoose process make working with others hard and unrewarding",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  8******  Engineering Lead - Nov 19, 2020"
		},
		"376": {
			"rating": "5.0",
			"desc": "Strong leadership, comp mid range ",
			"pros": "Strong founder vision and leadership— could use more product innovation and vision beyond strong m&a strategy",
			"cons": "Comp on the mid to low end of the range you would expect ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  T***  Product Manager - Nov 18, 2020"
		},
		"377": {
			"rating": "5.0",
			"desc": "Amazing work life balance, transparent management",
			"pros": "Open cultureGreat leadershipGreat work life balanceSmart co-workersTransparent communication",
			"cons": "Career growth across levels is difficult, expectations are very high for getting promoted",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  Q*****  Engineering Manager - Nov 13, 2020"
		},
		"378": {
			"rating": "4.0",
			"desc": "Amazing WLB",
			"pros": "+ company really cares about the employees+ good perks",
			"cons": "+ old stack+ products other than jira don’t get love ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  z********  Software Engineer - Nov 12, 2020"
		},
		"379": {
			"rating": "5.0",
			"desc": "Great company culture, management (anecdotal), compensation and WLB.",
			"pros": "Great company culture, management (anecdotal), compensation and WLB. Very chill culture yet people still get stuff done.",
			"cons": "Career growth is slightly lower due to less pressure to perform.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  H*****  Software Engineer - Nov 8, 2020"
		},
		"380": {
			"rating": "5.0",
			"desc": "Top tier culture",
			"pros": "People actually follow the company values, or at least try their best to do it. ",
			"cons": "If you really care, the bad rep that some Atlassian products have can get to you at times. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*********  Software Engineer - Nov 6, 2020"
		},
		"381": {
			"rating": "4.0",
			"desc": "Great company; still a lot of potential ahead!",
			"pros": "Great culture, excited for the future and still think there’s a lot of growth ahead.",
			"cons": "Can get bogged down in bureaucracy sometimes during decision making",
			"resignation reason": "Needed to move and had to get a new job",
			"authorInfo": "Verified User Former Employee  a*****  Software Applications Engineer II - Oct 29, 2020"
		},
		"382": {
			"rating": "5.0",
			"desc": "Great work life balance ",
			"pros": "1. Great work life balance 2. Management genuinely cares and values employees 3. Awesome company culture, you are never judged on your failures",
			"cons": "1. Pay is far better than  industry average. I believe general pay is 20-30 percent less than FAANG. Unless you have counter offer and good negotiating skills.2. A lot of teams are distributed in US,Sydney and India, working across multiple timezones will be a challenge you should expect.3. Culture varies by, my team is awesome and most of the people speak good about their teams. In one of our stakeholders team I saw some one engineer got fired in first two quarters because of internal politics.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g******  Senior Data Engineer - Oct 27, 2020"
		},
		"383": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "Great benefits. CEOs care about everyone’s wellbeing especially during this crazy time.",
			"cons": "Career growth not so great. I wish pay was better.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Software Engineer - Oct 21, 2020"
		},
		"384": {
			"rating": "5.0",
			"desc": "Awesome company",
			"pros": "CultureWlbPeopleGrowthOpportunities 100% remoteAmazing co founders vision and execution ",
			"cons": "Compensation is lower than fangNot so many cutting edge talent around, which is related to the above :) ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*****  Software Developer - Oct 21, 2020"
		},
		"385": {
			"rating": "4.0",
			"desc": "Great work life balance",
			"pros": "Not very fast paced. Good if you want to take your time.Employee friendly policies and benefits.Communication from top is good. Everyone literally lives the company values which leads to good work culture.",
			"cons": "For someone coming from a startup, the slower pace means slower career growth.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a****  Software Developer II - Oct 18, 2020"
		},
		"386": {
			"rating": "4.0",
			"desc": "Great culture ",
			"pros": "Great culture, people are open and willing to help out. Company growing rapidly",
			"cons": "- Growing pains- there’s teams where they lack maturity in processes or have too many new people- WLB is up to you so some teams are chill and some are over worked ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c*****  Product Designer - Oct 17, 2020"
		},
		"387": {
			"rating": "4.0",
			"desc": "Good wlb",
			"pros": "Great place to learn but not to stay. Office perks were great",
			"cons": "Scaling quickly has led to a drop in quality and culture. Management is political. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j********  Product Manager - Oct 15, 2020"
		},
		"388": {
			"rating": "5.0",
			"desc": "Great work-life balance ",
			"pros": "Atlassian has great work life balance and a good culture. ",
			"cons": "I haven not found any cons in the company as of now. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Software Engineer II - Oct 13, 2020"
		},
		"389": {
			"rating": "5.0",
			"desc": "Awesome Company almost too good to be true ",
			"pros": "Excellent wlb and TC this is a company that truly lives by their values. ",
			"cons": "None that I have seen so far. I’ve been with the company for 8 months.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*****  Technical Support Manager - Oct 12, 2020"
		},
		"390": {
			"rating": "4.0",
			"desc": "Great/Bad culture depends on teams",
			"pros": "- Good work life balance.- Flexible on where to work.- Good health insurance benefits.",
			"cons": "- Compensation is low compared to faang.- Some bad mid level eng managers (depends on teams) who are afraid to take responsibilities and play blame games.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  j*****  Senior Engineer - Oct 9, 2020"
		},
		"391": {
			"rating": "4.0",
			"desc": "Good company to work for",
			"pros": "Company has Great work life balance and great culture .",
			"cons": "Company has slow growth and compensation is average compared to other companies.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*****  Software Engineer - Oct 7, 2020"
		},
		"392": {
			"rating": "5.0",
			"desc": "Great Company ",
			"pros": "Atlassian is an amazing culture full of motivated and really smart people. As a salesperson, I believe we are going to make a big impact in the next few years as customers look at migrating our products to the cloud. ",
			"cons": "I’m working hard in too many zoom meetings all day but covid has been difficult for me to maintain a good work life balance. There’s a lot of exciting work to be done. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*****  Enterprise Account Executive - Oct 5, 2020"
		},
		"393": {
			"rating": "5.0",
			"desc": "Great at most except the most important ",
			"pros": "Excellent place to learn new technologies. Management is understanding and encouraging. Open company so all information is shared. ",
			"cons": "Sometimes some of the compensation decisions does not make much sense. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*******  Cloud Support Engineer - Oct 3, 2020"
		},
		"394": {
			"rating": "5.0",
			"desc": "Amazing culture ",
			"pros": "Great work life balance and really like the management team! ",
			"cons": "Political, very process driven company which can be bottle necks to get anything done ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  i*****  Marketing Consultant - Oct 2, 2020"
		},
		"395": {
			"rating": "5.0",
			"desc": "Great culture, great work life balance",
			"pros": "- Great culture- Great work-life balance- People are really nice- Has a bright future",
			"cons": "- Pay is mediocre but I believe Atlassian has a bright future so a well-performing stock offsets that- ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g*****  Software Engineer II - Oct 2, 2020"
		},
		"396": {
			"rating": "4.0",
			"desc": "Work life balance is good",
			"pros": "Fun projects, flexible, good people and I think people actually care",
			"cons": "Growing fast so hard to keep track of all changes ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B*****  Marketing Generalist - Oct 2, 2020"
		},
		"397": {
			"rating": "4.0",
			"desc": "Strong culture, Experience depends on managers",
			"pros": "Good culture + teammates Great benefitsStrong stock performance Growth opportunities ",
			"cons": "More middle managers who are greenLow pay (compared to other Tech companies)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  r*********  Data Analyst - Sep 29, 2020"
		},
		"398": {
			"rating": "4.0",
			"desc": "A job for life",
			"pros": "Its a super chilled place to work, really nice people to work with",
			"cons": "Performance doesn't seem to matter which makes it very hard to get stuff done.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Engineer - Sep 27, 2020"
		},
		"399": {
			"rating": "3.0",
			"desc": "WLB is great ",
			"pros": "Work life balance is great;Culture is good, ppl genuinely care",
			"cons": "Compensation is tier two or lower;Growth is fairly limited",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*****  Data Scientist - Sep 24, 2020"
		},
		"400": {
			"rating": "5.0",
			"desc": "Great culture and wlb.",
			"pros": "Love the products and engineering culture here. I'd say there's a great upward trajectory in the company's future.",
			"cons": "I personally don't see any negatives of working here other than our campus isn't as extensive as FAANGs so you can't expect the same amenities.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*********  UX Design Engineer - Sep 21, 2020"
		},
		"401": {
			"rating": "5.0",
			"desc": "Amazing culture and great work life balance",
			"pros": "Company culture is amazing, people are very friendly, great benefits",
			"cons": "The work may not be the most challenging out there",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Front-End Web Developer - Sep 21, 2020"
		},
		"402": {
			"rating": "4.0",
			"desc": "Great people, comp is meh",
			"pros": "Culture is great, people are super nice. Great perks like free food",
			"cons": "Low comp, there doesn't seem like a lot of growth.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*****  Software Engineer - Sep 20, 2020"
		},
		"403": {
			"rating": "5.0",
			"desc": "Loving it",
			"pros": "- great senior/junior dev ratio- great wlb - culture of competence",
			"cons": "- could make more elsewhere but I don’t know if the comp to wlb ratio can be beat",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s*****  Mobile Developer - Sep 20, 2020"
		},
		"404": {
			"rating": "5.0",
			"desc": "Amazing company to work for",
			"pros": "* Interesting and challenging work* Management is focused on your growth, path to promotion is transparent* WLB and culture is excellent",
			"cons": "* Company is product, not engineering focused* Pays less than FAANG",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  F*****  Software Engineer - Sep 18, 2020"
		},
		"405": {
			"rating": "4.0",
			"desc": "Great culture, poor performance management ",
			"pros": "Great company culture, quick moving on remote work, lots of opportunity. ",
			"cons": "Has not invested in performance management and growth planning. There are some poor managers that lead to slow decision making. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*******  Marketing Manager - Sep 17, 2020"
		},
		"406": {
			"rating": "4.0",
			"desc": "The culture is quite good.",
			"pros": "People are generally friendly. I love the office building. Learning opportunities.",
			"cons": "If you are in product team, your wlb is not so great.",
			"resignation reason": "Better offer elsewhere. My career is stagnant, can't move up.",
			"authorInfo": "Verified User Former Employee  L*****  Software Engineer - Sep 17, 2020"
		},
		"407": {
			"rating": "4.0",
			"desc": "Great stepping stone company",
			"pros": "The culture is good. Everyone seems fair to me, and everyone seems to be pleasant to work with.",
			"cons": "Pay is meh.It always feels like it is a stepping stone company for something bigger.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  o*****  Software Developer II - Sep 13, 2020"
		},
		"408": {
			"rating": "5.0",
			"desc": "Culture is worth the hype",
			"pros": "Real commitment to maintaining cultureGood perksCompany is not afraid to make big bold bets.Good work life balance",
			"cons": "Company is still growing quickly and strategy is agile, which is great. But the pivoting can be disorienting. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  P*****  Field Operations Specialist - Sep 11, 2020"
		},
		"409": {
			"rating": "5.0",
			"desc": "Good company with great culture ",
			"pros": "Work from anywhere benefit,  great culture,  good colleagues,  overall good company to work for",
			"cons": "Too much of confluence documentation,  sometimes overlooked,  but sometimes helpful though ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  v*****  Software Engineer - Sep 4, 2020"
		},
		"410": {
			"rating": "4.0",
			"desc": "Great WLB. Doesn’t pay well. Awesome culture.",
			"pros": "Takes care of their employees. Hands down the best health insurance for employee and their families. Transparent leadership. Awesome culture.",
			"cons": "Doesn’t pay well. Shabby RSU refreshers. Many reorgs. Mediocre middle-level management. Promotion is very political and social game. It goes easier if you sell yourself to promotion panel.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  N*****  Software Engineer - Sep 4, 2020"
		},
		"411": {
			"rating": "4.0",
			"desc": "Company is transparent",
			"pros": "Atlassian really push for open company and no bullshit. They also care about employees' wellbeing. ",
			"cons": "Comapny is growing fast. Half the analytics team is less than 1 year tenure. It is hard to figure out who owns what or there are too many teams trying to solve the same problem.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b****  Data Scientist, Analytics - Sep 4, 2020"
		},
		"412": {
			"rating": "4.0",
			"desc": "Great culture with good work",
			"pros": "Awesome culture with good perks. Very human upper management. Best work life balance I've seen",
			"cons": "Promotions are hard, no espp, pays average in the US",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s********  Software Engineer - Sep 4, 2020"
		},
		"413": {
			"rating": "5.0",
			"desc": "Great company to work for",
			"pros": "Great company, smart people, nice benefits. Flexible working hours are a plus",
			"cons": "Compensation not the best, career progression can be pretty slow ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  R*****  Software Developer - Aug 31, 2020"
		},
		"414": {
			"rating": "5.0",
			"desc": "Excellent company, exceeded expectations",
			"pros": "You can read the other reviews for the material perks they provide. Overall, the Company treats employees like people in the decisions they make - much stronger than any other tech company I’ve joined. ",
			"cons": "Work life balance depends on you (learn to say no if you don’t want to work harder). Stock refreshers is not par with some FAANG, although base is equal and stock performance is equal or better than FAANG ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m**  Product Manager - Aug 29, 2020"
		},
		"415": {
			"rating": "5.0",
			"desc": "Great WLB, People, Top Notch Culture",
			"pros": "We actually live our values, great leadership, awesome culture. Founders/CEOs are respected and are steering the ship well. Love the people here!",
			"cons": "Total Compensation for above entry level SWEs can be a little lower than FAANG and other Bay Area tech companies.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a*********  Software Engineer - Aug 27, 2020"
		},
		"416": {
			"rating": "4.0",
			"desc": "Good company",
			"pros": "Great compensation and company culture. Atlassian really tries to live the values to core.",
			"cons": "With aggressive hiring specially in managers level culture is deteriorating before fast. WLF is first to take hit and now transparency too. Even within a year I can see the difference. It's still a good company to work for today but going downhill very fast and nothing is done it will become another valley company",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  s********  Software Back End Engineer - Aug 27, 2020"
		},
		"417": {
			"rating": "5.0",
			"desc": "Best decision of my life",
			"pros": "Great culture. Gives atmost importance to your personal life. Truly a no BS company",
			"cons": "Compensation is slightly lesser than FAANGEngineering Talent can be better",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c********  Senior Software Developer - Aug 27, 2020"
		},
		"418": {
			"rating": "4.0",
			"desc": "People are pretty nice so far",
			"pros": "I’m new so all I’ve had exposure to is the culture and it’s pretty good",
			"cons": "I’m new so not many so far that I can think of ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*******  Software Engineer I - Aug 27, 2020"
		},
		"419": {
			"rating": "4.0",
			"desc": "Good culture; growing pains",
			"pros": "Great culture.People live the values and do the right thing",
			"cons": "Ok compensation.Need to move faster on execution or risk being left behind.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  p*****  Cashier/Barista - Aug 27, 2020"
		},
		"420": {
			"rating": "5.0",
			"desc": "Great work culture ",
			"pros": "People believe in the company values and leadership vision .. Open company No bullshit is one of theie value and i have to say they live by it being so transparent , even about confidential information .. ",
			"cons": "Not many , but adoption of tech is on the slow side",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  A*****  Senior Back End Engineer - Aug 23, 2020"
		},
		"421": {
			"rating": "5.0",
			"desc": "Great WLB with an awesome company culture",
			"pros": "- Everyone lives by the company values- great wlb, nothing is rushed",
			"cons": "- pay is low compared to FAANG- product teams tend to be a pain to collaborate with",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u****  Mobile Engineer - Aug 23, 2020"
		},
		"422": {
			"rating": "3.0",
			"desc": "Just a stepping stone company",
			"pros": "It’s pretty relaxedBenefits are competitivePeople are good to work with generally",
			"cons": "They pay median of the market (for cultural reasons)Products are not excitingIndustry laggard, not a leader in most categories",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  Cashier/Barista - Aug 23, 2020"
		},
		"423": {
			"rating": "3.0",
			"desc": "Was great place to work few years ago",
			"pros": "Founders continue to lead the company. Company culture was good few years ago. ",
			"cons": "Company has expanded staffing very fast. New leaders are from traditional hierarchical organizations.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q*****  Program Manager - IT - Aug 21, 2020"
		},
		"424": {
			"rating": "5.0",
			"desc": "Best company ever",
			"pros": "They really take care of employees, esp during covid times",
			"cons": "Slow and not as visionary as they could be . Some managers aren’t very good",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d*****  Product Manager - Aug 21, 2020"
		},
		"425": {
			"rating": "4.0",
			"desc": "Great WLB, mostly great people, good product, real revenues",
			"pros": "1) Best WLB of a large company albeit at the small end of large2) Good product with real value, no ads BS3) Profitable, stable, still founder run4) Good and stable comp compared to small companies or non tech industry tech jobs5) Takes the values seriously",
			"cons": "1) Low comp compared to F/G and similar top tier2) Kind of slow moving by Silicon Valley standards (which is still fast compared to almost any other industry) 3) A bit of a big company bureaucratic mentality, mostly applies if you are a manager or architect4) Product rather than engineering driven (could be a plus for some)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e*********  Engineering Manager - Aug 20, 2020"
		},
		"426": {
			"rating": "5.0",
			"desc": "Great Culture",
			"pros": "Best culture I have ever seen in a companyLots of work to doTech stack and process are sorted and fairly advancedWork life balanceDecent compensation",
			"cons": "Growth pains, but apart from else didn’t find anything wrong with the company",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  D*****  Site Reliability Engineer III - Aug 20, 2020"
		},
		"427": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "Work life balance is great. Company culture is great and colleagues are very nice. Overall great company to work for",
			"cons": "Compensation can improve. Not first tier without considering stock appreciation.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  V*****  Software Engineer - Aug 20, 2020"
		},
		"428": {
			"rating": "4.0",
			"desc": "Good WLB most of the time",
			"pros": "Genuinely nice people who care about each other. Cofounders are down to earth and genuine. Lots of opportunities to do good, volunteer, give back. WFH forever. Global offices. Good WLB when not on a big project. Continuous professional development is supported and encouraged. Inclusive environment.",
			"cons": "Culture can border on a little cult-y, middle management is really hit or miss. Compensation is at the lower end of companies in the same band. The products are pretty horrible. Really difficult to get promoted. You’re expected to perform at the next level for a year before you might get promoted to that level (and compensated for it). You basically have to leave the company. RSU grants and refreshers are meh, especially if you missed out on the huge growth run that already happened after the IPO in 2015-2019.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  🏏****  Designer - Aug 20, 2020"
		},
		"429": {
			"rating": "5.0",
			"desc": "Great work life balance!",
			"pros": "Work life balance is really good and they provide lots of benefits(though not top tier). Excellent work culture and good opportunity for growth",
			"cons": "Management could be more clear on future goals as they keep changing every year.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  n********  Software Developer I - Aug 20, 2020"
		},
		"430": {
			"rating": "5.0",
			"desc": "Talented people around, Great work life balance",
			"pros": "Every one in the team/project is super talentedLearning on Daily basisPeople are dedicated to work and everyone loves working for the team",
			"cons": "In India , Haven't read or heard a single negative comment on Company",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  a********  Software Back End Engineer - Aug 20, 2020"
		},
		"431": {
			"rating": "5.0",
			"desc": "great culture and people",
			"pros": "great culturegreat wlbpeople are very collaborative and helpfulroom for growth for permanent remote work ",
			"cons": "hard to go P5 -> P6tc not as high as other placesremote work -> location based tc ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  I*****  Software Engineer - Aug 19, 2020"
		},
		"432": {
			"rating": "5.0",
			"desc": "Employee & Customer Oriented",
			"pros": "Equity grantsPerks (when offices are open!)Competitive Base + BonusChallenging workEmployee-friendly policies",
			"cons": "Losing some of its culture with growthHR not transparent about pay / bonus payoutsParental leave discriminates against all but birth mothers",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  m*******  Manager, Finance - Aug 18, 2020"
		},
		"433": {
			"rating": "5.0",
			"desc": "Great WLB, Comp/Benefits, Culture",
			"pros": "Great WLBcomp/benefitsCultureCustomer-focused productsPassionate and considerate leadershipsuper open company",
			"cons": "Sometimes decision making is slowTeams spread across almost every geo",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  d****  IT Business Analyst II - Aug 14, 2020"
		},
		"434": {
			"rating": "5.0",
			"desc": "Great",
			"pros": "There's a huge emphasis at Atlassian on being a great team player at all levels of the company, and this greatly discourages the dog eat dog competitiveness present elsewhere.",
			"cons": "Not exactly the most cutting edge company or the one that will accelerate your career the fastest.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C********  Software Engineer - Aug 13, 2020"
		},
		"435": {
			"rating": "4.0",
			"desc": "Awesome culture, product driven execution",
			"pros": "Awesome culture, listening managers, remote friendly environment, open company no bullshit.",
			"cons": "Tech is not bleeding edge, but you can work on many things if you want to.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  X*****  Software Engineer - Aug 12, 2020"
		},
		"436": {
			"rating": "5.0",
			"desc": "Best in class Culture",
			"pros": "positive work environment. very helpful pplautonomy to do what u want to do, how u want to do",
			"cons": "scope to do something about career growth. don't see any any other downside",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  S********  Senior Product Analyst - Aug 12, 2020"
		},
		"437": {
			"rating": "5.0",
			"desc": "Great culture, great pay, growing pains",
			"pros": "Compensation, culture, energy, management and leadership. Everybody is happy to be there.",
			"cons": "Disorganized. There is such a thing as too much openness. Teams are not aligned to a Big Vision.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  U*******  Creative Design Lead - Aug 12, 2020"
		},
		"438": {
			"rating": "3.0",
			"desc": "Great WLB but slow career growth",
			"pros": "- Culture is pretty great- WLB is prioritised- Compensation in Bangalore is good",
			"cons": "- Projects are not that exciting. Engineering is definitely not top notch.- Management in Bangalore for some teams just talk the talk rather than walking it.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  g******  Software Development Engineer II - Aug 11, 2020"
		},
		"439": {
			"rating": "5.0",
			"desc": "exciting place to work",
			"pros": "constant challengeshardworking, smart and motivated peoplefounders with great vision who genuinely care about employees",
			"cons": "comp can be better compared to other top tier tech companies",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  F*****  Engineering Manager - Aug 11, 2020"
		},
		"440": {
			"rating": "5.0",
			"desc": "Best culture in the Bay Area, decent tech, ok pay",
			"pros": "* Amazing WLB* Good management* Good products* Decent tech stack",
			"cons": "* Pay could be better (but not terrible)* Career growth is hit or miss (depends on team)",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*********  Software Engineer - Aug 10, 2020"
		},
		"441": {
			"rating": "5.0",
			"desc": "Pay can improve but everything else is top",
			"pros": "Work life balanceManagement is considerate.transparency with promotions and growth.",
			"cons": "Pay can improve to match other top companies.Very rare situation where you are stuck with a bad manager.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  L*****  Software Engineer - Aug 10, 2020"
		},
		"442": {
			"rating": "5.0",
			"desc": "Atlassian is awesome and truly a special place to work",
			"pros": "culture is amazing, wlb is always top of mind and leadership genuinely cares. lots of oops for internal mobility and growth of you seek it out.",
			"cons": "company is growing very quickly and the infrastructure is still being built out. So if you aren't ok with constant change, this might be a tougher company to work for. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  B********  HR Team Member - Aug 10, 2020"
		},
		"443": {
			"rating": "5.0",
			"desc": "Great work life balance",
			"pros": "- Work life balance is the best so far- Pay is great as well",
			"cons": "From what I have experienced promotions are a bit slow here",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*********  Software Development Engineer II - Aug 10, 2020"
		},
		"444": {
			"rating": "5.0",
			"desc": "good company, good culture, meh pay",
			"pros": "stable company with great culture. seem to care about their employees ",
			"cons": "pay is pretty low compared to top companies, especially for swe",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  e******  Senior Data Scientist - Aug 9, 2020"
		},
		"445": {
			"rating": "5.0",
			"desc": "Great culture and nice wlb",
			"pros": "Awesome people and company that cares for you and good potential. full remote",
			"cons": "pay is subpar compared to faang, not exciting products may work with different timezones in sydney",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  C*****  Full Stack Engineer - Aug 8, 2020"
		},
		"446": {
			"rating": "5.0",
			"desc": "Great company culture ",
			"pros": "Awesome leadership, open culture, and opportunities for growth. Respect for work-life balance ",
			"cons": "None that I have experienced in my time working with them",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  J********  Technical Recruiter Leader - Jul 14, 2020"
		},
		"447": {
			"rating": "5.0",
			"desc": "Great place to work! ",
			"pros": "- Great team- Amazing ppl- Smart leaders- The best founders- Career growth- Benefits",
			"cons": "Hard to fault here, cant wait to see what we do in future",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b*****  Android Developer - Jul 9, 2020"
		},
		"448": {
			"rating": "4.0",
			"desc": "All around great company to work for",
			"pros": "-Work life balance is great-Solid team dynamics and procedures (at least on my team)-I personally enjoy what I work on-Management genuinely cares, empathetic-They do their best to stay true to their values-Volunteering program is great-Other benefits are nice-Good culture",
			"cons": "I don't think I have been around long enough to see any cons, but I will update this review if I have one",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  u*****  Software Engineer - Jun 27, 2020"
		},
		"449": {
			"rating": "4.0",
			"desc": "Best tech company",
			"pros": "Great people, good work life balance and benefits, positive culture",
			"cons": "Base salary is not as competitive as other companies in the area.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t******  Product Marketing Manager - May 31, 2020"
		},
		"450": {
			"rating": "4.0",
			"desc": "Great products",
			"pros": "If you are a PM or aspired to grow your career as a PM, you will have so many opportunities as the company continuously invests in its products to meet the market needs. ",
			"cons": "Like any other company, there are some growing pains but nothing major.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  b********  Senior Product Manager - May 31, 2020"
		},
		"451": {
			"rating": "3.0",
			"desc": "Enjoying",
			"pros": "People are driven by shared values and passion. Great benefits and perks.",
			"cons": "Internal mobility and promotion can be improved. I have not affected by this since I'm still very much new but heard enough about it.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  t*********  Senior Recruiter - May 28, 2020"
		},
		"452": {
			"rating": "4.0",
			"desc": "Good company ",
			"pros": "Competitive tc, best company culture I have experienced thus far, flexible working schedule, great leaderships ",
			"cons": "Work-life balance is great but fast-growing demands huge workloads. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  4*********  Senior IT Consultant - May 28, 2020"
		},
		"453": {
			"rating": "5.0",
			"desc": "Company that really cares for employees",
			"pros": "Atlassian offers the best benefits, food, healthcare, and pay. The company tries hard to take care of the workers so they can work most effectively. ",
			"cons": "Base pay is lower than other tech companies but what you have to look at is tc. I'm happy with all the other benefits. ",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l****  Senior Product Marketing Manager - May 28, 2020"
		},
		"454": {
			"rating": "5.0",
			"desc": "Great place to build your career",
			"pros": "Great flexibility, ownership, and autonomy. I've grown so much here as a recruiter.",
			"cons": "There are growing pains such as constant changes and the burnout.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q******  Senior Recruiter - May 25, 2020"
		},
		"455": {
			"rating": "5.0",
			"desc": "Great work",
			"pros": "You are given an opportunity to go out on a whim and try new things without risk.",
			"cons": "Sometimes too many people involved in a project and it slows down the whole process.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  5******  Marketing Manager - May 25, 2020"
		},
		"456": {
			"rating": "5.0",
			"desc": "Great place to work",
			"pros": "The company has done a good job of delivering decision-making and long-term perspectives to their employees. Everyone I have come across is super focused and motivated.",
			"cons": "Management needs to put more focus on enabling opportunities for employees with internal mobility or promotions.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  q*******  Marketing Manager - May 25, 2020"
		},
		"457": {
			"rating": "5.0",
			"desc": "Great company to work for",
			"pros": "Management's support to employees is just amazing. They make you feel like you are a part of company's success.  ",
			"cons": "Politics can get in a way for the right people to move up and expand their abilities.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  l*****  Technology Lead, Business Intelligence - May 24, 2020"
		},
		"458": {
			"rating": "5.0",
			"desc": "Employees are valued",
			"pros": "Atlassian truly cares about their employees - open culture and flexible work environment. ",
			"cons": "Your experience can be really bad depends on your team and manager.",
			"resignation reason": "",
			"authorInfo": "Verified User Current Employee  c****  UX Developer - May 24, 2020"
		}
	}
}
